irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
  </registers>
</peripheral><peripheral>
  <name>SysTick</name>
  <version>1.0</version>
  <description>Cortex M0 SysTick registers</description>
  <groupName>SYSTICK</groupName>
  <baseAddress>0xE000E010</baseAddress>
  <size>0</size>
  <access>ACCESS</access>
  <addressBlock>
		<offset>0</offset>
		<size>0x11</size>
		<usage>registers</usage>
  </addressBlock>
  <registers>
	<register>
	  <name>CTRL</name>
	  <description>SysTick Control and Status register</description>
	  <addressOffset>0x00000000</addressOffset>
	  <size>32</size>
	  <access>read-write</access>
	  <resetValue>0x00000004</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>ENABLE</name>
		  <description>SysTick Counter enable</description>
		  <access>read-write</access>
		  <bitRange>[0:0]</bitRange>
		  <enumeratedValues>
			<name>ENUM</name>
		  </enumeratedValues>
		</field>
		<field>
		  <name>TICKINT</name>
		  <description>SysTick exception request enable</description>
		  <access>read-write</access>
		  <bitRange>[1:1]</bitRange>
		  <enumeratedValues>
			<name>ENUM</name>
		  </enumeratedValues>
		</field>
		<field>
		  <name>CLKSOURCE</name>
		  <description>Clock source selection</description>
		  <access>read-write</access>
		  <bitRange>[2:2]</bitRange>
		  <enumeratedValues>
			<name>ENUM</name>
		  </enumeratedValues>
		</field>
		<field>
		  <name>COUNTFLAG</name>
		  <description>Timer counted to 0 since last time this was read</description>
		  <access>read-write</access>
		  <bitRange>[16:16]</bitRange>
		  <enumeratedValues>
			<name>ENUM</name>
		  </enumeratedValues>
		</field>
	  </fields>
	</register>
	<register>
	  <name>LOAD</name>
	  <description>SysTick Reload value register</description>
	  <addressOffset>0x00000004</addressOffset>
	  <size>32</size>
	  <access>read-write<!--==(HARDCODED)==--></access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>RELOAD</name>
		  <description>RELOAD[23:0] bits (Reload value)</description>
		  <access>read-write</access>
		  <bitRange>[23:0]</bitRange>
		  <enumeratedValues>
			<name>ENUM</name>
		  </enumeratedValues>
		</field>
	  </fields>
	</register>
	<register>
	  <name>VAL</name>
	  <description>SysTick Current value register</description>
	  <addressOffset>0x00000008</addressOffset>
	  <size>32</size>
	  <access>read-write<!--==(HARDCODED)==--></access>
	  <resetValue>0x00000000</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>CURRENT</name>
		  <description>CURRENT[23:0] bits (Current counter value)</description>
		  <access>read-write</access>
		  <bitRange>[23:0]</bitRange>
		  <enumeratedValues>
			<name>ENUM</name>
		  </enumeratedValues>
		</field>
	  </fields>
	</register>
	<register>
	  <name>CALIB</name>
	  <description>SysTick Calibration value register</description>
	  <addressOffset>0x0000000C</addressOffset>
	  <size>32</size>
	  <access>read-only<!--==(HARDCODED)==--></access>
	  <resetValue>0x00002328</resetValue>
	  <resetMask>0xffffffff</resetMask>
	  <fields>
		<field>
		  <name>TENMS</name>
		  <description>TENMS[23:0] bits (Calibration value)</description>
		  <access>read-only</access>
		  <bitRange>[23:0]</bitRange>
		  <enumeratedValues>
			<name>ENUM</name>
		  </enumeratedValues>
		</field>
		<field>
		  <name>SKEW</name>
		  <description>Indicates whether the TENMS value is exact</description>
		  <access>read-only</access>
		  <bitRange>[30:30]</bitRange>
		  <enumeratedValues>
			<name>ENUM</name>
		  </enumeratedValues>
		</field>
		<field>
		  <name>NOREF</name>
		  <description>Indicates that a separate reference clock is provided</description>
		  <access>read-only</access>
		  <bitRange>[31:31]</bitRange>
		  <enumeratedValues>
			<name>ENUM</name>
		  </enumeratedValues>
		</field>
	  </fields>
	</register>
  </registers>
</peripheral><peripheral>
	<name>ADPLL</name>
	<version>1.0</version>
	<description>ADPLL registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x40022000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>152</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>ADPLL_ACC_CTRL_REG</name>
	
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>EN_CMF_AVG</name>
	<description>Enable CMF averaging.
0: Disabled (default)
1: Enabled</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>CLIP_MOD_TUNE_0_TX</name>
	<description>Clipping value for mod_tune 0 in TX mode.</description>
	<access>read-write</access>
	<bitRange>[28:16]</bitRange>
	
</field><field>
	<name>CLIP_MOD_TUNE_0_RX</name>
	<description>Clipping value for mod_tune 0 in RX mode.</description>
	<access>read-write</access>
	<bitRange>[12:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_ANATST_CTRL_REG</name>
	
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>ANATSTSPARE</name>
	<description>Analog test spare outputs.</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>ANATSTEN</name>
	<description>Analog test enable outputs.</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_ANATST_RD_REG</name>
	
	<addressOffset>0x00000094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ANATSTSPARE_IN</name>
	<description>Ana test spare in.</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_ANA_CTRL_REG</name>
	
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x02158063</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DTC_LDO_DMY</name>
	<description>Control signal for TDC/DTC/VPA LDO dummy loads.</description>
	<access>read-write</access>
	<bitRange>[28:27]</bitRange>
	
</field><field>
	<name>VPASETTLE</name>
	<description>Allow TDC after an edge on VPA en
00: No
01: Rising
10: Falling
11: Both edges</description>
	<access>read-write</access>
	<bitRange>[25:24]</bitRange>
	
</field><field>
	<name>TDC_OFFSET</name>
	<description>TDC offset that is to be subtracted from the binary input to obtain the signed value (default 10.5).</description>
	<access>read-write</access>
	<bitRange>[21:16]</bitRange>
	
</field><field>
	<name>DTC_EN</name>
	<description>Enable DTC</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>DTCOFFSET</name>
	<description>Offset Added to DTC output
Only used for test purpose default = 0</description>
	<access>read-write</access>
	<bitRange>[14:8]</bitRange>
	
</field><field>
	<name>TGLDETEN</name>
	<description>Enable PHV toggle and TDC Bubble detection.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>EN_CKDCOMOD</name>
	<description>Enable clock registering the dcomod (default = 1).</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>INV_CKDCOMOD</name>
	<description>Invert clock polarity of the clock registering the dcomod.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>INV_CKPHV</name>
	<description>Invert clock polarity of the clock registering the variable phase accumulator.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>INV_CKTDC</name>
	<description>Invert clock polarity of the clock registering the time to digital converter.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>TDC_INV</name>
	<description>Invert sign of the time to digital converter output.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>TDC_CKVIN_EN</name>
	<description>Enable ckv input of the TDC.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>TDC_DTCIN_EN</name>
	
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
