irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>ADPLL_ATTR_CTRL_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000300</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>OL_TX</name>
	<description>Enable open-loop mode for TX.
0: Disabled (default)
1: Enabled</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>OL_RX</name>
	<description>Enable open-loop mode for RX.
0: Disabled (default)
1: Enabled</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PWR_MODE_TX</name>
	<description>Power mode option to be used in TX.
0: Low power (default)
1: High performance</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>PWR_MODE_RX</name>
	<description>Power mode option to be used in RX.
0: Low power (default)
1: High performance</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>IF_MODE_TX</name>
	<description>IF mode option to be used in TX.
0: 1 Mbps (default)
1: 2 Mbps</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>IF_MODE_RX</name>
	<description>IF mode option to be used in RX.
0: 1 Mbps (default)
1: 2 Mbps</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_CN_CTRL_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x09620100</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CH0</name>
	<description>Channel 0 frequency in MHz (CH0) (ufix13)
default: 2402</description>
	<access>read-write</access>
	<bitRange>[28:16]</bitRange>
	
</field><field>
	<name>SGN</name>
	<description>Sign bit for the channel step
0: positive (default)
1: negative</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>CS</name>
	<description>Channel spacing.
0: 1 MHz spacing
1: 2 MHz spacing (default)</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>CN</name>
	<description>Channel number.
Default: 0</description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_DCOAMP_CAL_CTRL_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x77770011</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DCOAMPIC_LP_TX</name>
	<description>Initial condition for the DCO amplitude setting, for Low Power TX mode..</description>
	<access>read-write</access>
	<bitRange>[31:28]</bitRange>
	
</field><field>
	<name>DCOAMPIC_LP_RX</name>
	<description>Initial condition for the DCO amplitude setting, for Low Power RX mode..</description>
	<access>read-write</access>
	<bitRange>[27:24]</bitRange>
	
</field><field>
	<name>DCOAMPIC_HP_TX</name>
	<description>Initial condition for the DCO amplitude setting, for High Performance TX mode..</description>
	<access>read-write</access>
	<bitRange>[23:20]</bitRange>
	
</field><field>
	<name>DCOAMPIC_HP_RX</name>
	<description>Initial condition for the DCO amplitude setting, for High Performance RX mode..</description>
	<access>read-write</access>
	<bitRange>[19:16]</bitRange>
	
</field><field>
	<name>DCOAMPTM</name>
	<description>Time spend to perform DCO amplitude calibration
0: 1 us
1: 2 us</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>AMPCALEN</name>
	<description>Enable DCO amplitude calibration.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>KMEDIUM</name>
	<description>Proportional gain setting for medium tuning.</description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	
</field><field>
	<name>KCOARSE</name>
	<description>Proportional gain setting for coarse tuning.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_DCO_RD_REG</name>
	
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x1c000007</resetValue>
	<resetMask>0x3fffffff</resetMask>
	<fields>
	<field>
	<name>DCOAMP</name>
	<description>DCO amplitude setting.
The read value is the output of adplldig (towards the analog). So, the read value is even after the overruling.</description>
	<access>read-only</access>
	<bitRange>[29:26]</bitRange>
	
</field><field>
	<name>DCOMOD</name>
	<description>Current state of the DCO mod capacitor bank
(signed)
The open-loop output (before the addition of modulated data). So, it is after averaging, before SDM and addition of the modulated data.</description>
	<access>read-only</access>
	<bitRange>[25:13]</bitRange>
	
</field><field>
	<name>DCOFINE</name>
	<description>Current state of the DCO fine capacitor bank
(signed)
ACC outputs are read (the averaged values.)
For CMF we are reading before bin2thm conversion</description>
	<access>read-only</access>
	<bitRange>[12:7]</bitRange>
	
</field><field>
	<name>DCOMEDIUM</name>
	<description>Current state of the DCO medium capacitor bank
(signed)
ACC outputs are read (the averaged values.)
For CMF we are reading before bin2thm conversion</description>
	<access>read-only</access>
	<bitRange>[6:4]</bitRange>
	
</field><field>
	<name>DCOCOARSE</name>
	<description>Current state of the DCO coarse capacitor bank
(signed)
ACC outputs are read (the averaged values.)
For CMF we are reading before bin2thm conversion</description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_DIV_CTRL_REG</name>
	
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0198ff03</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TXDIV_TRIM</name>
	<description>Tx divider trim value.</description>
	<access>read-write</access>
	<bitRange>[25:17]</bitRange>
	
</field><field>
	<name>RXDIV_TRIM</name>
	<description>Rx divider trim value.</description>
	<access>read-write</access>
	<bitRange>[16:8]</bitRange>
	
</field><field>
	<name>RXDIV_FB_EN_TX</name>
	<description>Enable rxdiv for FB in TX mode.
0: Disable (default)
1: Enable</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RXDIV_FB_EN_RX</name>
	<description>Enable rxdiv for FB in RX mode.
0: Disable (default)
1: Enable</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>FBDIV_EN</name>
	<description>Feedback divider enable
1: Enabled
0: Disabled.

If diabled both feedback and RF output clock will be disabled. This bit is intended for test purposes (not for normal usage).</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
