irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>ADPLL_FIF_CTRL1_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x08000400</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>FIFRX_2M</name>
	<description>IF frequency (in MHz) used in 2 Mbps RX mode
sfix(14,10) - 1 bit sign, 3 bits integer, 10 bits fractional for MHz unit.</description>
	<access>read-write</access>
	<bitRange>[29:16]</bitRange>
	
</field><field>
	<name>FIFRX_1M</name>
	<description>IF frequency (in MHz) used in 1 Mbps RX mode
sfix(14,10) - 1 bit sign, 3 bits integer, 10 bits fractional for MHz unit.</description>
	<access>read-write</access>
	<bitRange>[13:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_FIF_CTRL2_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>FIFTX</name>
	<description>IF frequency (in MHz) used in TX mode
sfix(14,10) - 1 bit sign, 3 bits integer, 10 bits fractional for MHz unit.</description>
	<access>read-write</access>
	<bitRange>[29:16]</bitRange>
	
</field><field>
	<name>FIFRX_OFFSET</name>
	<description>Offset for the IF frequency (in MHz) in RX mode.
sfix(14,10) - 1 bit sign, 3 bits integer, 10 bits fractional for MHz unit.</description>
	<access>read-write</access>
	<bitRange>[13:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_FREQMEAS_RD_REG</name>
	
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x21000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DCOAMPDET_ASYNC</name>
	<description>DCO amplitude detector input (Used for amplitude calibration)</description>
	<access>read-only</access>
	<bitRange>[30:30]</bitRange>
	
</field><field>
	<name>MEASDONE_OUT</name>
	<description>Signal indicating the state of the frequency counter
0: Measuring frequency
1: Measurement done</description>
	<access>read-only</access>
	<bitRange>[29:29]</bitRange>
	
</field><field>
	<name>QUALMONDET</name>
	<description>Clock quality monitoring detector output.</description>
	<access>read-only</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>TDCBUB</name>
	<description>Detector output indicating a bubble error in the TDC input.</description>
	<access>read-only</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>PHVSA0</name>
	<description>Detector output indicating a stuck-at 0 on the variable phase accumulator input .</description>
	<access>read-only</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>PHVSA1</name>
	<description>Detector output indicating a stuck-at 1 on the variable phase accumulator input .</description>
	<access>read-only</access>
	<bitRange>[23:23]</bitRange>
	
</field><field>
	<name>FREQDIFF</name>
	<description>Measurend frequency difference (signed).</description>
	<access>read-only</access>
	<bitRange>[22:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_FSM_CTRL_REG</name>
	
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x08f8ae84</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TVPASETTLE</name>
	<description>Settling time required after vpa disable.</description>
	<access>read-write</access>
	<bitRange>[29:24]</bitRange>
	
</field><field>
	<name>TSETTLE</name>
	<description>Time spend waiting for settling
0 - 15: 0 - 7.5 us (t = TSETTLE/2)</description>
	<access>read-write</access>
	<bitRange>[23:20]</bitRange>
	
</field><field>
	<name>TPASETTLE</name>
	<description>Time spend waiting for PA to settle
0 - 15: 0 - 7.5 us (t = TPASETTLE/2)</description>
	<access>read-write</access>
	<bitRange>[19:16]</bitRange>
	
</field><field>
	<name>TMOD</name>
	<description>Time spend for fine tuning
0 - 15: 0 - 15 us (t = TMOD)</description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	
</field><field>
	<name>TFINE</name>
	<description>Time spend for fine tuning
0 - 15: 0 - 15 us (t = TFINE)</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>TMEDIUM</name>
	<description>Time spend for medium tuning
0 - 15: 0 - 7.5 us (t = TMEDIUM/2)
If &lt; 1 us and amplitude calibration is enabled TMEDIUM = 1 us.</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>TCOARSE</name>
	<description>Time spend for coarse tuning
0 - 15: 0 - 7.5 us (t = TCOARSE/2)</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_INIT_CTRL_REG</name>
	
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000005</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DCOMODIC</name>
	<description>Initial condition for fine cap bank.
(signed)</description>
	<access>read-write</access>
	<bitRange>[28:16]</bitRange>
	
</field><field>
	<name>DCOFINEIC</name>
	<description>Initial condition for fine cap bank.
(signed)</description>
	<access>read-write</access>
	<bitRange>[13:8]</bitRange>
	
</field><field>
	<name>DCOMEDIUMIC</name>
	<description>Initial condition for medium cap bank.
(signed)</description>
	<access>read-write</access>
	<bitRange>[6:4]</bitRange>
	
</field><field>
	<name>DCOCOARSEIC</name>
	<description>Initial condition for coarse cap bank.
(signed)</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_KDCO_CAL_CTRL1_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>KDCOLF_IN_2M</name>
	<description>Gain setting for the low frequency path in case of not using the calibrated KDCOHF for 2M mode (uint8).</description>
	<access>read-write</access>
	<bitRange>[31:24]</bitRange>
	
</field><field>
	<name>KDCOLF_IN_1M</name>
	<description>Gain setting for the low frequency path in case of not using the calibrated KDCOHF for 1M mode (uint8).</description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	
</field><field>
	<name>KDCOHFIC_2M</name>
	<description>Initial gain setting for the high frequency path for 2M mode (uint8).</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>KDCOHFIC_1M</name>
	<description>Initial gain setting for the high frequency path for 1M mode (uint8).</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
