irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>ADPLL_KDCO_CAL_CTRL2_REG</name>
	
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x4c140a0a</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>KDCOESTDEV</name>
	<description>Frequency deviation used for KDCO estimation:
0: 500 kHz
1: 250 kHz (default)
2: 125 kHz
3: 62.5 kHz</description>
	<access>read-write</access>
	<bitRange>[31:30]</bitRange>
	
</field><field>
	<name>KDCOCALTX</name>
	<description>Enable for KDCO calibration in transmit mode.</description>
	<access>read-write</access>
	<bitRange>[29:29]</bitRange>
	
</field><field>
	<name>KDCOCALRX</name>
	<description>Enable for KDCO calibration in receive mode.</description>
	<access>read-write</access>
	<bitRange>[28:28]</bitRange>
	
</field><field>
	<name>KDCOLFCALEN</name>
	<description>Enable the use of the (calibrated) value for KDCOHF for the low frequency path.</description>
	<access>read-write</access>
	<bitRange>[27:27]</bitRange>
	
</field><field>
	<name>TKDCOCAL</name>
	<description>Time spend for KDCO calibration settling:
0: 0.5 us 16
1: 1 us 32
2: 2 us 64
3: 4 us 128
4: 8 us</description>
	<access>read-write</access>
	<bitRange>[26:24]</bitRange>
	
</field><field>
	<name>KDCOCN_IC</name>
	<description>Initial condition for channel number related to calibration result.</description>
	<access>read-write</access>
	<bitRange>[22:16]</bitRange>
	
</field><field>
	<name>KMOD_ALPHA_2M</name>
	<description>KDCOHF channel dependent trimming constant for 2M mode.
0: No trimming.
&gt;0: KDCOHF is modified with a factor: 1-SGNx(KMOD_ALPHA_2M)x(CN-CN_CAL_RD)/4096</description>
	<access>read-write</access>
	<bitRange>[12:8]</bitRange>
	
</field><field>
	<name>KMOD_ALPHA_1M</name>
	<description>KDCOHF channel dependent trimming constant for 1M mode.
0: No trimming.
&gt;0: KDCOHF is modified with a factor: 1-SGNx(KMOD_ALPHA_1M)x(CN-CN_CAL_RD)/4096</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_KDCO_RD_REG</name>
	
	<addressOffset>0x00000084</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields>
	<field>
	<name>CAL_KDCOCAL</name>
	<description>Calibration state of the KDCO calibration.</description>
	<access>read-only</access>
	<bitRange>[23:23]</bitRange>
	
</field><field>
	<name>KDCOCN</name>
	<description>Channel number related to calibration result.</description>
	<access>read-only</access>
	<bitRange>[22:16]</bitRange>
	
</field><field>
	<name>KDCO_HF_OUT</name>
	<description>kmod_alpha compensated KDCO gain.</description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>KDCO_HF_INT</name>
	<description>KDCO gain.</description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_KDTCTDC_CAL_CTRL1_REG</name>
	
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>KDTCIC</name>
	<description>Initial condition for the DTC gain correction.</description>
	<access>read-write</access>
	<bitRange>[31:23]</bitRange>
	
</field><field>
	<name>KDTCCN_IC</name>
	<description>Initial condition for channel number related to calibration result.</description>
	<access>read-write</access>
	<bitRange>[22:16]</bitRange>
	
</field><field>
	<name>KDTC_PIPELINE_BYPASS</name>
	<description>Bypass the extra register on prv_phr.</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>KTDC_IN</name>
	<description>TDC gain setting in case of not using the calibrated gain setting.</description>
	<access>read-write</access>
	<bitRange>[14:6]</bitRange>
	
</field><field>
	<name>KDTC_ALPHA</name>
	<description>KDTC channel dependent trimming constant.
0: No trimming.
&gt;0: KDTC is modified with a factor: 1-SGNx(KDTC_ALPHA)x(CN-CN_CAL_RD)/16384</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_KDTCTDC_CAL_CTRL2_REG</name>
	
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00007f50</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PHRDLY_EXTRA</name>
	
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>TKDTCCAL</name>
	<description>Time spend waiting for DTC calibration (0-15) 0 - 15 us t = tkdtccal/2.</description>
	<access>read-write</access>
	<bitRange>[14:11]</bitRange>
	
</field><field>
	<name>PHRDLY</name>
	<description>Delay phr used for kdtc calibration by 1-4 samples, default: 3 samples (2).</description>
	<access>read-write</access>
	<bitRange>[10:9]</bitRange>
	
</field><field>
	<name>KTDCCALEN</name>
	<description>Enable calibration of TDC via DTC calibration.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>KDTCCALLG</name>
	<description>Loopgain setting used for DTC calibration.</description>
	<access>read-write</access>
	<bitRange>[6:4]</bitRange>
	
</field><field>
	<name>KDTCCAL_INV</name>
	<description>Invert sign of kdtc calibration loop (default: 0).</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>KDTCCALMOD1P</name>
	<description>Chicken bit to change phase of KDTC cal mode 1 phase.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>KDTCCALMOD</name>
	<description>Mode select for KDTC alogrithm:
0: Just-in-time algorithm (least intrusive)
1: Interger lock to Fref/2 and use second clock phase for calibration (no issue with local optimum)</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>KDTCCALEN</name>
	<description>Enable DTC calibration.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
