irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>ADPLL_KDTC_RD_REG</name>
	
	<addressOffset>0x00000088</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields>
	<field>
	<name>CAL_KDTCCAL</name>
	<description>Calibration state of the KDTC calibration.</description>
	<access>read-only</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>KDTC_ALPHA_COMP</name>
	<description>KDTC_ALPHA compensated DTC gain setting. Used as TDC gain setting used to correct loopgain.</description>
	<access>read-only</access>
	<bitRange>[24:16]</bitRange>
	
</field><field>
	<name>KDTCCN</name>
	<description>Channel number related to calibration result.</description>
	<access>read-only</access>
	<bitRange>[15:9]</bitRange>
	
</field><field>
	<name>KDTC_OUT</name>
	<description>DTC gain setting updated in tuning state 13. Used for register readback.</description>
	<access>read-only</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_LF_CTRL1_REG</name>
	
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000818c</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>FINEKZ</name>
	<description>Corner frequency setting of the first order low-pass filter that is used for tuning the fine bank.</description>
	<access>read-write</access>
	<bitRange>[15:10]</bitRange>
	
</field><field>
	<name>FINEK</name>
	<description>Loopfilter loopgain frequency during fine tuning.</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>FINETAU</name>
	<description>First order low-pass filter c.rst_ner frequency during fine tuning.</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_LF_CTRL2_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x1ca2879e</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RST_TAU_EN</name>
	<description>Enable state machine to control reset of tau filter.</description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	
</field><field>
	<name>MODKZ</name>
	<description>Loopgain setting of the loop-filter that is used for tuning the MOD bank.</description>
	<access>read-write</access>
	<bitRange>[29:24]</bitRange>
	
</field><field>
	<name>MODK</name>
	<description>Corner frequency setting of the zero filter that is used for tuning the MOD bank.</description>
	<access>read-write</access>
	<bitRange>[23:18]</bitRange>
	
</field><field>
	<name>MODTAU</name>
	<description>Corner frequency setting of the first order low-pass filter that is used for tuning the MOD bank.</description>
	<access>read-write</access>
	<bitRange>[17:12]</bitRange>
	
</field><field>
	<name>MODK_TUNE</name>
	<description>Loopfilter loopgain frequency during mod tuning.</description>
	<access>read-write</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>MODTAU_TUNE</name>
	<description>First order low-pass filter c.rst_ner frequency during mod tuning.</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_MISC_CTRL_REG</name>
	
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000d9</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PHR_FRAC_PRESET_VAL</name>
	<description>Controls the set level of the DCO amplitude detector.</description>
	<access>read-write</access>
	<bitRange>[24:8]</bitRange>
	
</field><field>
	<name>ENFCWMOD</name>
	<description>Enable two point modulation.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>ENRESIDUE</name>
	<description>Enable residue correction .</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>MODDLY</name>
	<description>Delay modulation (injected at the capcitor bank) by 0-3 samples.</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>RESDLY</name>
	<description>Delay residue by 0-3 samples.</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>DLYFCWDT</name>
	<description>Delay reference path of the two point modulation.</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_MON_CTRL_REG</name>
	
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00fc0f83</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QUALMONFRCEN</name>
	<description>Force enable of the clock quality monitor.</description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	
</field><field>
	<name>QUALMONTRHLD</name>
	<description>Clock quality monitoring threshold.</description>
	<access>read-write</access>
	<bitRange>[29:24]</bitRange>
	
</field><field>
	<name>QUALMONWND</name>
	<description>Clock quality monitoring window length.</description>
	<access>read-write</access>
	<bitRange>[23:18]</bitRange>
	
</field><field>
	<name>QUALMONMOD</name>
	<description>Clock quality monitoring mode:
0: Highpass output
1: TDC
2: Lowpass output
3: Loop filter output</description>
	<access>read-write</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>HOLD_STATE</name>
	<description>Set a break point at which the tuning state machine will hold it's state.</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>RFMEAS_MODE</name>
	<description>RF measurement mode for the Divider calibrations.
0 : Jerzy RF measurement.
1 (default): RF measurement for divider calibration.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>ENRFMEAS</name>
	<description>Enable open loop frequency measurement.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>TMREN</name>
	<description>Enable timer for measuring PLL settling time.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>TFREQMEAS</name>
	<description>Frequency measurement time
Two lsb's form the linear part, the three MSB's are the exponent
Time [us] = 0.5+((4+lin)*(2^(exp-1)))
tfreqmeas Time [us]
0: 2.5
1: 3
2: 3.5
3: 4
4: 4.5
5: 5.5
6: 6.5
7: 7.5
8: 8.5
9: 10.5
10: 12.5
11: 14.5
12: 16.5
13: 20.5
14: 24.5
15: 28.5
16: 32.5
17: 40.5
18: 48.5
19: 56.5
20: 64.5
21: 80.5
22: 96.5
23: 112.5
24: 128.5
25: 160.5
26: 192.5
27: 224.5
28: 256.5
29: 320.5
30: 384.5
31: 448.5</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
