irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>ADPLL_OL_CTRL_REG</name>
	
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x44010000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OL_RDY</name>
	<description>Read out openloop_rdy output before gating with rxbit status.</description>
	<access>read-only</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>NAVG_OL</name>
	<description>Averaging ratio. Division for averaging: 2NAVG_OL.</description>
	<access>read-write</access>
	<bitRange>[30:27]</bitRange>
	
</field><field>
	<name>TAVG_OL</name>
	<description>Number of dcomod samples to be averaged.
TAVG_OL = 2NAVG_OL)</description>
	<access>read-write</access>
	<bitRange>[26:18]</bitRange>
	
</field><field>
	<name>TSETTLE_OL</name>
	<description>Number of clocks cycles to wait for dcomod to settle, before starting averaging for open loop mode.</description>
	<access>read-write</access>
	<bitRange>[17:8]</bitRange>
	
</field><field>
	<name>TXDIV_EN_OL_RX</name>
	<description>txdiv_en value to be used in open loop mode when in RX.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>FBDIV_EN_OL_RX</name>
	<description>fbdiv_en value to be used in open loop mode when in RX.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RXDIV_FB_EN_OL_RX</name>
	<description>rxdiv_fb_en value to be used in open loop mode when in RX.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_OVERRULE_CTRL1_REG</name>
	
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OVR_DTC_OH_WR</name>
	<description>Overrule value (binary) for the dtc_oh.</description>
	<access>read-write</access>
	<bitRange>[31:25]</bitRange>
	
</field><field>
	<name>OVR_DTC_OH_SEL</name>
	<description>Overrule dtc_oh output.
0: Normal function (default)
1: Overrule dtc_oh output by OVR_DTC_OH_WR</description>
	<access>read-write</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>OVR_DCOAMP_WR</name>
	<description>Overrule value for the dcoamp.</description>
	<access>read-write</access>
	<bitRange>[20:17]</bitRange>
	
</field><field>
	<name>OVR_DCOAMP_SEL</name>
	<description>Overrule dcoamp output.
0: Normal function (default)
1: Overrule dcoamp output by OVR_DCOAMP_WR</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>OVR_DCOAMPHOLD_WR</name>
	<description>Overrule value for the dcoamp_hold..</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>OVR_DCOAMPHOLD_SEL</name>
	<description>Overrule dcoamphold output.
0: Normal function (default)
1: Overrule dcoamphold output by OVR_DCOAMPHOLD_WR</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>OVR_RDYFORDIV_WR</name>
	<description>Overrule value for the rdy_for_div input.</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>OVR_RDYFORDIV_SEL</name>
	<description>Overrule rdy_for_div input.
0: Normal function (default)
1: Overrule rdy_for_div input by OVR_RDYFORDIV_WR</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>OVR_VPAEN_WR</name>
	<description>Overrule value for the vpa_en.</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>OVR_VPAEN_SEL</name>
	<description>Overrule vpaen.
0: Normal function (default)
1: Overrule vpaen by OVR_VPAEN_WR</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>OVR_SRESETN_WR</name>
	<description>Overrule value for the sreset_n.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>OVR_SRESETN_SEL</name>
	<description>Overrule sreset_n of the modulator.
0: Normal function (default)
1: Overrule sreset_n by OVR_SRESETN_WR</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>OVR_ENPAIN_WR</name>
	<description>Overrule value for the enpain.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>OVR_ENPAIN_SEL</name>
	<description>Overrule enpain input.
0: Normal function (default)
1: Overrule enpain input by OVR_ENPAIN_WR</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>OVR_RXBIT_WR</name>
	<description>Overrule value for the rxbit.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>OVR_RXBIT_SEL</name>
	<description>Overrule rxbit input.
0: Normal function (default)
1: Overrule rxbit input by OVR_RXBIT_WR</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>OVR_ACTIVE_WR</name>
	<description>Overrule value for the active.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>OVR_ACTIVE_SEL</name>
	<description>Overrule active input.
0: Normal function (default)
1: Overrule active input by OVR_ACTIVE_WR</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_OVERRULE_CTRL2_REG</name>
	
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OVR_DCOMOD_WR</name>
	<description>Overrule value (binary) for the internal dcomod.</description>
	<access>read-write</access>
	<bitRange>[31:24]</bitRange>
	
</field><field>
	<name>OVR_DCOMOD_SEL</name>
	<description>Overrule dcomod output.
0: Normal function (default)
1: Overrule dcomod output by OVR_DCOMOD_WR</description>
	<access>read-write</access>
	<bitRange>[23:23]</bitRange>
	
</field><field>
	<name>OVR_DCOFINE_WR</name>
	<description>Overrule value (binary) for the internal dcofine.</description>
	<access>read-write</access>
	<bitRange>[22:17]</bitRange>
	
</field><field>
	<name>OVR_DCOFINE_SEL</name>
	<description>Overrule dcomod output.
0: Normal function (default)
1: Overrule dcomod output by OVR_DCOFINE_WR</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>OVR_DCOMEDIUM_WR</name>
	<description>Overrule value (binary) for the internal dcomedium.</description>
	<access>read-write</access>
	<bitRange>[11:9]</bitRange>
	
</field><field>
	<name>OVR_DCOMEDIUM_SEL</name>
	<description>Overrule dcomod output.
0: Normal function (default)
1: Overrule dcomod output by OVR_DCOMEDIUM_WR</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>OVR_DCOCOARSE_WR</name>
	<description>Overrule value (binary) for the internal dcocoarse.</description>
	<access>read-write</access>
	<bitRange>[4:1]</bitRange>
	
</field><field>
	<name>OVR_DCOCOARSE_SEL</name>
	<description>Overrule dcomod output.
0: Normal function (default)
1: Overrule dcomod output by OVR_DCOCOARSE_WR</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
