irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>ADPLL_OVERRULE_CTRL3_REG</name>
	
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>OVR_OPENLOOP_RDY_INT_WR</name>
	<description>Overrule value for the internal openloop_rdy.</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>OVR_OPENLOOP_RDY_INT_SEL</name>
	<description>Overrule internal openloop_rdy.
0: Normal function (default)
1: Overrule internal openloop_rdy by OVR_OPENLOOP_RDY_INT_WR</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>OVR_OPENLOOP_RDY_WR</name>
	<description>Overrule value for the openloop_rdy output.</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>OVR_OPENLOOP_RDY_SEL</name>
	<description>Overrule openloop_rdy output.
0: Normal function (default)
1: Overrule openloop_rdy output by OVR_OPENLOOP_RDY_WR</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>OVR_RXDIV_FB_EN_WR</name>
	<description>Overrule value for the rxdiv_fb_en output.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>OVR_RXDIV_FB_EN_SEL</name>
	<description>Overrule rxdiv_fb_en output.
0: Normal function (default)
1: Overrule rxdiv_fb_en output by OVR_RXDIV_FB_EN_WR</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>OVR_FBDIV_EN_WR</name>
	<description>Overrule value for the fbdiv_en output.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>OVR_FBDIV_EN_SEL</name>
	<description>Overrule fbdiv_en output.
0: Normal function (default)
1: Overrule fbdiv_en output by OVR_FBDIV_EN_WR</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>OVR_TXDIV_EN_WR</name>
	<description>Overrule value for the txdiv_en output.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>OVR_TXDIV_EN_SEL</name>
	<description>Overrule txdiv_en output.
0: Normal function (default)
1: Overrule txdiv_en output by OVR_TXDIV_EN_WR</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>OVR_RXDIV_EN_WR</name>
	<description>Overrule value for the rxdiv_en output.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>OVR_RXDIV_EN_SEL</name>
	<description>Overrule rxdiv_en.
0: Normal function (default)
1: Overrule rxdiv_en output by OVR_RXDIV_EN_WR</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_PLLFCWDT_RD_REG</name>
	
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00258800</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields>
	<field>
	<name>PLLFCWDT</name>
	<description>PLLFCWDT.</description>
	<access>read-only</access>
	<bitRange>[22:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_RFPT_CTRL_REG</name>
	
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>RFPT_RATE</name>
	<description>RFPT rate setting
0: 32MSPS
1: 16 MSPS</description>
	<access>read-write</access>
	<bitRange>[6:5]</bitRange>
	
</field><field>
	<name>INV_CKRFPT</name>
	<description>Invert clock registering output of the RFPT interface.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>RFPT_MUX</name>
	<description>Multiplexer setting for RFPT interface output.
The following data will be provided to the rfpt interface:
0: RFPT disabled (default)
1: {tdc_invert,tdc_b,tdc_t_reg}
2: {8'd0, dcocoarse, 1'd0,dcomedium, 2'd0,dcofine, dcomod_sdm}
3: {2'd0, phe_int, 1'd0,phv_int, 1'd0,phr_int0, phe_int_int}
4: {lfout_int,lfout_frac,int_state,lpout,kdtc_int}
5, ..., 15: Reserved.</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_SDMOD_CTRL_REG</name>
	
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000039</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SDMMODERX_OL</name>
	<description>Open Loop Sigma delta modulator mode :
0: Disabled
1: MASH I
3: MASH II
5: MASH I + with dithering
7: MASH II + with dithering</description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>SDMMODETX</name>
	<description>Sigma delta modulator mode :
0: Disabled
1: MASH I
3: MASH II
5: MASH I + with dithering
7: MASH II + with dithering</description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	
</field><field>
	<name>SDMMODERX</name>
	<description>Sigma delta modulator mode :
0: Disabled
1: MASH I
3: MASH II
5: MASH I + with dithering
7: MASH II + with dithering</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_TUNESTATE_RD_REG</name>
	
	<addressOffset>0x0000008c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>TMRVAL</name>
	<description>Current timer value. Timer can be used to determine PLL settling time and is used for frequency measurement.</description>
	<access>read-only</access>
	<bitRange>[13:4]</bitRange>
	
</field><field>
	<name>TUNE_STATE</name>
	<description>Binary coded state of the tuning state machine.</description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ADPLL_TXMOD_CTRL_REG</name>
	
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>INV_CKMODEXT</name>
	<description>Invert the clock, which captures the external modulated data.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>TX_MODE</name>
	<description>Two-point modulation MUX:
0,3: mod_hf = mod_in
mod_lf = mod_in
1: mod_hf = 0
mod_lf = mod_in
2: mod_hf = mod_in
mod_lf = 0</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>MOD_EXT_SEL</name>
	<description>0: Normal operation
1: User externally provided value for the modulation</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>EO_PACKET_DIS</name>
	<description>The block will normally detect the end of a data packet by the missing tx_data_en pulses.
The outputs will be smoothly return to zero when an end of a data packet has been deteted.
The end of a data packet detected can be disabled by setting eo_packet_dis = 1. This is
normally/never used and eo_packet_dis should always be set to zero.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>MOD_INDEX</name>
	<description>Modulation index selection:
0: h = 1/2 (dF = 250 kHz)
1 h = 1/4 (dF = 125 kHz):
2: h = 17/32 (dF = 266 kHz)
3: h = 35/64 (dF = 273 kHz)</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>TX_DATA_INV</name>
	<description>Select polarity of the modulation prior to pulse shaping
0: Normal operation
1: Invert modulation signal</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>BT_SEL</name>
	<description>The BT product for the Gaussian pulse can take the values 0.5 or 0.6.
0: BT = 0.5
1: BT = 0.6</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
