irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>CLK_REF_CNT_REG</name>
	<description>Count value for oscillator calibration</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>REF_CNT_VAL</name>
	<description>Indicates the calibration time, with a decrement counter to 1. </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_REF_SEL_REG</name>
	<description>Select clock for oscillator calibration</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>CAL_CLK_SEL</name>
	<description>Select reference clock input to be used in calibration:
0x0 : DIVN clock
0x1 : RC32K
0x2 : RC32M
0x3 : XTAL32K
0x4 : RCOSC
0x5, 0x6, 0x7: Reserved</description>
	<access>read-write</access>
	<bitRange>[7:5]</bitRange>
	
</field><field>
	<name>EXT_CNT_EN_SEL</name>
	<description>0 : Enable XTAL_CNT counter by the REF_CLK selected by REF_CLK_SEL.
1 : Enable XTAL_CNT counter from an external input.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>REF_CAL_START</name>
	<description>Writing a '1' starts a calibration. This bit is cleared when calibration is finished, and CLK_REF_VAL is ready. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>REF_CLK_SEL</name>
	<description>Select clock input for calibration:
0x0 : RC32K
0x1 : RC32M
0x2 : XTAL32K
0x3 : RCX
0x4 : RCOSC</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_REF_VAL_REG</name>
	<description>DIVN reference cycles, lower 16 bits</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>XTAL_CNT_VAL</name>
	<description>Returns the number of DIVN clock cycles counted during the calibration time, defined with REF_CNT_VAL </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>APU</name>
	<version>1.0</version>
	<description>APU registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50030600</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>276</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>APU_MUX_REG</name>
	<description>APU mux register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>PDM1_MUX_IN</name>
	<description>PDM1 input mux
0 = SRC1_MUX_IN
1 = PDM input</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>PCM1_MUX_IN</name>
	<description>PCM1 input mux
0 = off
1 = SRC1 output
2 = PCM output registers</description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	
</field><field>
	<name>SRC1_MUX_IN</name>
	<description>SRC1 input mux
0 = off
1 = PCM output
2 = SRC1 input registers</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEF0A_SET1_REG</name>
	<description>SRC coefficient 10 set 1</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000041f2</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SRC_COEF10</name>
	<description>coefficient 10</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEF10_SET1_REG</name>
	<description>SRC coefficient 1,0 set 1</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x79a99278</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_COEF1</name>
	<description>coefficient 1</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>SRC_COEF0</name>
	<description>coefficient 0</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEF32_SET1_REG</name>
	<description>SRC coefficient 3,2 set 1</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x6d568b41</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_COEF3</name>
	<description>coefficient 3</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>SRC_COEF2</name>
	<description>coefficient 2</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEF54_SET1_REG</name>
	<description>SRC coefficient 5,4 set 1</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_COEF5</name>
	<description>coefficient 5</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>SRC_COEF4</name>
	<description>coefficient 4 </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>COEF76_SET1_REG</name>
	<description>SRC coefficient 7,6 set 1</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_COEF7</name>
	<description>coefficient 7
</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>SRC_COEF6</name>
	<description>coefficient 6</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
