irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>COEF98_SET1_REG</name>
	<description>SRC coefficient 9,8 set 1</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_COEF9</name>
	<description>coefficient 9</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>SRC_COEF8</name>
	<description>coefficient 8</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PCM1_CTRL_REG</name>
	<description>PCM1 Control register</description>
	<addressOffset>0x00000100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PCM_FSC_DIV</name>
	<description>PCM Framesync divider, Values 7-0xFFF. To divide by N, write N-1. (Minimum value N-1=7 for 8 bits PCM_FSC)
Note if PCM_CLK_BIT=1, N must always be even</description>
	<access>read-write</access>
	<bitRange>[31:20]</bitRange>
	
</field><field>
	<name>PCM_FSC_EDGE</name>
	<description>0: shift channels 1, 2, 3, 4, 5, 6, 7, 8 after PCM_FSC edge
1: shift channels 1, 2, 3, 4 after PCM_FSC edge shift channels 5, 6, 7, 8 after opposite PCM_FSC edge </description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>PCM_CH_DEL</name>
	<description>Channel delay in multiples of 8 bits </description>
	<access>read-write</access>
	<bitRange>[15:11]</bitRange>
	
</field><field>
	<name>PCM_CLK_BIT</name>
	<description>0:One clock cycle per data bit
1:Two cloc cycles per data bit</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PCM_FSCINV</name>
	<description>0: PCM FSC
1: PCM FSC inverted</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>PCM_CLKINV</name>
	<description>0:PCM CLK
1:PCM CLK inverted</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>PCM_PPOD</name>
	<description>0:PCM DO push pull
1:PCM DO open drain</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>PCM_FSCDEL</name>
	<description>0:PCM FSC starts one cycle before MSB bit
1:PCM FSC starts at the same time as MSB bit</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>PCM_FSCLEN</name>
	<description>0:PCM FSC length equal to 1 data bit
N:PCM FSC length equal to N*8 </description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	
</field><field>
	<name>PCM_MASTER</name>
	<description>0:PCM interface in slave mode
1:PCM interface in master mode</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>PCM_EN</name>
	<description>0:PCM interface disabled
1:PCM interface enabled</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PCM1_IN1_REG</name>
	<description>PCM1 data in 1</description>
	<addressOffset>0x00000104</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PCM_IN</name>
	<description>PCM1_IN1 bits 31-0 </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PCM1_IN2_REG</name>
	<description>PCM1 data in 2</description>
	<addressOffset>0x00000108</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PCM_IN</name>
	<description>PCM1_IN2 bits 31-0 </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PCM1_OUT1_REG</name>
	<description>PCM1 data out 1</description>
	<addressOffset>0x0000010c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PCM_OUT</name>
	<description>PCM1_OUT1 bits 31-0 </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PCM1_OUT2_REG</name>
	<description>PCM1 data out 2</description>
	<addressOffset>0x00000110</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PCM_OUT</name>
	<description>PCM1_OUT2 bits 31-0 </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SRC1_CTRL_REG</name>
	<description>SRC1 control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_PDM_DO_DEL</name>
	<description>PDM_DO output delay line (typical)
0: no delay
1: 8 ns
2: 12 ns
3: 16 ns</description>
	<access>read-write</access>
	<bitRange>[31:30]</bitRange>
	
</field><field>
	<name>SRC_PDM_MODE</name>
	<description>PDM Output mode selection on PDM_DO1
00: No output
01: Right channel (falling edge of PDM_CLK)
10: Left channel (rising edge of PDM_CLK)
11: Left and Right channel</description>
	<access>read-write</access>
	<bitRange>[29:28]</bitRange>
	
</field><field>
	<name>SRC_PDM_DI_DEL</name>
	<description>PDM_DI input delay line (typical)
0: no delay
1: 4 ns
2: 8 ns
3: 12 ns</description>
	<access>read-write</access>
	<bitRange>[27:26]</bitRange>
	
</field><field>
	<name>SRC_OUT_FLOWCLR</name>
	<description>Writing a 1 clears the SRC1_OUT Overflow/underflow bits 23-22. No more over/underflow indications while bit is 1. Keep 1 until the over/under flow bit is cleared </description>
	<access>write-only</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>SRC_IN_FLOWCLR</name>
	<description>Writing a 1 clears the SRC1_IN Overflow/underflow bits 21-20. No more over/underflow indications while bit is 1. Keep 1 until the over/under flow bit is cleared </description>
	<access>write-only</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>SRC_OUT_UNFLOW</name>
	<description>1 = SRC1_OUT Underflow occurred </description>
	<access>read-only</access>
	<bitRange>[23:23]</bitRange>
	
</field><field>
	<name>SRC_OUT_OVFLOW</name>
	<description>1 = SRC1_OUT Overflow occurred </description>
	<access>read-only</access>
	<bitRange>[22:22]</bitRange>
	
</field><field>
	<name>SRC_IN_UNFLOW</name>
	<description>1 = SRC1_IN Underflow occurred </description>
	<access>read-only</access>
	<bitRange>[21:21]</bitRange>
	
</field><field>
	<name>SRC_IN_OVFLOW</name>
	<description>1 = SRC1_IN Overflow occurred </description>
	<access>read-only</access>
	<bitRange>[20:20]</bitRange>
	
</field><field>
	<name>SRC_RESYNC</name>
	<description>1 = SRC will restart synchronisation</description>
	<access>write-only</access>
	<bitRange>[19:19]</bitRange>
	
</field><field>
	<name>SRC_OUT_OK</name>
	<description>SRC1_OUT Status
0: acquisition in progress
1: acquisition ready (In manual mode this bit is always 1)</description>
	<access>read-only</access>
	<bitRange>[18:18]</bitRange>
	
</field><field>
	<name>SRC_OUT_US</name>
	<description>SRC1_OUT UpSampling IIR filters setting
00: for sample rates up-to 48kHz
01: for sample rates of 96kHz
10: reserved
11: for sample rates of 192kHz</description>
	<access>read-write</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>SRC_OUT_CAL_BYPASS</name>
	<description>SRC1_OUT1 upsampiling filter bypass
0:Do not bypass
1:Bypass filter</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>SRC_OUT_AMODE</name>
	<description>SRC1_OUT1 Automatic Conversion mode
0:Manual mode
1:Automatic mode</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>SRC_PDM_OUT_INV</name>
	<description>Swap the left and the right output PDM channel</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>SRC_FIFO_DIRECTION</name>
	<description>0 = SRC fifo is used to store samples from memory to SRC
1 = SRC fifo is used to store sample from SRC to memory</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>SRC_FIFO_ENABLE</name>
	<description>0 = fifo disable. On each src request, one sample is serviced
1 = fifo enable. Fifo is used to store samples from / to src</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>SRC_OUT_DSD_MODE</name>
	<description>0 = SRC1 OUT PDM mode
1 = SRC1 OUT DSD mode</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>SRC_IN_DSD_MODE</name>
	<description>0: SRC1 IN PDM mode
1: SRC1 IN DSD mode </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>SRC_DITHER_DISABLE</name>
	<description>Dithering feature
0: Enable
1: Disable</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>SRC_IN_OK</name>
	<description>SRC1_IN status
0: Acquisition in progress
1: Acquisition ready</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>SRC_IN_DS</name>
	<description>SRC1_IN UpSampling IIR filters setting
00: for sample rates up-to 48kHz
01: for sample rates of 96kHz
10: reserved
11: for sample rates of 192kHz</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>SRC_PDM_IN_INV</name>
	<description>Swap the left and the right input PDM channel</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>SRC_IN_CAL_BYPASS</name>
	<description>SRC1_IN upsampeling filter bypass
0: Do not bypass
1: Bypass filter</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>SRC_IN_AMODE</name>
	<description>SRC1_IN Automatic conversion mode
0: Manual mode
1: Automatic mode</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SRC_EN</name>
	<description>SRC1_IN and SRC1_OUT enable
0: disabled
1: enabled</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
