irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>SRC1_IN1_REG</name>
	<description>SRC1 data in 1</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_IN</name>
	<description>SRC1_IN1 </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SRC1_IN2_REG</name>
	<description>SRC1 data in 2</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_IN</name>
	<description>SRC1_IN2 </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SRC1_IN_FS_REG</name>
	<description>SRC1 Sample input rate</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_IN_FS</name>
	<description>SRC_IN Sample rate
SRC_IN_FS = SRC_DIV*4096*Sample_rate/100
Sample_rate upper limit is 192kHz. For 96kHz and 192kHz SRC_CTRLx_REG[SRC_IN_DS] must be set as shown below:
(for SRC_DIV=1)
Sample_rate SRC_IN_FS SRC_IN_DS Audio bandwidth
8000 Hz 0x050000 0 4000 Hz
11025 Hz 0x06E400 0 5512 Hz
16000 Hz 0x0A0000 0 8000 Hz
22050 Hz 0x0DC800 0 11025 Hz
32000 Hz 0x140000 0 16000 Hz
44100 Hz 0x1B9000 0 22050 Hz
48000 Hz 0x1E0000 0 24000 Hz
96000 Hz 0x1E0000 1 24000 Hz
192000 Hz 0x1E0000 3 24000 Hz

In manual SRC mode, SRC_IN_FS can be set and adjusted to the desired sample rate at any time.
In automatic mode the SRC returns the final sample rate as soon as SRC_IN_OK. Note that SRC_DS is not calculated in automatic mode and must be set manually automatic mode with Sample_rate of 96 and 192kHz.</description>
	<access>read-write</access>
	<bitRange>[23:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SRC1_OUT1_REG</name>
	<description>SRC1 data out 1</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_OUT</name>
	<description>SRC1_OUT1 </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SRC1_OUT2_REG</name>
	<description>SRC1 data out 2</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_OUT</name>
	<description>SRC1_OUT2 </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SRC1_OUT_FS_REG</name>
	<description>SRC1 Sample output rate</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SRC_OUT_FS</name>
	<description>SRC_OUT Sample rate
SRC_OUT_FS = SRC_DIV*4096*Sample_rate/100
Sample_rate upper limit is 192kHz. For 96kHz and 192kHz SRC_CTRLx_REG[SRC_DS] must be set as shown below:
(for SRC_DIV=1)
Sample_rate SRC_OUT_FS  SRC_OUT_DS Audio bandwidth
8000 Hz     0x050000    0          4000 Hz
11025 Hz    0x06E400    0          5512 Hz
16000 Hz    0x0A0000    0          8000 Hz
22050 Hz    0x0DC800    0          11025 Hz
32000 Hz    0x140000    0          16000 Hz
44100 Hz    0x1B9000    0          22050 Hz
48000 Hz    0x1E0000    0          24000 Hz
96000 Hz    0x1E0000    1          24000 Hz
192000 Hz   0x1E0000    3          24000 Hz

In manual SRC mode, SRC_OUT_FS can be set and adjusted to the desired sample rate at any time.
In automatic mode the SRC returns the final sample rate as soon as SRC_OUT_OK. Note that SRC_DS is not calculated in automatic mode and must be set manually automatic mode with Sample_rate of 96 and 192kHz.</description>
	<access>read-write</access>
	<bitRange>[23:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CACHE</name>
	<version>1.0</version>
	<description>CACHE registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x100c0000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>108</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>CACHE_ASSOCCFG_REG</name>
	<description>Cache associativity configuration register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000002</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CACHE_ASSOC</name>
	<description>Cache associativity:
0: 1-way (direct mapped)
1: 2-way
2: 4-way
3: reserved.</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CACHE_CPU_M_HADDR_REG</name>
	<description>Cache CPU Master address (RO) register</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CACHE_CPU_M_HADDR</name>
	<description>Shows the CPU Master address (used in the Cache).
Note: Only used for debugging purposes..</description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CACHE_CTRL1_REG</name>
	<description>Cache control register 1</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CACHE_RES1</name>
	<description>Reserved. Always keep 0.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>CACHE_FLUSH</name>
	<description>Writing a '1' into this bit, flushes the contents of the tag memories which invalidates the content of the cache memory.
The read of this bit is always '0'.
Note: The flushing of the cache TAG memory takes 0x100 or 0x200 HCLK cycles for a Cache Data RAM size of 8 KB resp. 16 KB.</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
