irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>CACHE_CTRL2_REG</name>
	<description>Cache control register 2</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CACHE_CGEN</name>
	<description>0: Cache controller clock gating is not enabled.
1: Cache controller clock gating is enabled (enabling power saving).
Note: This bit must be set to '0' (default) when setting the CACHE_FLUSH bit while executing from other than QSPI FLASH cached, e.g. from Booter or SYSRAM.</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>CACHE_WEN</name>
	<description>0: Cache Data and TAG memory read only.
1: Cache Data and TAG memory read/write.
The TAG and Data memory are only updated by the cache controller.
There is no HW protection to prevent unauthorized access by the ARM.
Note: When accessing the memory mapped Cache Data and TAG memory (for debugging purposes) only 32 bits access is allowed to the Cache Data memory and only 16 bits access is allowed to the Cache TAG memory.</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>CACHE_LEN</name>
	<description>Length of QSPI FLASH cacheable memory.
N*64 KByte. N = 0 to 512 (max. of 32 Mbyte).
Setting CACHE_LEN=0 disables the cache.
Note 1: The max. relevant CACHE_LEN setting depends on the chosen Flash region (program) size.
Note 2: The first block (CACHE_LEN=1) includes the memory space specified by CACHE_FLASH_REG[FLASH_REGION_OFFSET].</description>
	<access>read-write</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CACHE_CTRL3_REG</name>
	<description>Cache control register 3 (for the Cache Controller configuration reset values)</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000022</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CACHE_CONTROLLER_RESET</name>
	<description>0: De-activate the Reset of the Cache Controller.
1: Reset the Cache Controller and take the new configuration reset values (when the reset is released again by changing this bit from '1' to '0').
Note: All CACHE_MRM_* registers are also reset.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>CACHE_RAM_SIZE_RESET_VALUE</name>
	<description>Cache DATA RAM size reset value:
0: reserved,
1: 8 KB,
2: 16 KB,
3-7: reserved.</description>
	<access>read-write</access>
	<bitRange>[6:4]</bitRange>
	
</field><field>
	<name>CACHE_LINE_SIZE_RESET_VALUE</name>
	<description>Cache line size reset value:
0: 8 bytes,
1: 16 bytes,
2: 32 bytes,
3: reserved.</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>CACHE_ASSOCIATIVITY_RESET_VALUE</name>
	<description>Cache associativity reset value:
0: 1-way (direct mapped)
1: 2-way
2: 4-way
3: reserved.</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CACHE_CTRLR_M_HADDR_REG</name>
	<description>Cache CTRLR Master address (RO) register</description>
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CACHE_CTRLR_M_HADDR</name>
	<description>Shows the Cache Controller Master (physical) QSPI Flash address (used in the Cache) corresponding with the last cache miss.
Note: Only used for debugging purposes.</description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CACHE_FLASH_REG</name>
	<description>Cache Flash program size and base address register</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x16000006</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>FLASH_REGION_BASE</name>
	<description>These bits corresponds with the Flash region base address bits [31:16].
Default value is '0x1600'.
The Flash region base address bits [31:25] are fixed to '0x16' and bits [17:16] are fixed to '0x0'.
These register bits are retained.
Note 1: The updated value takes effect only after a software reset.
Note 2 The Flash region base address setting depends on the chosen Flash region size.</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>FLASH_REGION_OFFSET</name>
	<description>Flash region offset address (in words).
This value is added to the Flash (CPU) address bits [13:2].
These register bits are retained.
Note 1: The updated value takes effect only after a software reset.</description>
	<access>read-write</access>
	<bitRange>[15:4]</bitRange>
	
</field><field>
	<name>FLASH_REGION_SIZE</name>
	<description>Flash region size.
Default value is '6' (0.5 MBytes).
0 = 32 MBytes,
1 = 16 MBytes,
2 = 8 MBytes,
3 = 4 MBytes,
4 = 2 MBytes,
5 = 1 MBytes,
6 = 0.5 MBytes,
7 = 0.25 MBytes.
These register bits are retained.
Note 1: The updated value takes effect only after a software reset.
Note 2: See for the max. region (program) size the memory map.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CACHE_LNSIZECFG_REG</name>
	<description>Cache line size configuration register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CACHE_LINE</name>
	<description>Cache line size:
0: 8 bytes,
1: 16 bytes,
2: 32 bytes,
3: reserved.
Note: Flush the cache just after the dynamic (run-time) reconfiguration of the cache with an 8 bytes cache line size: write the value "01" into the cache control register CACHE_CTRL1_REG just after the write of the value "00" into the cache line size configuration register CACHE_LNSIZECFG_REG.</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
