irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>CHARGER_CURRENT_PARAM_REG</name>
	<description>Charger current settings register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000020c6</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>I_EOC_DOUBLE_RANGE</name>
	<description>When set, the specific bit-field enables the doubling of the (%) range of End-of-Charge current setting. Consequently, the default lower and upper limits of 6% of I_CHARGE (value 0x0 of I_END_OF_CHARGE bit-field) and 20% (value 0x7 of the same bit-field) are increased to 12% and 40% respectively, as soon as the I_EOC_DOUBLE_RANGE field is set.</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>I_END_OF_CHARGE</name>
	<description>End-of-Charge current setting, ranging from 6%("000") to 20% ("111") of the charge current set, with a step size of 2%, as follows:
000 : 6%
001 : 8%
010 : 10%
011 : 12%
100 : 14%
101 : 16%
110 : 18%
111 : 20%
Note: The aforementioned range of 6%-20% and the respective values of this bit-field are valid if the I_EOC_DOUBLE_RANGE field of this register is not set. Otherwise, the (%) range of Charge current determining the End-of-Charge current is doubled to 12%-40%, and consequently each of the values (0x0-0x7) listed above represents a doubled (%) percentage.</description>
	<access>read-write</access>
	<bitRange>[14:12]</bitRange>
	
</field><field>
	<name>I_PRECHARGE</name>
	<description>This bit-field determines the Pre-Charge current, in mA, ranging from 0.5 to 56mA, according to the following encoding:
0   :  0.5 mA
1   :  1  mA
2   :  1.5mA
3   :  2 mA
4   :  2.5mA
5   :  3  mA
6   :  3.5mA
7   :  4  mA
8   :  4.5mA
9   :  5  mA
10 :  5.5mA
11 :  6  mA
12 :  6.5mA
13 :  7  mA
14 :  7.5mA
15 :  8  mA
16 :  9  mA
17 : 10 mA
18 : 11 mA
19 : 12 mA
20 : 13 mA
21 : 14 mA
22 : 15 mA
23 : 16 mA
24 : 17 mA
25 : 18 mA
26 : 19 mA
27 : 20 mA
28 : 21 mA
29 : 22 mA
30 : 23 mA
31 : 24 mA
32 : 26 mA
33 : 28 mA
34 : 30 mA
35 : 32 mA
36 : 34 mA
37 : 36 mA
38 : 38 mA
39 : 40 mA
40 : 42 mA
41 : 44 mA
42 : 46 mA
43 : 48 mA
44 : 50 mA
45 : 52 mA
46 : 54 mA
47 : 56 mA
48 : 56 mA
49 : 56 mA
50 : 56 mA
51 : 56 mA
52 : 56 mA
53 : 56 mA
54 : 56 mA
55 : 56 mA
56 : 56 mA
57 : 56 mA
58 : 56 mA
59 : 56 mA
60 : 56 mA
61 : 56 mA
62 : 56 mA
63 : 56 mA</description>
	<access>read-write</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>I_CHARGE</name>
	<description>This bit-field determines the charge current range, in mA. The range is from 5mA to 560mA, according to the following encoding:
0   :   5 mA
1   :  10 mA
2   :  15 mA
3   :  20 mA
4   :  25 mA
5   :  30 mA
6   :  35 mA
7   :  40 mA
8   :  45 mA
9   :  50 mA
10 :  55 mA
11 :  60 mA
12 :  65 mA
13 :  70 mA
14 :  75 mA
15 :  80 mA
16 :  90 mA
17 : 100 mA
18 : 110 mA
19 : 120 mA
20 : 130 mA
21 : 140 mA
22 : 150 mA
23 : 160 mA
24 : 170 mA
25 : 180 mA
26 : 190 mA
27 : 200 mA
28 : 210 mA
29 : 220 mA
30 : 230 mA
31 : 240 mA
32 : 260 mA
33 : 280 mA
34 : 300 mA
35 : 320 mA
36 : 340 mA
37 : 360 mA
38 : 380 mA
39 : 400 mA
40 : 420 mA
41 : 440 mA
42 : 460 mA
43 : 480 mA
44 : 500 mA
45 : 520 mA
46 : 540 mA
47 : 560 mA
48 : 560 mA
49 : 560 mA
50 : 560 mA
51 : 560 mA
52 : 560 mA
53 : 560 mA
54 : 560 mA
55 : 560 mA
56 : 560 mA
57 : 560 mA
58 : 560 mA
59 : 560 mA
60 : 560 mA
61 : 560 mA
62 : 560 mA
63 : 560 mA
Note: It has to be noted that the specific values correspond to the normal battery temperature zone. However, the specific register field may be updated by the JEITA FSM (which checks the battery temperature either once or periodically), in order to adapt the Charge current to the new battery temperature zone (see also CHARGER_CTRL_REG.TBAT_MONITOR_MODE field as well). This is valid also for the Pre-Charge current field of this register and provided that JEITA support is enabled in CHARGER_CTRL_REG.
Consequently, in that case the register return the Charge current settings that abide to the JEITA requirements for the battery (either COOL, WARM or NORMAL).</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_CV_CHARGE_TIMER_REG</name>
	<description>Maximum CV-charge time limit register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00001c20</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CV_CHARGE_TIMER</name>
	<description>Returns the current value of the CV-Charge timeout counter, running at a 1Hz clock. The range of the specific timer is identical to the one of the Pre-Charge and the CC-Charge timers, so it may count up to 6 hours, ranging from 0 to MAX_CV_CHARGE_TIME. It is reset to 0 when the Charger's FSM is either in DISABLED or in END_OF_CHARGE state.</description>
	<access>read-only</access>
	<bitRange>[30:16]</bitRange>
	
</field><field>
	<name>MAX_CV_CHARGE_TIME</name>
	<description>This bit-field determines the maximum time (measured in ticks of the Charger's 1Hz clock) allowed for the CV (Constant Voltage) charging stage. If this is exceeded, a CV charge time-out error will be captured by the Charger's control unit and its FSM will move to the ERROR state. In order to exit this state and re-start charging, the CHARGER_RESUME bit-field of CHARGER_CTRL_REG must be set.
Note: The specific bit-field should be always set to a non-zero value.</description>
	<access>read-write</access>
	<bitRange>[14:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_ERROR_IRQ_CLR_REG</name>
	<description>Interrupt clear register of Charger Error IRQs</description>
	<addressOffset>0x0000006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>TBAT_ERROR_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's Error IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>TDIE_ERROR_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's Error IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>VBAT_OVP_ERROR_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's Error IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>TOTAL_CHARGE_TIMEOUT_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's Error IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>CV_CHARGE_TIMEOUT_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's Error IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>CC_CHARGE_TIMEOUT_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's Error IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>PRECHARGE_TIMEOUT_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's Error IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
