irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>CHARGER_JEITA_CURRENT_REG</name>
	<description>JEITA-compliant current settings register</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00042105</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields>
	<field>
	<name>I_PRECHARGE_TWARM</name>
	<description>Pre-Charge current setting for the Warm battery temperature zone. Regarding the range of values of this bit-field, see also the description of I_PRECHARGE field of CHARGER_CURRENT_PARAM_REG register.</description>
	<access>read-write</access>
	<bitRange>[23:18]</bitRange>
	
</field><field>
	<name>I_PRECHARGE_TCOOL</name>
	<description>Pre-Charge current setting for the Cool battery temperature zone. Regarding the range of values of this bit-field, see also the description of I_PRECHARGE field of CHARGER_CURRENT_PARAM_REG register.</description>
	<access>read-write</access>
	<bitRange>[17:12]</bitRange>
	
</field><field>
	<name>I_CHARGE_TWARM</name>
	<description>Charge current setting for the Warm battery temperature pack zone. Regarding the range of values of this bit-field, see also the description of I_CHARGE field of CHARGER_CURRENT_PARAM_REG register.</description>
	<access>read-write</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>I_CHARGE_TCOOL</name>
	<description>Charge current setting for the "COOL" battery temperature level. Regarding the range of values of this bit-field, see also the description of I_CHARGE field of CHARGER_CURRENT_PARAM_REG register.</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_JEITA_V_CHARGE_REG</name>
	<description>JEITA-compliant Charge voltage settings register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000a68</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>V_CHARGE_TWARM</name>
	<description>Charge voltage setting for the Warm battery temperature zone. Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG register.</description>
	<access>read-write</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>V_CHARGE_TCOOL</name>
	<description>Charge voltage setting for the Cool battery temperature zone. Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG register.</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_JEITA_V_OVP_REG</name>
	<description>JEITA-compliant OVP settings register</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000d76</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>V_OVP_TWARM</name>
	<description>VBAT Over-voltage Protection (OVP) setting for the Warm battery temperature zone.Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG.</description>
	<access>read-write</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>V_OVP_TCOOL</name>
	<description>VBAT Over-voltage Protection (OVP) setting for the Cool battery temperature zone.Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG.</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_JEITA_V_PRECHARGE_REG</name>
	<description>JEITA-compliant Pre-Charge voltage settings register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000187</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>V_PRECHARGE_TWARM</name>
	<description>Pre-Charge voltage setting for the Warm battery temperature zone. Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG register.</description>
	<access>read-write</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>V_PRECHARGE_TCOOL</name>
	<description>Pre-Charge current setting for the Cool battery temperature zone. Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG register.</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_JEITA_V_REPLENISH_REG</name>
	<description>JEITA-compliant Replenish settings register</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000079f</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>V_REPLENISH_TWARM</name>
	<description>Replenish voltage setting for the Warm battery temperature zone. Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG.</description>
	<access>read-write</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>V_REPLENISH_TCOOL</name>
	<description>Replenish voltage setting for the Cool battery temperature zone. Regarding the range of values of this bit-field, see also the description of V_CHARGE field of CHARGER_VOLTAGE_PARAM_REG.</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_PRE_CHARGE_TIMER_REG</name>
	<description>Maximum pre-charge time limit register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000708</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PRE_CHARGE_TIMER</name>
	<description>Returns the current value of the Pre-Charge timeout counter, running at a 1Hz clock. The range of the specific timer is identical to the one of the CC-Charge and the CV-Charge timers, so it may count up to 6 hours, ranging from 0 to MAX_PRE_CHARGE_TIME. It is reset to 0 when the Charger's FSM is either in DISABLED or in END_OF_CHARGE state.</description>
	<access>read-only</access>
	<bitRange>[30:16]</bitRange>
	
</field><field>
	<name>MAX_PRE_CHARGE_TIME</name>
	<description>This bit-field determines the maximum time (measured in ticks of the Charger's 1Hz clock) allowed for the Pre-Charge stage. If this is exceeded, a Pre-Charge time-out error will be captured by the Charger's control unit and its FSM will move to the respective state (ERROR). In order to exit this state and re-start charging, the CHARGER_RESUME bit-field of CHARGER_CTRL_REG must be set.
Note: The specific bit-field should be always set to a non-zero value.</description>
	<access>read-write</access>
	<bitRange>[14:0]</bitRange>
	
