irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>CHARGER_PWR_UP_TIMER_REG</name>
	<description>Charger power-up (settling) timer</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields>
	<field>
	<name>CHARGER_PWR_UP_TIMER</name>
	<description>Returns the current value of the charger's power-up timer, running with the 1 Khz clock.</description>
	<access>read-only</access>
	<bitRange>[25:16]</bitRange>
	
</field><field>
	<name>CHARGER_PWR_UP_SETTLING</name>
	<description>This bit-field determines the charger's power-up (settling) time, required for the analogue circuitry of the charger. As soon as the charger is powered-on by setting the CHARGER_ENABLE bit-field of CHARGER_CTRL_REG, the charger's FSM loads a dedicated timer with this value and waits for this timer to expire, before proceeding to the next states.
Note: The specific bit-field should be always set to a non-zero value.</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_STATE_IRQ_CLR_REG</name>
	<description>Interrupt clear register of Charger FSM IRQs</description>
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>CV_TO_PRECHARGE_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>CC_TO_PRECHARGE_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>CV_TO_CC_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>TBAT_STATUS_UPDATE_IRQ_CLR</name>
	<description>Writing a 1 will reset the Battery temperature status update IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>TBAT_PROT_TO_PRECHARGE_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>TDIE_PROT_TO_PRECHARGE_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>EOC_TO_PRECHARGE_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>CV_TO_EOC_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>CC_TO_EOC_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>CC_TO_CV_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>PRECHARGE_TO_CC_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DISABLED_TO_PRECHARGE_IRQ_CLR</name>
	<description>Writing a 1 will reset the respective Charger's State IRQ ; writing a 0 will have no effect</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_STATE_IRQ_MASK_REG</name>
	<description>Mask register of Charger FSM IRQs</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>CV_TO_PRECHARGE_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from CV_CHARGE to PRE_CHARGE state.</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>CC_TO_PRECHARGE_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from CC_CHARGE to PRE_CHARGE state.</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>CV_TO_CC_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from CV_CHARGE to CC_CHARGE state.</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>TBAT_STATUS_UPDATE_IRQ_EN</name>
	<description>When set, this bit-field enables the generation of the Charger's state IRQ as soon as the battery temperature status is refreched by the Charger's Battery temperature monitor (JEITA) FSM. As soon as the specific FSM checks the current battery temperature level, it notifies the main Charger FSM that it has run and that the Battery temperature pack state is checked (and potentially refreshed with a new status).</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>TBAT_PROT_TO_PRECHARGE_IRQ_EN</name>
	<description>When set, this bit-field enables the Charger's state IRQ generation as soon as the Charger's FSM switches from the Battery temperature protection state (TBAT_PROT) to PRE_CHARGE, resuming charging.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>TDIE_PROT_TO_PRECHARGE_IRQ_EN</name>
	<description>When set, this bit-field enables the Charger's state IRQ generation as soon as the Charger's FSM switches from the Die temperature protection state (TDIE_PROT) to PRE_CHARGE, resuming charging.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>EOC_TO_PRECHARGE_IRQ_EN</name>
	<description>When set, this bit-field enables the Charger's State IRQ generation as soon as the Charger's FSM switches from END_OF_CHARGE again to PRE_CHARGE state. This happens when the Vbat voltage level is detected to be below the Replenish level set.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>CV_TO_EOC_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from CV_CHARGE to END_OF_CHARGE state.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>CC_TO_EOC_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from CC_CHARGE to END_OF_CHARGE state.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>CC_TO_CV_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from CC_CHARGE to CV_CHARGE state.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>PRECHARGE_TO_CC_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from PRE_CHARGE to CC_CHARGE state..</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DISABLED_TO_PRECHARGE_IRQ_EN</name>
	<description>When set, this bit-field enables the IRQ generation as soon as the Charger's FSM switches from DISABLED to PRE_CHARGE state.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
