irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>CHARGER_TBAT_COMP_TIMER_REG</name>
	<description>Battery temperature (main) comparator timer</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields>
	<field>
	<name>TBAT_COMP_TIMER</name>
	<description>Returns the main battery temperature comparator's timer, used for the latching of the comparator's output. The output of the comparator is used by the JEITA FSM, to determine the current battery temperature pack's status.</description>
	<access>read-only</access>
	<bitRange>[25:16]</bitRange>
	
</field><field>
	<name>TBAT_COMP_SETTLING</name>
	<description>Settling time (specified in us) for the main battery temperature comparator, checking for the "COOL", "COLD" and "WARM" levels. The charger's digital block uses a dedicated timer to sample the specific comparator's output. The comparator's output is latched as soon as the timer expires, reaching 0. Then, the timer is reloaded with the settling time value and starts-over, down-counting to 0.
Note: The specific bit-field should be always set to a non-zero value.</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_TBAT_MON_TIMER_REG</name>
	<description>Battery temperature monitor interval timer</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields>
	<field>
	<name>TBAT_MON_TIMER</name>
	<description>This is the battery temperature monitoring timer, counting with the Charger's 1KHz clock. If the battery monitor mode is accordingly set in the TBAT_MONITOR_MODE bit-field of CHARGER_CTRL_REG (so either to 0x1 or 0x2), this timer is initially loaded with the value set in TBAT_MON_INTERVAL bit-field in the subsequent 1khz cycles starts down-counting to 0. As soon as the specific timer expires,the JEITA FSM starts-over again, to refresh the battery temperature status.</description>
	<access>read-only</access>
	<bitRange>[25:16]</bitRange>
	
</field><field>
	<name>TBAT_MON_INTERVAL</name>
	<description>Timing interval (in ms) for the Battery temperature monitoring. This interval determines how often the JEITA FSM will be checking and potentially refreshing the Battery temperature status, by selecting accordingly the proper level (Hot, Cold, Warm, Cool or Normal), based on the feedback of the two battery temperature comparators being present in the Charger's analogue circuitry (one for the Hot level and one for Cold, Cool and Warm, to support JEITA).
Note: The specific bit-field should be always set to a non-zero value.</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_TDIE_COMP_TIMER_REG</name>
	<description>Die temperature comparator timer register</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields>
	<field>
	<name>TDIE_COMP_TIMER</name>
	<description>Returns the current value of the timer used to determine when the Die temperature comparator's output must be sampled by the digital. As soon as the timer expires (down-counting to 0, starting from TDIE_COMP_SETTLING) the comparator's output is latched by the Charger's digital block and used by the main FSM. After expiring, the timer starts-over again, down-counting, to enable the continuous monitoring of Die temperature by the digital.
Note: When the Charger's FSM is in BYPASSED state, this timer is kept to zero and the SW takes over, sampling the status of the TDIE_PROT_COMP_OUT bit-field of CHARGER_STATUS_REG to determine if the Die temperature limit has been exceeded.</description>
	<access>read-only</access>
	<bitRange>[25:16]</bitRange>
	
</field><field>
	<name>TDIE_COMP_SETTLING</name>
	<description>Settling time threshold (in us) for the Die temperature comparator. </description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_TEMPSET_PARAM_REG</name>
	<description>Charger battery temperature settings register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x03ded50a</resetValue>
	<resetMask>0x07ffffff</resetMask>
	<fields>
	<field>
	<name>TDIE_MAX</name>
	<description>This bit-field determines the maximum Die temperature level limit, ranging from 0C to 130C, according to the following encoding:
000: 0 C (mainly for test purposes)
001: 50 C
010: 80 C
011: 90 C
100: 100 C
101: 110 C
110: 120 C
111: 130 C</description>
	<access>read-write</access>
	<bitRange>[26:24]</bitRange>
	
</field><field>
	<name>TBAT_HOT</name>
	<description>This bit-field determines the battery temperature above which the charge current is zero, defining the "Hot" battery temperature zone. It ranges from minus 10C to 53C. The range is the same with the one defined in detail in TBAT_COLD bit-field.</description>
	<access>read-write</access>
	<bitRange>[23:18]</bitRange>
	
</field><field>
	<name>TBAT_WARM</name>
	<description>This bit-field determines the battery temperature above which the charge current is reduced, defining the "Warm" temperature zone. It ranges from minus 10C to 53C. The range is the same with the one defined in detail in TBAT_COLD bit-field.</description>
	<access>read-write</access>
	<bitRange>[17:12]</bitRange>
	
</field><field>
	<name>TBAT_COOL</name>
	<description>This bit-field determines the battery temperature below which the charge current is reduced, defining the "Cool" temperature zone. It ranges from minus 10C to 53C and the range is the same with the one defined in TBAT_COLD bit-field.</description>
	<access>read-write</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>TBAT_COLD</name>
	<description>This bit-field determines the battery temperature below which the charge current is zero, defining the "Cold" temperature zone. It ranges from minus 10C to 53C, according to the following encoding:
0   :  -10 C
1   :   -9 C
2   :   -8 C
3   :   -7 C
4   :   -6 C
5   :   -5 C
6   :   -4 C
7   :   -3 C
8   :   -2 C
9   :   -1 C
10 :    0 C
11 :    1 C
12 :    2 C
13 :    3 C
14 :    4 C
15 :    5 C
16 :    6 C
17 :    7 C
18 :    8 C
19 :    9 C
20 :   10 C
21 :   11 C
22 :   12 C
23 :   13 C
24 :   14 C
25 :   15 C
26 :   16 C
27 :   17 C
28 :   18 C
29 :   19 C
30 :   20 C
31 :   21 C
32 :   22 C
33 :   23 C
34 :   24 C
35 :   25 C
36 :   26 C
37 :   27 C
38 :   28 C
39 :   29 C
40 :   30 C
41 :   31 C
42 :   32 C
43 :   33 C
44 :   34 C
45 :   35 C
46 :   36 C
47 :   37 C
48 :   38 C
49 :   39 C
50 :   40 C
51 :   41 C
52 :   42 C
53 :   43 C
54 :   44 C
55 :   45 C
56 :   46 C
57 :   47 C
58 :   48 C
59 :   49 C
60 :   50 C
61 :   51 C
62 :   52 C
63 :   53 C</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
