irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>CHARGER_TEST_CTRL_REG</name>
	<description>Charger test control register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00001e88</resetValue>
	<resetMask>0x0001ffff</resetMask>
	<fields>
	<field>
	<name>CHARGER_TEST</name>
	<description>The following analogue signals may be mapped onto P1_07 pin, according to the following encoding:
000: Normal mode (no test mode selected)
001: Vptat (temperature sensor output) [1.4V max]
010: Vbat_sense after divider [1.2V]
011: Current loop output [0 to v30]
100: Voltage loop output [0 to v30]
101: Iref for the CC loop
110: Icharge reduced by 20
111: Imeas from output device
Note : To enable this mapping, TEST_CTRL2_REG.ANA_TESTMUX_CTRL should be set to either 4,6 or 8 and TEST_CTRL5_REG[0] should be set to '0'. Both these two registers reside in the GPIO module. It is also noted that the specific pin (P1_07) should be configured as analogue pin, by setting P1_07_MODE_REG[PID] = FUNC_ADC (see also the description of P0_00_MODE_REG in the GPIO block, again).</description>
	<access>read-write</access>
	<bitRange>[16:14]</bitRange>
	
</field><field>
	<name>CHARGER_IOTRIM</name>
	<description>do not change, for test purposes only</description>
	<access>read-write</access>
	<bitRange>[13:9]</bitRange>
	
</field><field>
	<name>I_CHARGE_TRIM</name>
	<description>do not change, for test purposes only</description>
	<access>read-write</access>
	<bitRange>[8:4]</bitRange>
	
</field><field>
	<name>V_CHARGE_TRIM</name>
	<description>do not change, for test purposes only</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_THOT_COMP_TIMER_REG</name>
	<description>Battery temperature comparator timer for "Hot" zone</description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields>
	<field>
	<name>THOT_COMP_TIMER</name>
	<description>Returns the battery temperature comparator's timer dedicated for the "Hot" level.</description>
	<access>read-only</access>
	<bitRange>[25:16]</bitRange>
	
</field><field>
	<name>THOT_COMP_SETTLING</name>
	<description>Charger's battery temperature comparator settling time (specified in us), specifically for the Hot temperature zone. The charger's digital block uses a dedicated timer to sample the specific comparator's output. The comparator's output is latched as soon as the timer expires, reaching 0. Then, the timer is reloaded with the settling time value and starts-over again
Note: The specific bit-field should be always set to a non-zero value.</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_TOTAL_CHARGE_TIMER_REG</name>
	<description>Maximum total charge time limit register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00003f48</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TOTAL_CHARGE_TIMER</name>
	<description>Returns the current value of the overall charge timeout counter, running at a 1Hz clock. This timer has been set to 16 bits, so that it can count up to 10.5 hours, and ranges from 0 to MAX_TOTAL_CHARGE_TIME. It is reset to 0 when the Charger's FSM is either in DISABLED or in END_OF_CHARGE state.</description>
	<access>read-only</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>MAX_TOTAL_CHARGE_TIME</name>
	<description>This bit-field determines the maximum overall charging time allowed (measured in ticks of the 1Hz clock). If this is exceeded, a total charge time-out error will be captured by the Charger's controller and its FSM will move to the ERROR state. An IRQ will be also generated if the respective IRQ mask bit of CHARGER_ERROR_IRQ_MASK_REG is already set. In order to to exit this state, the "CHARGER_RESUME" bit-field of CHARGER_CTRL_REG must be set, to enable the Charger's FSM switch from ERROR to DISABLED state and start-over.
Note: The specific bit-field should be always set to a non-zero value.</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_VBAT_COMP_TIMER_REG</name>
	<description>Main Vbat comparator timer register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields>
	<field>
	<name>VBAT_COMP_TIMER</name>
	<description>Returns the current value of the timer used to determine when the output of the Vbat comparator (checking Vbat vs Pre_Charge and Replenish levels) must be sampled by the digital. As soon as the timer expires (down-counting to 0, starting from the value set in VBAT_COMP_SETTLING), the comparator's output is latched by the Charger's digital block and used by the FSM.
Note: When the Charger's FSM is in BYPASSED state, this timer is kept to zero and the SW takes over. In this mode, the specific comparator checks the level of Vbat against the Pre-Charge level. Hence, SW can periodically sample the status of this comparator by reading the MAIN_VBAT_COMP_OUT bit-field of CHARGER_STATUS_REG, to determine if Vbat has exceeded the Pre-Charge level or not.</description>
	<access>read-only</access>
	<bitRange>[25:16]</bitRange>
	
</field><field>
	<name>VBAT_COMP_SETTLING</name>
	<description>Settling time threshold (in us) for the Vbat comparator checking Vbat vs the programmed Pre-Charge and Replenish levels. The settings (voltage levels) of the comparator are controlled by the digital block of the Charger and they are driven based on the state of the main FSM (PRE_CHARGE, END_OF_CHARGE).</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHARGER_VOLTAGE_PARAM_REG</name>
	<description>Charger voltage settings register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00ca122b</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields>
	<field>
	<name>V_OVP</name>
	<description>This bit-field determines the VBAT Over-voltage protection limit. This Over-voltage protection level is used by the Charger's analogue circuitry and specifically by a dedicated comparator, the output of which is sampled by the digital block of the Charger. As soon as VBAT is detected to have reached or exceeded this level, the Charger's FSM moves to ERROR state, interrupting charging. If the respective Error IRQ mask bit is set, an Error IRQ pulse will be also generated.
Regarding the actual range of supported values for this bit-field, see the the description of V_CHARGE bit-field of this register.</description>
	<access>read-write</access>
	<bitRange>[23:18]</bitRange>
	
</field><field>
	<name>V_REPLENISH</name>
	<description>This bit-field determines the absolute value (in V) of the Replenish voltage threshold. As soon as charging has been completed and the Charger's FSM has reached the END_OF_CHARGE state, the respective analogue comparator of the Charger compares VBAT with the Replenish level. If VBAT is found to have dropped below this level, charging should start-over again and in that case, the FSM moves again to the PRE_CHARGE state.
Regarding the supported Replenish voltage levels, see the description of V_CHARGE bit-field.</description>
	<access>read-write</access>
	<bitRange>[17:12]</bitRange>
	
</field><field>
	<name>V_PRECHARGE</name>
	<description>This bit-field determines the voltage level at which the battery is considered as Pre-charged and therefore the Charger's FSM should move to the CC_CHARGE state, entering the Constant Current charging phase.
Regarding the supported Pre-Charge voltage levels, see also the description of V_CHARGE bit-field of this register.</description>
	<access>read-write</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>V_CHARGE</name>
	<description>This bit-field determines the charge voltage levels supported. The supported levels are determined according to the following encoding:
0   : 2.80V
1   : 2.85V
2   : 2.90V
3   : 2.95V
4   : 3.00V
5   : 3.05V
6   : 3.10V
7   : 3.15V
8   : 3.20V
9   : 3.25V
10 : 3.30V
11 : 3.35V
12 : 3.40V
13 : 3.45V
14 : 3.50V
15 : 3.55V
16 : 3.60V
17 : 3.65V
18 : 3.70V
19 : 3.75V
20 : 3.80V
21 : 3.82V
22 : 3.84V
23 : 3.86V
24 : 3.88V
25 : 3.90V
26 : 3.92V
27 : 3.94V
28 : 3.96V
29 : 3.98V
30 : 4.00V
31 : 4.02V
32 : 4.04V
33 : 4.06V
34 : 4.08V
35 : 4.10V
36 : 4.12V
37 : 4.14V
38 : 4.16V
39 : 4.18V
40 : 4.20V
41 : 4.22V
42 : 4.24V
43 : 4.26V
44 : 4.28V
45 : 4.30V
46 : 4.32V
47 : 4.34V
48 : 4.36V
49 : 4.38V
50 : 4.40V
51 : 4.42V
52 : 4.44V
53 : 4.46V
54 : 4.48V
55 : 4.50V
56 : 4.52V
57 : 4.54V
58 : 4.56V
59 : 4.58V
60 : 4.60V
61 : 4.70V
62 : 4.80V
63 : 4.90V*
It has to be noted that the specific values correspond to the normal battery temperature zone. However, the specific register field may be updated by the JEITA FSM (which checks the battery temperature either once or periodically), in order to adapt the charge voltage to the battery temperature zone (see also CHARGER_CTRL_REG.TBAT_MONITOR_MODE field as well). This is valid also for the other three fields of the current register. Consequently, in that case the register returns the Charge voltage settings that abide to the JEITA requirements for the battery (either COOL, WARM or NORMAL).
Note: Option "63" (4.90V) is not supported for V_CHARGE, V_PRECHARGE and V_REPLENISH bit-fields (and respective levels). It should be used only in the V_OVP bit-field, as the (maximum) Over-voltage protection level.</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
