irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>CHARGER_VOVP_COMP_TIMER_REG</name>
	<description>Vbat OVP comparator timer register</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000fc63</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OVP_INTERVAL_CHECK_TIMER</name>
	<description>The specific bit-field determines the current state of the timer used to periodically check the output of the Over-Voltage Protection comparator's output signal, as soon as the Charger's FSM reaches any of the charging states (PRE/CC/CV_CHARGE).
When this happens, the timer starts ticking with the 1Mhz clock, ranging from 0 up to the programmed interval threshold (see also OVP_INTERVAL_CHECK_THRES field). As soon as this timer reaches the programmed threshold value, the Vbat OVP comparator's output is evaluated, increasing or not the counter keeping the consecutive OVP events. It is noted that out of the charging states, the specific timer is kept frozen to zero, not counting.
Note : See also the OVP_OCCURRENCES_CNT bit-field of CHARGER_STATUS_REG for the consecutive OVP events counter.</description>
	<access>read-only</access>
	<bitRange>[31:26]</bitRange>
	
</field><field>
	<name>VBAT_OVP_COMP_TIMER</name>
	<description>Returns the current value of the timer used to determine when the Vbat Over-Voltage protection (OVP) comparator's output must be sampled by the digital. As soon as the timer expires (down-counting to 0, starting from VBAT_OVP_COMP_SETTLING), the comparator's output is latched by the Charger's digital block and used by the main FSM.
Note: When the Charger's FSM is in BYPASSED state, this timer is kept to zero and the SW takes over, sampling the status of the VBAT_OVP_COMP_OUT bit-field of CHARGER_STATUS_REG to determine if the Vbat has exceeded the OVP limit.</description>
	<access>read-only</access>
	<bitRange>[25:16]</bitRange>
	
</field><field>
	<name>OVP_INTERVAL_CHECK_THRES</name>
	<description>This bit-field determines the periodic interval of checking the dedicated Vbat OVP comparator's output, when the Charger's FSM is in any of the charging states (PRE/CC/CV_CHARGE). The implementation is based on a dedicated timer, counting from zero up to the value programmed into this bit-field (see also OVP_INTERVAL_CHECK_TIMER field's description) and only when the FSM is in any of the three charging states. Out of these states, the timer is kept frozen to zero.
As soon as this timer reaches the programmed threshold, the Vbat OVP comparator's output is sampled and depending on its level, (high or low), another counter, keeping the number of consecutive OVP events, is increased or not. The programmed threshold value should always be non-zero.
Note: See also the OVP_DEBOUNCE_CNT bit-field of CHARGER_STATUS_REG, for the consecutive OVP events counter.</description>
	<access>read-write</access>
	<bitRange>[15:10]</bitRange>
	
</field><field>
	<name>VBAT_OVP_COMP_SETTLING</name>
	<description>Settling time threshold (in us) for the Vbat comparator checking Vbat vs the programmed Over-Voltage level.</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CHIP_VERSION</name>
	<version>1.0</version>
	<description>CHIP_VERSION registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50040200</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>256</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>CHIP_ID1_REG</name>
	<description>Chip identification register 1.</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000032</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CHIP_ID1</name>
	<description>First character of device type "2522" in ASCII. </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHIP_ID2_REG</name>
	<description>Chip identification register 2.</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000035</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CHIP_ID2</name>
	<description>Second character of device type "2522" in ASCII. </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHIP_ID3_REG</name>
	<description>Chip identification register 3.</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000032</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CHIP_ID3</name>
	<description>Third character of device type "2522" in ASCII. </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHIP_ID4_REG</name>
	<description>Chip identification register 4.</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000032</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CHIP_ID4</name>
	<description>Fourth character of device type "2522" in ASCII.</description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHIP_REVISION_REG</name>
	<description>Chip revision register.</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000041</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CHIP_REVISION</name>
	<description>Chip version, corresponds with type number in ASCII.
0x41 = 'A', 0x42 = 'B' </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHIP_SWC_REG</name>
	<description>Software compatibility register.</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CHIP_SWC</name>
	<description>SoftWare Compatibility code.
Integer (default = 0) which is incremented if a silicon change has impact on the CPU Firmware.
Can be used by software developers to write silicon revision dependent code. </description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
