irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>CHIP_TEST1_REG</name>
	<description>Chip test register 1.</description>
	<addressOffset>0x000000f8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000041</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CHIP_LAYOUT_REVISION</name>
	<description>Chip layout revision, corresponds with type number in ASCII.
0x41 = 'A', 0x42 = 'B' </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CHIP_TEST2_REG</name>
	<description>Chip test register 2.</description>
	<addressOffset>0x000000fc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CHIP_METAL_OPTION</name>
	<description>Chip metal option value.</description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CMAC</name>
	<version>1.0</version>
	<description>CMAC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x40000000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>8464</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>CM_CTRL_SYS_REG</name>
	<description>CMAC and System Control Register</description>
	<addressOffset>0x00002000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CMAC_CONST_1</name>
	<description>Always read as "1".
Note: Creating an always non-zero register value, making easier a visual check of register when power domain is off.</description>
	<access>read-only</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>CMAC_LOCKUP_STATE</name>
	
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>CMAC_WDOG_EXPIRE_STATE</name>
	
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>CMAC_SYSMEMCTRL_ERROR_STATE</name>
	
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>CMAC_CPU_ERROR_STATE</name>
	
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>CMAC_BS_ERROR_STATE</name>
	
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>CMAC_FW_ERROR_STATE</name>
	
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>MCPU_SLEEPING_STATE</name>
	
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>CMAC_RST_MCPU_STATE</name>
	
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>CMAC_RST_BS_STATE</name>
	
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>CMAC2SYS_IRQ_CLR</name>
	<description>Writing "0" will have no effect.
Writing "1" will clear the CMAC2SYS_IRQ, a process that depends on the state of CMAC and the relationship of the PCLK and CMAC clocks.
Reading will return "1" as long as the clearing process is pending, otherwise it will return "0".</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>CMAC2SYS_IRQ_STATE</name>
	
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CM_DIAG_IRQ1_EDGE_REG</name>
	<description>Diagnostic IRQ on Word1 - Edge Register</description>
	<addressOffset>0x00002104</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DIAG1_PHY_TX_EN_RFCU</name>
	
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DIAG1_PHY_RX_EN_RFCU</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_26</name>
	
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_25</name>
	
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_24</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_23</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_22</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_21</name>
	<description>0: The positive edge is selected to set the corresponding bit of CM_DIAG_IRQ1_STAT_REG.
1: The negative edge is selected.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CM_DIAG_IRQ1_MASK_REG</name>
	<description>Diagnostic IRQ on Word1 - Mask Register</description>
	<addressOffset>0x0000210c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DIAG1_SIGNAL_DETECTED</name>
	
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>DIAG1_MATCH0101</name>
	
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>DIAG1_SYNC_FOUND</name>
	
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>DIAG1_PHY_TX_EN_RFCU</name>
	
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DIAG1_PHY_RX_EN_RFCU</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_26</name>
	
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_25</name>
	
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_24</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_23</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_22</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_21</name>
	<description>1: Raise an DIAG_IRQ when the corresponding bit of CM_DIAG_IRQ1_STAT_REG is also "1".
0: Mask the state of the corresponding bit of CM_DIAG_IRQ1_STAT_REG in order to not trigger DIAG_IRQ.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
