irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>CM_DIAG_IRQ1_STAT_REG</name>
	<description>Diagnostic IRQ on Word1 - Status Register</description>
	<addressOffset>0x00002108</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DIAG1_SIGNAL_DETECTED</name>
	
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>DIAG1_MATCH0101</name>
	
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>DIAG1_SYNC_FOUND</name>
	
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>DIAG1_PHY_TX_EN_RFCU</name>
	
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DIAG1_PHY_RX_EN_RFCU</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_26</name>
	
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_25</name>
	
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_24</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_23</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_22</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_21</name>
	<description>1: the corresponding event is pending.
0: the corresponding event is not pending.
Writing a '1' will clear the corresponding bit.
Writing a '0' into a bit will have no effect.
Use this register to detect and acknowledge the source that triggers the DIAG_IRQ.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CM_DIAG_IRQ1_WORD_REG</name>
	<description>Diagnostic IRQ on Word1 - Word1 Register</description>
	<addressOffset>0x00002100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DIAG1_SIGNAL_DETECTED</name>
	
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>DIAG1_MATCH0101</name>
	
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>DIAG1_SYNC_FOUND</name>
	
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>DIAG1_PHY_TX_EN_RFCU</name>
	
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DIAG1_PHY_RX_EN_RFCU</name>
	
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_26</name>
	
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_25</name>
	
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_24</name>
	
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_23</name>
	
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_22</name>
	
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DIAG1_DCF_21</name>
	<description>Same signal as the one in CM_DIAG_WORD1_REG.
Refer to CM_DIAG_WORD1_REG for signal description.</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CM_WDOG_REG</name>
	<description>CMAC Watch Dog Control Register</description>
	<addressOffset>0x00002004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00001fff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SYS2CMAC_WDOG_FREEZE</name>
	<description>A read-only copy of SET_FREEZE_REG-&gt;FRZ_CMAC_WDOG value.</description>
	<access>read-only</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>SYS2CMAC_WDOG_FREEZE_DIS</name>
	<description>Setting to '1' will mask the SYS2CMAC_WDOG_FREEZE, which is provided by SET_FREEZE_REG-&gt;FRZ_CMAC_WDOG.
The field can be only set to '1', so it can be set during the initilization and it will not change during the reloadings.
It can be reseted either via power cycling the Power Domain or via the CLK_RADIO_REG-&gt;CMAC_SYNCH_RESET.</description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	
</field><field>
	<name>CM_WDOG_EXPIRE</name>
	<description>This bit automatically is set to "1" as soon as CM_WDOG_CNT=0, causing CM_WDOG_CNT to start counting again from the value of "16" and also asserting CM_ERROR_REG-&gt;CM_WDOG_EXPIRE_ERR.
If the SW will write CM_WDOG_EXPIRE = 0 and CM_WDOG_CNT=0, then at the next WDOG clock cycle the CM_WDOG_EXPIRE will automatically be set to to "1".
If the SW will write CM_WDOG_EXPIRE = 1 and CM_WDOG_CNT=0, then at the next WDOG clock cycle the CM_WDOG_SYS_RST_REQ will automatically be set to "1".
The CM_WDOG_SYS_RST_REQ will reset the system and will update the RESET_STAT_REG-&gt;CMAC_WDOGRESET_STAT.
Refer also to CM_EXC_STAT_REG-&gt;EXC_WDOG_EARLY.</description>
	<access>read-write</access>
	<bitRange>[29:29]</bitRange>
	
</field><field>
	<name>CM_WDOG_SYS_RST_REQ</name>
	<description>Refer to CM_WDOG_EXPIRE.</description>
	<access>read-only</access>
	<bitRange>[28:28]</bitRange>
	
</field><field>
	<name>CM_WDOG_WRITE_VALID</name>
	<description>In order to allow a write of any of the remaining fields, this value must be also written simultaneously with the value "3".
Reading this field will return always '0'.</description>
	<access>write-only</access>
	<bitRange>[18:17]</bitRange>
	
</field><field>
	<name>CM_WDOG_CNT</name>
	<description>Provides access to the counter, which counts down every 10.24 msec.
FW should reload the WDOG counter by writing to CM_WDOG_REG the value (CM_WDOG_CNT | CM_WDOG_WRITE_VALID).
The counter will start counting immediately after the power up of the Power Domain.</description>
	<access>read-write</access>
	<bitRange>[12:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CMAC_TIMER_SLP</name>
	<version>1.0</version>
	<description>CMAC_TIMER_SLP registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50010400</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>12</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>CM_SLP_CTRL2_REG</name>
	<description>CMAC Sleep Control 2 (no RMW)</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CMAC_WAKEUP_ON_SWD_STATE</name>
	<description>Provides the current state of CMAC_WAKEUP_ON_SWD.
Writing '1' will clear this bit.
Writing '0' has no effect.
When CM_SLP_CTRL_REG-&gt;CMAC_WAKEUP_ON_SWD_EN=1 and the Radio Power Domain is down and SYS_CTRL_REG-&gt;CMAC_DEBUGGER_ENABLE=1 then any negative edge on SWDCLK pin will set the CMAC_WAKEUP_ON_SWD.
The CMAC_WAKEUP_ON_SWD logically OR-ed with SLP_TIMER_IRQ is connected to PDC and thus it is able to wake up the CMAC, allowing the connection of CMAC Cortex with the debugger.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>SLP_TIMER_ACTIVE</name>
	<description>Refer to CM_SLP_CTRL_REG-&gt;SLP_TIMER_ACTIVE</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>LP_CLK_STATE</name>
	<description>Refer to CM_SLP_CTRL_REG-&gt;LP_CLK_STATE.</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>SLP_TIMER_CNT_SIGN</name>
	<description>Provides the SLP_TIMER_CNT[32] bit, which corresponds to the sign bit.</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>SLP_TIMER_IRQ_SET</name>
	<description>Writing '1' will cause the IRQ to be set. This field remains to '1' until the IRQ is set.
Writing '0' has no effect.
System CPU SW may use this field to force CMAC to wakeup through SLP_TIMER.
Note that typically SW wakes up CMAC through the SYS2CMAC_IRQ (via PDC).</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>SLP_TIMER_IRQ_CLR</name>
	<description>Writing '1' will cause the IRQ to be cleared. This field remains to '1' until the IRQ is cleared.
Writing '0' has no effect.
Note that clearing the IRQ is not possible as long as the Timer is "1", since the Expire event has higher priority.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SLP_TIMER_IRQ_STATE</name>
	<description>Provides the current state of the CMAC Sleep Timer IRQ.</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
