irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>CM_SLP_CTRL_REG</name>
	<description>CMAC Sleep Control 1 (allowed to RMW)</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CMAC_WAKEUP_ON_SWD_EN</name>
	<description>If '1' then enable the generation of CMAC_WAKEUP_ON_SWD.</description>
	<access>read-write</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>TCLK_FROM_LPCLK</name>
	<description>The FW must be synchronized with LP_CLK negedge in order to change this bit.</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>TCLK_FROM_PCLK</name>
	<description>The FW must be synchronized with LP_CLK negedge in order to change this bit.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>SLP_TIMER_ACTIVE</name>
	
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>LP_CLK_STATE</name>
	<description>Current state of LP_CLK.
Typically used only by System CPU.
Refer also to CM_EV_LATCHED_REG-&gt;EV1C_LP_CLK_* and CM_SLP_CTRL2_REG-&gt;LP_CLK_STATE.</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>SLP_TIMER_CNT_SIGN</name>
	<description>Refer to CM_SLP_CTRL2_REG-&gt;SLP_TIMER_CNT_SIGN.</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>SLP_TIMER_SW</name>
	<description>The FW must be synchronized with LP_CLK negedge in order to change this bit.
If 1: Initiate the sequence of stop counting with LL_TIMERx and start counting with the Sleep Timer.
If 0: Initiate the sequence of stop counting with Sleep Timer and start counting with the LL_TIMERx.
Writing a "1" will be effective only if SLP_TIMER_SEL_PCLK is written also with "0", regardless of the previous state of SLP_TIMER_SEL_PCLK.
Writing a "0" will be effective only if SLP_TIMER_SEL_PCLK is written also with "1", regardless of the previous state of SLP_TIMER_SEL_PCLK.
The end of the sequence is reported via SLP_TIMER_ACTIVE.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CM_SLP_TIMER_REG</name>
	<description>CMAC Sleep Timer</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CM_SLP_TIMER_VALUE</name>
	<description>The low 32 bits of the signed value of the 33 bit CMAC Sleep Timer.
The sign bit 32 can be fetched via CM_SLP_CTRL_REG-&gt;SLP_TIMER_CNT_SIGN.
It's possible to perform only 32-bit write access, while every write access will set the sign bit 32 to '0'.
A read or write access with CM_SLP_CTRL_REG-&gt;TCLK_FROM_PCLK equal to 0 will cause a bus error.
As long as the value is "1" then the expiration and the IRQ signal are asserted. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CRG_COM</name>
	<version>1.0</version>
	<description>CRG_COM registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50020900</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>16</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>CLK_COM_REG</name>
	<description>Peripheral divider register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00030000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>LCD_EXT_CLK_SEL</name>
	<description>Select LCD external clock speed.
0x0: 1 Hz
0x1: 62.5 Hz
0x2: 125 Hz
0x3: off</description>
	<access>read-write</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>SNC_DIV</name>
	<description>Division factor for SNC, w.r.t. pclk setting
0x0 = divide by 1
0x1 = divide by 2
0x2 = divide by 4
0x3 = divide by 8 </description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	
</field><field>
	<name>SDADC_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>I2C2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>I2C2_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>I2C_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>I2C_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>SPI2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>SPI2_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>SPI_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>SPI_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>UART3_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>UART3_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>UART2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>UART2_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>UART_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
