irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RESET_CLK_COM_REG</name>
	<description>Peripheral divider register RESET register. Reads back 0x0000</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>LCD_EXT_CLK_SEL</name>
	<description>Select LCD external clock speed.
0x0: 1 Hz
0x1: 62.5 Hz
0x2: 125 Hz
0x3: off</description>
	<access>read-write</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>SNC_DIV</name>
	<description>Division factor for SNC, w.r.t. pclk setting
0x0 = divide by 1
0x1 = divide by 2
0x2 = divide by 4
0x3 = divide by 8 </description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	
</field><field>
	<name>SDADC_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>I2C2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>I2C2_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>I2C_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>I2C_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>SPI2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>SPI2_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>SPI_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>SPI_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>UART3_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>UART3_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>UART2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>UART2_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>UART_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SET_CLK_COM_REG</name>
	<description>Peripheral divider register SET register. Reads back 0x0000</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>LCD_EXT_CLK_SEL</name>
	<description>Select LCD external clock speed.
0x0: 1 Hz
0x1: 62.5 Hz
0x2: 125 Hz
0x3: off</description>
	<access>read-writeonce</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>SNC_DIV</name>
	<description>Division factor for SNC, w.r.t. pclk setting
0x0 = divide by 1
0x1 = divide by 2
0x2 = divide by 4
0x3 = divide by 8 </description>
	<access>read-writeonce</access>
	<bitRange>[15:14]</bitRange>
	
</field><field>
	<name>SDADC_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-writeonce</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>I2C2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-writeonce</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>I2C2_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-writeonce</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>I2C_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-writeonce</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>I2C_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-writeonce</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>SPI2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-writeonce</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>SPI2_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-writeonce</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>SPI_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-writeonce</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>SPI_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-writeonce</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>UART3_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-writeonce</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>UART3_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-writeonce</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>UART2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-writeonce</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>UART2_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-writeonce</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>UART_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-writeonce</access>
	<bitRange>[0:0]</bitRange>
	
