irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>SET_CLK_PER_REG</name>
	<description>Peripheral divider register SET register, reads 0x0000</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>MC_TRIG_DIV</name>
	<description>Trigger divider for the motor controller
0x0: divide LP_CLK by 1
0x1: divide LP_CLK by 2
...
0x1F: divide LP_CLK by 32</description>
	<access>read-writeonce</access>
	<bitRange>[12:8]</bitRange>
	
</field><field>
	<name>MC_CLK_DIV</name>
	<description>Clock divider for the motor controller slot. The slots are clocked on (a PCLK synchronized version of) the LP clock, and can be further divided by this divider:
0x0: divide LP clock by 1
0x1: divide LP clock by 2
...
0x1F: divide LP clock by 32</description>
	<access>read-writeonce</access>
	<bitRange>[7:3]</bitRange>
	
</field><field>
	<name>MC_CLK_EN</name>
	<description>Enables the clock</description>
	<access>read-writeonce</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>LRA_CLK_EN</name>
	<description>Enables the clock</description>
	<access>read-writeonce</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>GPADC_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock/ 2</description>
	<access>read-writeonce</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SRC_DIV_REG</name>
	<description>SRC divider and enables</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>CLK_SRC_EN</name>
	<description>Enable for the internally generated SRC clock
The SRC_DIV must be set before or together with CLK_SRC_EN.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>SRC_DIV</name>
	<description>SRC clock divider</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CRG_SYS</name>
	<version>1.0</version>
	<description>CRG_SYS registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50040500</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>68</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>BATCHECK_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>BATCHECK_LOAD_ENABLE</name>
	<description>Enable a current load on the battery.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>BATCHECK_ILOAD</name>
	<description>Set the current load to (ILOAD+1) mA.</description>
	<access>read-write</access>
	<bitRange>[6:4]</bitRange>
	
</field><field>
	<name>BATCHECK_TRIM</name>
	<description>Trim the current load with steps of 2.7% from -19.1% to +19.1%.
0: +0.0% , 8: -0%
1: +2.7% , 9: -2.7%
2: +5.5% , 10: -5.5%
3: +8.2% , 11: -8.2%
4: +10.9% , 12: -10.9%
5: +13.6% , 13: -13.6%
6: +16.4% , 14: -16.4%
7: +19.1% , 15: -19.1%</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_SYS_REG</name>
	<description>Peripheral divider register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>CLK_CHG_EN</name>
	<description>Enables the clocks for the charger FSM block</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>LCD_RESET_REQ</name>
	<description>Generates a SW reset towards the LCD controller.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>LCD_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LCD_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SYSRAM_CONFIG_REG</name>
	<description>System RAM configurations</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000180</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>CACHERAM_LPMX</name>
	<description>LPM Enable. Asynchronous. Active low. Asserting lpmx low will
enable the leakage reduction circuit to the memory cells. </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>CACHERAM_MARGIN</name>
	<description>Margin Control. Asynchronous. Recommended setting is 2b10.
These bits control the read and write margin. 2b00 provides the
highest margin (slowest). 2b11 provides the least margin (fastest).</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>CACHERAM_DST</name>
	<description>Disable Self Time. Asynchronous. Active high. When asserted
high, dst overrides the self-timed circuitry and causes the read and
write margin to be fixed by the falling edge of clk. This mode is only
enabled if margin is set to 2b00 (slowest setting). dst should be
set low during normal operation.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>M31RAM_MSE</name>
	<description>Margin overrule enable for CRYPTO, QSPIC and USB RAM</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>M31RAM_MS</name>
	<description>Margin setting for CRYPTO, QSPIC and USB RAM</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
