irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CRG_TOP</name>
	<version>1.0</version>
	<description>CRG_TOP registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>256</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>ANA_STATUS_REG</name>
	
	<addressOffset>0x000000ec</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>COMP_VBUS_HIGH</name>
	
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>COMP_VBUS_LOW</name>
	
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>COMP_VBAT_HIGH</name>
	
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>COMP_VBAT_LOW</name>
	
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>COMP_VDD_OK</name>
	
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>VBUS_AVAILABLE</name>
	
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>BANDGAP_OK</name>
	
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>LDO_3V0_VBAT_OK</name>
	
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>LDO_3V0_VBUS_OK</name>
	
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>LDO_1V8P_OK</name>
	
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>LDO_1V8_OK</name>
	
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>LDO_RADIO_OK</name>
	
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>LDO_CORE_OK</name>
	
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>LDO_VDD_HIGH_OK</name>
	
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>BOD_VIN_NOK</name>
	
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>AON_SPARE_REG</name>
	<description>Spare register</description>
	<addressOffset>0x000000c8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>KEEP_VDDNOTSLEEP_ON</name>
	<description>If this bit is set to '1', then the VDD_NOTSLEEP is not switched off during sleep.
This means higher sleep leakage current.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>POR_TST_DET_DISABLE</name>
	
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BANDGAP_REG</name>
	<description>bandgap trimming</description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>BANDGAP_ENABLE_CLAMP</name>
	<description>Enables a supply clamp inside the bandgap that improves PSRR. Should be enabled by software after cold boot.</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>BGR_ITRIM</name>
	<description>Current trimming for bias </description>
	<access>read-write</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>BGR_TRIM</name>
	<description>Trim register for bandgap </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BIAS_VREF_SEL_REG</name>
	
	<addressOffset>0x000000a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000bb</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>BIAS_VREF_RF2_SEL</name>
	<description>same as BIAS_VREF_RF1_SEL</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>BIAS_VREF_RF1_SEL</name>
	<description>Vref_code | Vref_Voltage (mV)
0:900
1:930
2:960
3:990
4:1020
5:1050
6:1080
7:1110
8:1140
9:1170
10:1200
11:1230
12:1260
13:1290
14:1320
15:1350
</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BOD_CTRL_REG</name>
	<description>Brown Out Detection control register</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0001fc80</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>BOD_TEST_ENABLE</name>
	
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>BOD_V14_RST_EN</name>
	<description>If set, generate power-on reset on channel V14</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>BOD_V18F_RST_EN</name>
	<description>If set, generate power-on reset on channel V18F</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>BOD_VDD_RST_EN</name>
	<description>If set, generate power-on reset on channel VDD</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>BOD_V18P_RST_EN</name>
	<description>If set, generate power-on reset on channel V18P</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>BOD_V18_RST_EN</name>
	<description>If set, generate power-on reset on channel V18</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>BOD_V30_RST_EN</name>
	<description>If set, generate power-on reset on channel V30</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>BOD_VBAT_RST_EN</name>
	<description>If set, generate power-on reset on channel VBAT</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>BOD_V14_EN</name>
	<description>Enable brown-out detection for channel V14</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>BOD_V18F_EN</name>
	<description>Enable brown-out detection for channel V18F</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>BOD_VDD_EN</name>
	<description>Enable brown-out detectionfor channel VDD</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>BOD_V18P_EN</name>
	<description>Enable brown-out detectio for channel V18P</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>BOD_V18_EN</name>
	<description>Enable brown-out detectionfor channel V18</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>BOD_V30_EN</name>
	<description>Enable brown-out detection for channel V30</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>BOD_VBAT_EN</name>
	<description>Enable brown-out detectionfor channel VBAT</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>BOD_STATUS_CLEAR</name>
	<description>Clears the brownout status register</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>BOD_CLK_DIV</name>
	<description>Brown-out detector clock divider.
0x0: BOD_CLK/1
0x1: BOD_CLK/2
0x2: BOD_CLK/4
0x3: BOD_CLK/8 (BOD_CLK = 1MHz)</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
