irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>BOD_LVL_CTRL0_REG</name>
	
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x041e0eaf</resetValue>
	<resetMask>0x07ffffff</resetMask>
	<fields>
	<field>
	<name>BOD_LVL_V18</name>
	<description>Brown-out detection level for V18.
VTH_BOD = 1.2 * (BOD_LVL+1)/192 </description>
	<access>read-write</access>
	<bitRange>[26:18]</bitRange>
	
</field><field>
	<name>BOD_LVL_V30</name>
	<description>Brown-out detection level for V30.
VTH_BOD = 1.2 * (BOD_LVL+1)/192 </description>
	<access>read-write</access>
	<bitRange>[17:9]</bitRange>
	
</field><field>
	<name>BOD_LVL_VBAT</name>
	<description>Brown-out detection level for VBAT..
VTH_BOD = 1.5*(1.2 * (BOD_LVL+1)/192)</description>
	<access>read-write</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BOD_LVL_CTRL1_REG</name>
	
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00df4f07</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields>
	<field>
	<name>BOD_LVL_VDD_RET</name>
	<description>Brown-out detection level for VDD in sleep.
VTH_BOD = 1.2 * (BOD_LVL+1)/192 </description>
	<access>read-write</access>
	<bitRange>[24:17]</bitRange>
	
</field><field>
	<name>BOD_LVL_VDD_ON</name>
	<description>Brown-out detection level for VDD in active.
VTH_BOD = 1.2 * (BOD_LVL+1)/192 </description>
	<access>read-write</access>
	<bitRange>[16:9]</bitRange>
	
</field><field>
	<name>BOD_LVL_V18P</name>
	<description>Brown-out detection level for V18P.
VTH_BOD = 1.2 * (BOD_LVL+1)/192 </description>
	<access>read-write</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BOD_LVL_CTRL2_REG</name>
	
	<addressOffset>0x0000006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00018f07</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>BOD_LVL_V14</name>
	<description>Brown-out detection level for V14
VTH_BOD = 1.2 * (BOD_LVL+1)/192 </description>
	<access>read-write</access>
	<bitRange>[17:9]</bitRange>
	
</field><field>
	<name>BOD_LVL_V18F</name>
	<description>Brown-out detection level for V18F.
VTH_BOD = 1.2 * (BOD_LVL+1)/192 </description>
	<access>read-write</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BOD_STATUS_REG</name>
	
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000000</resetMask>
	<fields>
	</fields>
</register><register>
	<name>CLK_AMBA_REG</name>
	<description>HCLK, PCLK, divider and clock gates</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000022</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>QSPI2_ENABLE</name>
	<description>Clock enable for QSPI RAM controller </description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>QSPI2_DIV</name>
	<description>QSPI divider
00 = divide by 1
01 = divide by 2
10 = divide by 4
11 = divide by 8</description>
	<access>read-write</access>
	<bitRange>[14:13]</bitRange>
	
</field><field>
	<name>QSPI_ENABLE</name>
	<description>Clock enable for QSPI controller </description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>QSPI_DIV</name>
	<description>QSPI divider
00 = divide by 1
01 = divide by 2
10 = divide by 4
11 = divide by 8</description>
	<access>read-write</access>
	<bitRange>[11:10]</bitRange>
	
</field><field>
	<name>OTP_ENABLE</name>
	<description>Clock enable for OTP controller </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>TRNG_CLK_ENABLE</name>
	<description>Clock enable for TRNG block </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>AES_CLK_ENABLE</name>
	<description>Clock enable for AES crypto block </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>PCLK_DIV</name>
	<description>APB interface clock, Cascaded with HCLK:
00 = divide hclk by 1
01 = divide hclk by 2
10 = divide hclk by 4
11 = divide hclk by 8 </description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>HCLK_DIV</name>
	<description>AHB interface and microprocessor clock. Source clock divided by:
000 = divide hclk by 1
001 = divide hclk by 2
010 = divide hclk by 4
011 = divide hclk by 8
1xx = divide hclk by 16</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_CTRL_REG</name>
	<description>Clock control register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00002041</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RUNNING_AT_PLL96M</name>
	<description>Indicates that the PLL96MHz clock is used as clock, and may not be switched off </description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>RUNNING_AT_XTAL32M</name>
	<description>Indicates that the XTAL32M clock is used as clock, and may not be switched off </description>
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>RUNNING_AT_RC32M</name>
	<description>Indicates that the RC32M clock is used as clock </description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>RUNNING_AT_LP_CLK</name>
	<description>Indicates that either the LP_CLK is being used as clock </description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>CLK_WDOG_ENABLE</name>
	<description>Enables the CLOCK watchdog</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>USB_CLK_SRC</name>
	<description>Selects the USB source clock
0 : PLL clock, divided by 2
1 : HCLK</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>LP_CLK_SEL</name>
	<description>Sets the clock source of the LowerPower clock
0x0: RC32K
0x1: RCX
0x2: XTAL32K through the oscillator with an external Crystal.
0x3: XTAL32K through an external square wave generator (set PID of GPIO to FUNC_GPIO)</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>SYS_CLK_SEL</name>
	<description>Selects the clock source.
0x0 : XTAL32M
0x1 : RC32M
0x2 : The Low Power clock is used
0x3 : The PLL96Mhz is used</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><enumeratedValue>
	<name>XTAL16M</name>
	<value>0x0</value>
	<description>Selects the XTAL16M as source clock</description>
</enumeratedValue><enumeratedValue>
	<name>RC16M</name>
	<value>0x1</value>
	<description>Selects the RC16M as source clock</description>
</enumeratedValue><enumeratedValue>
	<name>LP_CLK</name>
	<value>0x2</value>
	<description>Selects the LP_CLK, defined by CLK32K_SOURCE</description>
</enumeratedValue><enumeratedValue>
	<name>PLL96M</name>
	<value>0x3</value>
	<description>Selects the PLL96M as source clock</description>
</enumeratedValue></enumeratedValues>
</field></fields>
</register><register>
	<name>CLK_RADIO_REG</name>
	<description>Radio PLL control register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>RFCU_ENABLE</name>
	<description>Enable the RF control Unit clock </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>CMAC_SYNCH_RESET</name>
	<description>Force synchronous reset to CMAC core and Sleep Timer. Its effective only when both Radio and Timer Power Domains are powered and the clocks are enabled.
CMAC CPU and CMAC registers, including the retained ones, will be reset.
The 1 should be kept for enough time to make sure that it will be captured by CMAC, Low Power and APB clocks.
Should be kept to 1 at least until CM_SLP_SYS_REG-&gt;CMAC_RST_BS = 1.
To avoid issues with CMAC CPU Debugger its recommended to keep the resetting period short.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>CMAC_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>CMAC_CLK_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>CMAC_DIV</name>
	<description>Division factor for CMAC
0x0 = divide by 1
0x1 = divide by 2
0x2 = divide by 4
0x3 = divide by 8 </description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
