irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>CLK_RC32K_REG</name>
	<description>32 kHz RC oscillator register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>RC32K_TRIM</name>
	<description>0000 = lowest frequency
0111 = default
1111 = highest frequency </description>
	<access>read-write</access>
	<bitRange>[4:1]</bitRange>
	
</field><field>
	<name>RC32K_ENABLE</name>
	<description>Enables the 32kHz RC oscillator </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_RC32M_REG</name>
	<description>Fast RC control register</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x001804ae</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields>
	<field>
	<name>RC32M_STARTUP_DISABLE</name>
	<description>Gates the RC32 enable from the startup block.
The enable from the clksel and CLK_RC32M_REG[0] are not gated by this bit.</description>
	<access>read-write</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>RC32M_INIT_RANGE</name>
	<description>Course frequency adjustment</description>
	<access>read-write</access>
	<bitRange>[21:20]</bitRange>
	
</field><field>
	<name>RC32M_INIT_DEL</name>
	<description>Fine frequency adjustment</description>
	<access>read-write</access>
	<bitRange>[19:12]</bitRange>
	
</field><field>
	<name>RC32M_INIT_DTCF</name>
	<description>Fine duty-cycle adjustment.
0x0: minimum
0x2: default
0x4: maximum</description>
	<access>read-write</access>
	<bitRange>[11:9]</bitRange>
	
</field><field>
	<name>RC32M_INIT_DTC</name>
	<description>Course duty-cycle adjustment.
0x0: minimum
0x5: default
0xA: maximum</description>
	<access>read-write</access>
	<bitRange>[8:5]</bitRange>
	
</field><field>
	<name>RC32M_BIAS</name>
	<description>Bias adjustment</description>
	<access>read-write</access>
	<bitRange>[4:1]</bitRange>
	
</field><field>
	<name>RC32M_ENABLE</name>
	<description>Enables the 32MHz RC oscillator </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_RCX_REG</name>
	<description>RCX-oscillator control register</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000afc</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>RCX_BIAS</name>
	<description>LDO bias current.
0x0: minimum
0xF: maximum</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>RCX_C0</name>
	<description>Add unit capacitance to RC-time delay.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>RCX_CADJUST</name>
	<description>Adjust capacitance part of RC-time delay.
0x00: minimum capacitance
0x1F: maximum capacitance</description>
	<access>read-write</access>
	<bitRange>[6:2]</bitRange>
	
</field><field>
	<name>RCX_RADJUST</name>
	<description>Adjust resistance part of RC-time delay. Lower resistance increases power consumption.
0x0: maximum resistance
0x1: minimum resistance</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RCX_ENABLE</name>
	<description>Enable the RCX oscillator</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_RTCDIV_REG</name>
	<description>Divisor for RTC 100Hz clock</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00051ea8</resetValue>
	<resetMask>0x003fffff</resetMask>
	<fields>
	<field>
	<name>RTC_RESET_REQ</name>
	<description>Reset request for the RTC module</description>
	<access>read-write</access>
	<bitRange>[21:21]</bitRange>
	
</field><field>
	<name>RTC_DIV_ENABLE</name>
	<description>Enable for the 100 Hz generation for the RTC block</description>
	<access>read-write</access>
	<bitRange>[20:20]</bitRange>
	
</field><field>
	<name>RTC_DIV_DENOM</name>
	<description>Selects the denominator for the fractional division:
0b0: 1000
0b1: 1024</description>
	<access>read-write</access>
	<bitRange>[19:19]</bitRange>
	
</field><field>
	<name>RTC_DIV_INT</name>
	<description>Integer divisor part for RTC 100Hz generation</description>
	<access>read-write</access>
	<bitRange>[18:10]</bitRange>
	
</field><field>
	<name>RTC_DIV_FRAC</name>
	<description>Fractional divisor part for RTC 100Hz generation.
if RTC_DIV_DENOM=1, &lt;RTC_DIV_FRAC&gt; out of 1024 cycles will divide by &lt;RTC_DIV_INT+1&gt;, the rest is &lt;RTC_DIV_INT&gt;
If RTC_DIV_DENOM=0, &lt;RTC_DIV_FRAC&gt; out of 1000 cycles will divide by &lt;RTC_DIV_INT+1&gt;, the rest is &lt;RTC_DIV_INT&gt;</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_SWITCH2XTAL_REG</name>
	<description>Switches clock from RC32M to XTAL32M</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>SWITCH2XTAL</name>
	<description>When writing to this register, the clock switch will happen from RC32M to XTAL32M. If any other clock is selected than RC32M, the selection is discarded.</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>CLK_TMR_REG</name>
	<description>Clock control for the timers</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields>
	<field>
	<name>TMR2_PWM_AON_MODE</name>
	<description>Maps Timer2_pwm onto P1_06.
This state is preserved during deep sleep, to allow PWM output on the pad during deep sleep.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>TMR_PWM_AON_MODE</name>
	<description>Maps Timer1_pwm onto P1_01
This state is preserved during deep sleep, to allow PWM output on the pad during deep sleep.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>WAKEUPCT_ENABLE</name>
	<description>Enables the clock</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
