irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>CLK_XTAL32K_REG</name>
	<description>32 kHz XTAL oscillator register</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000002e</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>XTAL32K_DISABLE_OUTPUT</name>
	<description>Disables output buffer, test only</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>XTAL32K_XTAL1_BIAS_DISABLE</name>
	<description>Disables the 1nA bias current through the pull down diode</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>XTAL32K_DISABLE_AMPREG</name>
	<description>Setting this bit disables the amplitude regulation of the XTAL32kHz oscillator.
Set this bit to '1' for an external clock to XTAL32Kp
Keep this bit '0' with a crystal between XTAL32Kp and XTAL32Km</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>XTAL32K_CUR</name>
	<description>Bias current for the 32kHz XTAL oscillator. 0000 is minimum, 1111 is maximum, 0011 is default. For each application there is an optimal setting for which the start-up behavior is optimal </description>
	<access>read-write</access>
	<bitRange>[6:3]</bitRange>
	
</field><field>
	<name>XTAL32K_RBIAS</name>
	<description>Setting for the bias resistor. 00 is maximum, 11 is minimum. Prefered setting will be provided by Dialog </description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	
</field><field>
	<name>XTAL32K_ENABLE</name>
	<description>Enables the 32kHz XTAL oscillator </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DISCHARGE_RAIL_REG</name>
	<description>Immediate rail resetting. There is no LDO/DCDC gating</description>
	<addressOffset>0x000000d4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields>
	<field>
	<name>RESET_V18P</name>
	<description>1: Enables immediate discharging of the V18P rail. Note that the source is not disabled.
0: disable immediate discharging of the V18P rail.
This bit is ORed with the automatic function controlled by PMU_RESET_RAIL_REG.RESET_V18P</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RESET_V18</name>
	<description>1: Enables immediate discharging of the V18 rail. Note that the source is not disabled.
0: disable immediate discharging of the V18 rail.
This bit is ORed with the automatic function controlled by PMU_RESET_RAIL_REG.RESET_V18</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RESET_V14</name>
	<description>1: Enables immediate discharging of the V14 rail. Note that the source is not disabled.
0: disable immediate discharging of the V14 rail.
This bit is ORed with the automatic function controlled by PMU_RESET_RAIL_REG.RESET_V14</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>HW_CONFIG_REG</name>
	<description>Hardware configuration register</description>
	<addressOffset>0x000000b8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>REDUCE_RAM_SIZE</name>
	<description>0x0: no RAM reduction
0x1: remove the last 128 kByte, moving MTB down to RAM6
0x2, 0x3: remove the last 256 kByte, moving MTB down to RAM4</description>
	<access>read-writeonce</access>
	<bitRange>[12:11]</bitRange>
	
</field><field>
	<name>DISABLE_MOTORC</name>
	<description>Permanently disable Motor Controller
Permanently disable the controller enable bit
</description>
	<access>read-writeonce</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>DISABLE_QSPIRAM</name>
	<description>Permanently disable QSPI RAM clocks</description>
	<access>read-writeonce</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>DISABLE_PWM</name>
	<description>Permanently disable PWM clocks</description>
	<access>read-writeonce</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>DISABLE_LRA</name>
	<description>Permanently disable LRA/ERM clocks
Permanently disable LRA/ERM clocks
</description>
	<access>read-writeonce</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DISABLE_APU</name>
	<description>Permanently disable APU clocks
Permanently disable APU blocks
</description>
	<access>read-writeonce</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DISABLE_USB</name>
	<description>Permanently disable the clock of the USB Controller.
Permanently disable the charger detect circuit.
</description>
	<access>read-writeonce</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DISABLE_UART3</name>
	<description>Permanently disable UART3 clock</description>
	<access>read-writeonce</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DISABLE_SDADC</name>
	<description>Permanently disable ADC2 LDO.
Permanently disable ADC2 clock
</description>
	<access>read-writeonce</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DISABLE_GPADC</name>
	<description>Permanently disable ADC LDO.
Permanently disable ADC clock.
</description>
	<access>read-writeonce</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DISABLE_CHARGER</name>
	<description>Permanently disable the Charger digital FSM. Keep Analog loop in Hold.</description>
	<access>read-writeonce</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DISABLE_LCD</name>
	<description>Permanently disable LCD Controller clock
Permanently disable LCD Controller block
</description>
	<access>read-writeonce</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LDOS_DISABLE_REG</name>
	<description>Force off all LDOs</description>
	<addressOffset>0x000000c4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>LDOS_DISABLE</name>
	<description>If set to '1', the following LDOS are disabled:
LDO_SUPPLY_VBAT (V33)
LDO_SUPPLY_VBUS (V33)
LDO_VBAT_RET (V33)
LDO_1V8_PA
LDO_1V8_PA_RET
LDO_1V8_FLASH
LDO_1V8_FLASH_RET
LDO_CORE (VDD1V2)
</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
