irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>LDO_VDDD_HIGH_CTRL_REG</name>
	<description>LDO control register</description>
	<addressOffset>0x000000a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>LDO_VDDD_HIGH_LOW_ZOUT_DISABLE</name>
	<description>Disables the low Zout switch. The low Zout switch pulls the output of the LDO to ground. When 0, the output of the LDO is pulled to ground when the LDO is disabled. When 1, the output of the LDO remains floating when the LDO is disabled.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>LDO_VDDD_HIGH_STATIC_LOAD_ENABLE</name>
	<description>Enables a static load of approx. 10 uA at the output of the LDO VDDD_HIGH.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>LDO_VDDD_HIGH_ENABLE</name>
	<description>0: LDO VDDD_HIGH off,
1: LDO VDDD_HIGH on.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LDO_VDDD_HIGH_VREF_HOLD</name>
	<description>0: Indicates that the reference input is tracked,
1: Indicates that the reference input is sampled.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P0_PAD_LATCH_REG</name>
	<description>Control the state retention of the GPIO ports</description>
	<addressOffset>0x00000070</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>P0_LATCH_EN</name>
	<description>Direct write to the specific pad_latch_enable signal</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P0_RESET_PAD_LATCH_REG</name>
	<description>Control the state retention of the GPIO ports</description>
	<addressOffset>0x00000078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>P0_RESET_LATCH_EN</name>
	<description>Direct Reset of the marked bits. Reading returns 0x0.</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P0_SET_PAD_LATCH_REG</name>
	<description>Control the state retention of the GPIO ports</description>
	<addressOffset>0x00000074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>P0_SET_LATCH_EN</name>
	<description>Direct Set of the marked bits. Reading returns 0x0.</description>
	<access>read-writeonce</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P1_PAD_LATCH_REG</name>
	<description>Control the state retention of the GPIO ports</description>
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x007fffff</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields>
	<field>
	<name>P1_LATCH_EN</name>
	<description>Direct write to the specific pad_latch_enable signal</description>
	<access>read-write</access>
	<bitRange>[22:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P1_RESET_PAD_LATCH_REG</name>
	<description>Control the state retention of the GPIO ports</description>
	<addressOffset>0x00000084</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields>
	<field>
	<name>P1_RESET_LATCH_EN</name>
	<description>Direct Reset of the marked bits. Reading returns 0x0.</description>
	<access>read-write</access>
	<bitRange>[22:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P1_SET_PAD_LATCH_REG</name>
	<description>Control the state retention of the GPIO ports</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields>
	<field>
	<name>P1_SET_LATCH_EN</name>
	<description>Direct Set of the marked bits. Reading returns 0x0.</description>
	<access>read-writeonce</access>
	<bitRange>[22:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PMU_CTRL_REG</name>
	<description>Power Management Unit control register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>ENABLE_CLKLESS</name>
	<description>Selects the clockless sleep mode. Wakeup is done asynchronously.
When set to '1', the lp_clk is stopped during deep sleep, until a wakeup event (not debounced) is detected by the WAKUPCT block.
When set to '0', the lp_clk continues running, so the MAC counters keep on running.
This mode cannot be combined with regulated sleep, so keep SLEEP_TIMER=0 when using ENABLE_CLKLESS.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>RETAIN_CACHE</name>
	<description>Selects the retainability of the cache block during deep sleep.
'1' is retainable, '0' is power gated</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>SYS_SLEEP</name>
	<description>Put the System powerdomain (PD_SYS) in powerdown.
If this bit is '1', and there is no pending IRQ in the PDC for the M33, the PD_SYS will be switched off.
Wakeup should be handled by the PDC.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>RESET_ON_WAKEUP</name>
	<description>Perform a Hardware Reset after waking up. Booter will be started. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>MAP_BANDGAP_EN</name>
	<description>Maps the bandgap_enable to P06 </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>COM_SLEEP</name>
	<description>Put the Communications powerdomain (PD_COM) in powerdown </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>TIM_SLEEP</name>
	<description>Put the Timers Powerdomain (PD_TIM) in powerdown.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RADIO_SLEEP</name>
	<description>Put the digital part of the radio, including CMAC (PD_RAD) in powerdown </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>PERIPH_SLEEP</name>
	<description>Put the peripherals power domain (PD_PER) in powerdown</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
