irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>PMU_SLEEP_REG</name>
	
	<addressOffset>0x000000f4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00010080</resetValue>
	<resetMask>0x000fffff</resetMask>
	<fields>
	<field>
	<name>CLAMP_VDD_WKUP_MAX</name>
	<description>Forces the VDD clamp voltage to its maximum value when waking up from sleep.</description>
	<access>read-write</access>
	<bitRange>[18:18]</bitRange>
	
</field><field>
	<name>ULTRA_FAST_WAKEUP</name>
	<description>Allows the core to start running on the RC32M while the PMU is still waiting for supplies to settle to the final value. Only use in combination with FAST_WAKEUP and 0.9 V on VDD during sleep.</description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>FAST_WAKEUP</name>
	<description>Speeds up the wakeup process by enabling all LDOs simultaneously instead of in staggered order. Only use if all voltages have been retained during sleep.</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>BOD_SLEEP_INTERVAL</name>
	<description>This is a value defining the interval every which Brown Out Detection is activated to check on the power rails voltage. The value represents BG_REFRESH_INTERVALs</description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	
</field><field>
	<name>BG_REFRESH_INTERVAL</name>
	<description>This is a value defining the interval every which the Bandgap will be activated for refresh. The value represents ticks of lp_clk/64 e.g. 30,5 us * 64 = 1,9 ms.</description>
	<access>read-write</access>
	<bitRange>[11:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PMU_TRIM_REG</name>
	
	<addressOffset>0x000000f8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00008800</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>LDO_1V8_TRIM</name>
	<description>Trim setting for LDO_1V8
Unsigned binary notation, trim range &#177;10 %</description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	
</field><field>
	<name>LDO_1V8P_TRIM</name>
	<description>Trim setting for LDO_1V8P
Unsigned binary notation, trim range &#177;10 %</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>LDO_SUPPLY_VBAT_TRIM</name>
	<description>Trim setting for LDO_SUPPLY_VBUS
Sign-magnitude notation, trim range &#177;10 %</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>LDO_SUPPLY_VBUS_TRIM</name>
	<description>Trim setting for LDO_SUPPLY_VBAT
Sign-magnitude notation, trim range &#177;10 %</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>POR_PIN_REG</name>
	<description>Selects a GPIO pin for POR generation</description>
	<addressOffset>0x00000098</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000003f</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>POR_PIN_POLARITY</name>
	<description>0: Active Low
1: Active High
Note: This applies only for the GPIO pin. Reset pad is always active High
</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>POR_PIN_SELECT</name>
	<description>0x00: P0_00
...
0x1f: P0_31
0x20: P1_00
...
0x36: P1_22
0x37 to 0x3E: reserved
0x3F: POR generation disabled</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>POR_TIMER_REG</name>
	<description>Time for POR to happen</description>
	<addressOffset>0x0000009c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000018</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>POR_TIME</name>
	<description>Time for the POReset to happen.
Formula:
Time = POR_TIME x 4096 x RC32 clock period
Default value: ~3 seconds
</description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	
</field></fields>
</register><register>
	<name>POR_VBAT_CTRL_REG</name>
	<description>Controls the POR on VBAT</description>
	<addressOffset>0x00000094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000326f</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>POR_VBAT_MASK_N</name>
	<description>Enables propagation of the generated POR</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>POR_VBAT_ENABLE</name>
	<description>Enables generation of the POR</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>POR_VBAT_HYST_LOW</name>
	<description>Controls hysteresis of POR. 20mV per step. Must be set to 0x2 when thres_ctrl_low is set to 0xf.</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>POR_VBAT_THRES_HIGH</name>
	<description>High-side (PTAT) threshold contribution:
Level --&gt; Threshold
0x0 --&gt; 1.25V
0x1 --&gt; 1.27V
0x2 --&gt; 1.29V
0x3 --&gt; 1.31V
0x4 --&gt; 1.44V
0x5 --&gt; 1.49V
0x6 --&gt; 1.53V
0x7 --&gt; 1.58V
0x8 --&gt; 1.63V
0x9 --&gt; 1.68V
0xA --&gt; 1.73V
0xB --&gt; 1.78V0xC --&gt; 1.83V0xD --&gt; 1.87V0xE --&gt; 1.92V
0xF --&gt; 1.97V
</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>POR_VBAT_THRES_LOW</name>
	<description>Low-side (CTAT) threshold contribution
Level --&gt; Threshold
0xC --&gt; 1.25V
0xC --&gt; 1.27V
0xC --&gt; 1.29V
0xC --&gt; 1.31V
0x0 --&gt; 1.44V
0x1 --&gt; 1.49V
0x2 --&gt; 1.53V
0x3 --&gt; 1.58V
0x4 --&gt; 1.63V
0x5 --&gt; 1.68V
0x6 --&gt; 1.73V
0x7 --&gt; 1.78V
0x8 --&gt; 1.83V
0x9 --&gt; 1.87V
0xA --&gt; 1.92V
0xB --&gt; 1.97V
0xF --&gt; 1.63V; use only with POR_VBAT_THRES_LOW=0x6 and POR_VBAT_THRES_HYST=0x2</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>POWER_CTRL_REG</name>
	
	<addressOffset>0x000000f0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x08c35bdd</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>VDD_SLEEP_LEVEL</name>
	<description>Level setting for VDD rail when using sleep LDO
0x0: 0.75 V
0x1: 0.80 V
0x2: 0.85 V
0x3: 0.90 V
0x4: 0.95 V
0x5: 1.00 V
0x6: N.A.
0x7: N.A.</description>
	<access>read-write</access>
	<bitRange>[31:29]</bitRange>
	
</field><field>
	<name>VDD_CLAMP_LEVEL</name>
	<description>Level setting for VDD when using clamp
Typical output voltages (not regulated):
0x0: 1037 mV
0x1: 1005 mV
0x2: 978 mV
0x3: 946 mV
0x4: 1120 mV
0x5: 1089 mV
0x6: 1058 mV
0x7: 1030 mV
0x8: 952 mV
0x9: 918 mV
0xA: 889 mV
0xB: 861 mV
0xC: 862 mV
0xD: 828 mV
0xE: 798 mV
0xF: 706 mV ( changed to be lower than ldo_core_ret level)</description>
	<access>read-write</access>
	<bitRange>[28:25]</bitRange>
	
</field><field>
	<name>CLAMP_3V0_VBAT_ENABLE</name>
	<description>Enables (1) or disables (0) clamp that can supply V30 from VBAT</description>
	<access>read-write</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>V18_LEVEL</name>
	<description>Level setting for V18 rail
0x0: 1.2 V
0x1: 1.8 V</description>
	<access>read-write</access>
	<bitRange>[23:23]</bitRange>
	
</field><field>
	<name>V14_LEVEL</name>
	<description>Level setting for V14 rail
0x0: 1.20 V
0x1: 1.25 V
0x2: 1.30 V
0x3: 1.35 V
0x4: 1.40 V
0x5: 1.45 V
0x6: 1.50 V
0x7: 1.55 V</description>
	<access>read-write</access>
	<bitRange>[22:20]</bitRange>
	
</field><field>
	<name>V30_LEVEL</name>
	<description>Level setting for V30 rail
0x0: 3.0 V
0x1: 3.45 V
0x2: 3.3 V
0x3: 3.3 V</description>
	<access>read-write</access>
	<bitRange>[19:18]</bitRange>
	
</field><field>
	<name>VDD_LEVEL</name>
	<description>Level setting for VDD rail
0x0: 0.9 V
0x1: 1.0 V
0x2: 1.1 V
0x3: 1.2 V</description>
	<access>read-write</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>LDO_3V0_REF</name>
	<description>Selects reference source for V30 LDOs
0x0: VDD rail
0x1: Bandgap output</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>LDO_CORE_RET_ENABLE_SLEEP</name>
	<description>Enables (1) or disables (0) LDO_CORE_RET in sleep mode</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>LDO_CORE_RET_ENABLE_ACTIVE</name>
	<description>Enables (1) or disables (0) LDO_CORE_RET in active mode</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>LDO_CORE_ENABLE</name>
	<description>Enables (1) or disables (0) LDO_CORE</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>LDO_3V0_RET_ENABLE_SLEEP</name>
	<description>Enables (1) or disables (0) LDO_3V0_RET in sleep mode</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>LDO_3V0_RET_ENABLE_ACTIVE</name>
	<description>Enables (1) or disables (0) LDO_3V0_RET in active mode</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>LDO_3V0_MODE</name>
	<description>Controls for LDO_3V0
0x0: Disabled
0x1: LDO_VBAT enabled
0x2: LDO_VBUS enabled
0x3: Automatic selection of LDO_VBAT or LDO_VBUS</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>LDO_RADIO_ENABLE</name>
	<description>Enables (1) or disables (0) LDO_RADIO</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>LDO_1V8_RET_ENABLE_SLEEP</name>
	<description>Enables (1) or disables (0) LDO_1V8_RET in sleep mode</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>LDO_1V8_RET_ENABLE_ACTIVE</name>
	<description>Enables (1) or disables (0) LDO_1V8_RET in active mode</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>LDO_1V8_ENABLE</name>
	<description>Enables (1) or disables (0) LDO_1V8</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>SW_1V8F_ENABLE_FORCE</name>
	<description>Forces switch between V18P and V18F rails on</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>LDO_1V8P_RET_ENABLE_SLEEP</name>
	<description>Enables (1) or disables (0) LDO_1V8P_RET in sleep mode</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>LDO_1V8P_RET_ENABLE_ACTIVE</name>
	<description>Enables (1) or disables (0) LDO_1V8P_RET in active mode</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LDO_1V8P_ENABLE</name>
	<description>Enables (1) or disables (0) LDO_1V8P</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
