irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RAM_PWR_CTRL_REG</name>
	<description>Control power state of System RAMS</description>
	<addressOffset>0x000000c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RAM8_PWR_CTRL</name>
	<description>See description of RAM1_PWR_CTRL.</description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	
</field><field>
	<name>RAM7_PWR_CTRL</name>
	<description>See description of RAM1_PWR_CTRL.</description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	
</field><field>
	<name>RAM6_PWR_CTRL</name>
	<description>See description of RAM1_PWR_CTRL.</description>
	<access>read-write</access>
	<bitRange>[11:10]</bitRange>
	
</field><field>
	<name>RAM5_PWR_CTRL</name>
	<description>See description of RAM1_PWR_CTRL.</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>RAM4_PWR_CTRL</name>
	<description>See description of RAM1_PWR_CTRL.</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>RAM3_PWR_CTRL</name>
	<description>See description of RAM1_PWR_CTRL.</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>RAM2_PWR_CTRL</name>
	<description>See description of RAM1_PWR_CTRL.</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>RAM1_PWR_CTRL</name>
	<description>Power state control of the individual RAMs.
When PD_MEM_IS_UP:
0x0: Normal operation
0x1: Normal operation
0x2: Retained (no access possible)
0x3: Off (memory content corrupted)
When PD_MEM_IS_DOWN:
0x0: Retained
0x1: Off (memory content corrupted)
0x2: Retained
0x3: Off (memory content corrupted)</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RESET_STAT_REG</name>
	<description>Reset status register</description>
	<addressOffset>0x000000bc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000003f</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>CMAC_WDOGRESET_STAT</name>
	<description>Indicates that a CMAC-Watchdog timeout has happened. Note that it is also set when a POReset has happened.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>SWD_HWRESET_STAT</name>
	<description>Indicates that a write to SWD_RESET_REG has happened. Note that it is also set when a POReset has happened.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>WDOGRESET_STAT</name>
	<description>Indicates that a Watchdog timeout has happened. Note that it is also set when a POReset has happened.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>SWRESET_STAT</name>
	<description>Indicates that a SW Reset has happened</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>HWRESET_STAT</name>
	<description>Indicates that a HW Reset has happened</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>PORESET_STAT</name>
	<description>Indicates that a PowerOn Reset has happened.
All bitfields of RESET_STAT_REG should be read (in order to check the source of reset) and then cleared to '0', allowing thus the HW to automatically set to '1' the proper bitfields during the next reset event.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SECURE_BOOT_REG</name>
	<description>Controls secure booting</description>
	<addressOffset>0x000000cc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>PROT_QSPI_KEY_READ</name>
	<description>This bit will permanently disable CPU read capability at OTP offset 0x00000B00 and for the complete segment</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>PROT_QSPI_KEY_WRITE</name>
	<description>This bit will permanently disable ANY write capability at OTP offset 0x00000B00 and for the complete segment </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>PROT_AES_KEY_READ</name>
	<description>This bit will permanently disable CPU read capability at OTP offset 0x00000A00 and for the complete segment </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>PROT_AES_KEY_WRITE</name>
	<description>This bit will permanently disable ANY write capability at OTP offset 0x00000A00 and for the complete segment </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>PROT_SIG_KEY_WRITE</name>
	<description>This bit will permanently disable ANY write capability at OTP offset 0x000008C0 and for the complete segment </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>FORCE_CMAC_DEBUGGER_OFF</name>
	<description>This bit will permanently disable the CMAC debugger</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>FORCE_DEBUGGER_OFF</name>
	<description>Follows the respective OTP flag value. Its value is updated by the BootROM code.
1: The system debugger SWD is totally disabled.
0: The system debugger is enabled with DEBUGGER_ENABLE</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SECURE_BOOT</name>
	<description>Follows the respective OTP flag value. Its value is updated by the BootROM code.
1: system is a secure system supporting secure boot
0: system is not supporting secure boot</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>STARTUP_STATUS_REG</name>
	
	<addressOffset>0x000000fc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000fffff</resetMask>
	<fields>
	<field>
	<name>WUP_FAIL_STATE</name>
	<description>Shows state of startup FSM at the moment force_running was asserted</description>
	<access>read-only</access>
	<bitRange>[19:16]</bitRange>
	
</field><field>
	<name>WUP_LDO_RADIO_OK</name>
	<description>LDO_RADIO_OK value at time of LDO_CORE_RADIO state
Only set if force_running is asserted</description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>WUP_BANDGAP_OK</name>
	<description>BANDGAP_OK value at time of RAILS_OK state
Only set if force_running is asserted</description>
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>WUP_COMP_VDD_OK</name>
	<description>COMP_VDD_OK value at time of LDO_CORE_RADIO state
Only set if force_running is asserted</description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>WUP_COMP_VBAT_OK</name>
	<description>COMP_VBAT_LOW value at time of RAILS_OK state
Only set if force_running is asserted</description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>WUP_COMP_VBUS_HIGH</name>
	<description>COMP_VBUS_HIGH value at time of RAILS_OK state
Only set if force_running is asserted</description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>WUP_COMP_VBUS_LOW</name>
	<description>COMP_VBUS_LOW value at time of RAILS_OK state
Only set if force_running is asserted</description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>WUP_VBUS_AVAILABLE</name>
	<description>VBUS_AVAILABLE value at time of LDO_3V0 state
Only set if force_running is asserted</description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>WUP_LDO_CORE_OK</name>
	<description>LDO_CORE_OK value at time of LDO_CORE_RADIO state
Only set if force_running is asserted</description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>WUP_LDO_1V8_OK</name>
	<description>LDO_1V8_OK value at time of LDO_1V8 state
Only set if force_running is asserted</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>WUP_LDO_1V8P_OK</name>
	<description>LDO_1V8P_OK value at time of LDO_1V8P state
Only set if force_running is asserted</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>WUP_LDO_3V0_VBUS_OK</name>
	<description>LDO_3V0_VBUS_OK value at time of LDO_3V0 state
Only set if force_running is asserted</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>WUP_LDO_3V0_VBAT_OK</name>
	<description>LDO_3V0_VBAT_OK value at time of LDO_3V0 state
Only set if force_running is asserted</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>WUP_RAILS_OK_TIMEOUT</name>
	<description>High if RAILS_OK state timed out, set when FSM reaches running state</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>WUP_LDO_1V8_TIMEOUT</name>
	<description>High if LDO_1V8 state timed out, set when FSM reaches running state</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>WUP_LDO_1V8P_TIMEOUT</name>
	<description>High if LDO_1V8P state timed out, set when FSM reaches running state</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>WUP_LDO_3V0_TIMEOUT</name>
	<description>High if LDO_3V0 state timed out, set when FSM reaches running state</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
