irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>SYS_CTRL_REG</name>
	<description>System Control register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000020</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SW_RESET</name>
	<description>Writing a '1' to this bit will generate a SW_RESET.</description>
	<access>write-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>CACHERAM_MUX</name>
	<description>Controls accessiblity of Cache RAM:
0: the cache controller is bypassed, the cacheRAM is visible in the memory space next to the DataRAMs
1: the cache controller is enabled, the cacheRAM is not visible anymore in the memory space</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>TIMEOUT_DISABLE</name>
	<description>Disables timeout in Power statemachine. By default, the statemachine continues if after 2 ms the blocks are not started up. This can be read back from
ANA_STATUS_REG</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>DRA_OFF</name>
	<description>Disables the DRA mode, and released the ARM reset</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>DEBUGGER_ENABLE</name>
	<description>Enable the debugger. This bit is set by the booter according to the OTP header. If not set, the SWDIO and SW_CLK can be used as gpio ports. </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>CMAC_DEBUGGER_ENABLE</name>
	<description>Enable the CMAC debugger. This bit is set by the booter according to the OTP header. If not set, the SWDIO and SW_CLK can be used as gpio ports. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>QSPI_INIT</name>
	<description>Enables QSPI initialization after wakeup</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>REMAP_INTVECT</name>
	<description>0: normal operation
1: If ARM is in address range 0 to 0x1FF then the address is remapped to SYS-RAM 0x07FC.0000 to 0x07FC.01FF. This allows to put the interrupt vector table to be placed in RAM while executing from QSPI</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>REMAP_ADR0</name>
	<description>Controls which memory is located at address 0x0000 for execution.
0x0: ROM
0x1: OTP un-cached
0x2: QSPI FLASH cached
0x3: RAMS un-cached
0x4: QSPI FLASH un-cached (for verification only)
0x5: Reserved
0x6: Cache Data RAM un-cached (CACHERAM_MUX=0, for testing purposes only)
Note 1: DWord (64 bits) access is not supported by the Cache Data RAM interface in mirrored mode (only 32, 16 and 8 bits).
Note 2: DMA access is not supported by the Cache Data RAM interface when REMAP_ADR0=0x6.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SYS_STAT_REG</name>
	<description>System status register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000025a5</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>POWER_IS_UP</name>
	<description>Indicates that the Startup statemachine is finished, and all power regulation is in order.
In UltraFastWakeup mode, the SW needs to wait for this signal before starting any heavy traffic.</description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>DBG_IS_ACTIVE</name>
	<description>Indicates that a debugger is attached.</description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>COM_IS_UP</name>
	<description>Indicates that PD_COM is functional </description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>COM_IS_DOWN</name>
	<description>Indicates that PD_COM is in power down </description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>TIM_IS_UP</name>
	<description>Indicates that PD_TIM is functional </description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>TIM_IS_DOWN</name>
	<description>Indicates that PD_TIM is in power down </description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>MEM_IS_UP</name>
	<description>Indicates that PD_MEM is functional</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>MEM_IS_DOWN</name>
	<description>Indicates that PD_MEM is power down</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>SYS_IS_UP</name>
	<description>Indicates that PD_PER is functional </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>SYS_IS_DOWN</name>
	<description>Indicates that PD_PER is in power down </description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>PER_IS_UP</name>
	<description>Indicates that PD_PER is functional </description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>PER_IS_DOWN</name>
	<description>Indicates that PD_PER is in power down </description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RAD_IS_UP</name>
	<description>Indicates that PD_RAD is functional </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RAD_IS_DOWN</name>
	<description>Indicates that PD_RAD is in power down </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>VBUS_IRQ_CLEAR_REG</name>
	<description>Clear pending IRQ register</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>VBUS_IRQ_CLEAR</name>
	<description>Writing any value to this register will reset the VBUS_IRQ line</description>
	<access>write-only</access>
	<bitRange>[15:0]</bitRange>
	
