irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>VBUS_IRQ_MASK_REG</name>
	<description>IRQ masking</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields>
	<field>
	<name>VBUS_IRQ_EN_RISE</name>
	<description>Setting this bit to '1' enables VBUS_IRQ generation when the VBUS starts to ramp above threshold</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>VBUS_IRQ_EN_FALL</name>
	<description>Setting this bit to '1' enables VBUS_IRQ generation when the VBUS starts to fall below threshold</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CRG_XTAL</name>
	<version>1.0</version>
	<description>CRG_XTAL registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50010000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>148</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>CLK_FREQ_TRIM_REG</name>
	<description>Xtal frequency trimming register.</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x2bfafd70</resetValue>
	<resetMask>0x3fffffff</resetMask>
	<fields>
	<field>
	<name>XTAL32M_START</name>
	<description>Xtal frequency trimming register - START phase of startup
0x2BF = lowest frequency (high load capacitance)
0x000 = highest frequency (low load capacitance)
Cload = 2.25p + 6.2p * XTAL32M_TRIM/0x2BF</description>
	<access>read-write</access>
	<bitRange>[29:20]</bitRange>
	
</field><field>
	<name>XTAL32M_RAMP</name>
	<description>Xtal frequency trimming register - RAMP phase of startup.
0x2BF = lowest frequency (high load capacitance)
0x000 = highest frequency (low load capacitance)
Cload = 2.25p + 6.2p * XTAL32M_TRIM/0x2BF</description>
	<access>read-write</access>
	<bitRange>[19:10]</bitRange>
	
</field><field>
	<name>XTAL32M_TRIM</name>
	<description>Xtal frequency trimming register.
0x2BF = lowest frequency (high load capacitance)
0x000 = highest frequency (low load capacitance)
Cload = 2.25p + 6.2p * XTAL32M_TRIM/0x2BF</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PLL96M_CTRL1_REG</name>
	<description>System PLL control register 2</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00006860</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL96M_USE_OOP_TRIGGER</name>
	<description>Prevents an out-of-phase trigger in case the DCO runs too slow or too fast.
Default: 0</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>PLL96M_DELTA_COUNT</name>
	<description>Affects settling during a DCO "too_slow" or "too_fast" event.
Default: 8</description>
	<access>read-write</access>
	<bitRange>[12:8]</bitRange>
	
</field><field>
	<name>PLL96M_DELTA_SEARCH</name>
	<description>Affects settling during a DCO "too_slow" or "too_fast" event.
Default: 4</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>PLL96M_ENABLE</name>
	<description>0: Power down
1: PLL on </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PLL96M_CTRL2_REG</name>
	<description>System PLL control register 1</description>
	<addressOffset>0x00000084</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000c00</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL96M_INIT_DELAY</name>
	<description>Initial delay of the DCO timer.
0: minimum
223: default
447: maximum</description>
	<access>read-write</access>
	<bitRange>[15:7]</bitRange>
	
</field><field>
	<name>PLL96M_INIT_DUTYCYCLE</name>
	<description>Initial duty-cycle adjustment value.
0: 42.5%
32: 50%
63: 57.5%)</description>
	<access>read-write</access>
	<bitRange>[6:1]</bitRange>
	
</field><field>
	<name>PLL96M_EXTERN_CMD</name>
	<description>0: Normal operation, 1: Override DCO delay with PL96M_INIT_DELAY</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PLL96M_CTRL3_REG</name>
	<description>System PLL control register 3</description>
	<addressOffset>0x00000088</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00008070</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL96M_TST_CLK_INV</name>
	<description>Invert test data clock polarity.
Default: 0</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>PLL96M_CDEL1</name>
	<description>Phase-detector digital delay correction.
Default: 3</description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	
</field><field>
	<name>PLL96M_BIAS</name>
	<description>Bias adjustment.
Default: 8</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>PLL96M_PHD_CD2</name>
	<description>Phase-detector delay coefficient 2.
Default: 8</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>PLL96M_PHD_CD1</name>
	<description>Phase-detector delay coefficient 1.
Default: 5</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PLL96M_STATUS1_REG</name>
	<description>System PLL status register 1</description>
	<addressOffset>0x0000008c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x07ffffff</resetMask>
	<fields>
	<field>
	<name>PLL96M_OK</name>
	<description>1: The PLL is producing a valid 96MHz output clock.</description>
	<access>read-only</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>PLL96M_ERROR_LOSAT</name>
	<description>1: PLL out-of-range: low saturation error</description>
	<access>read-only</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>PLL96M_ERROR_HISAT</name>
	<description>1: PLL out-of-range: high saturation error</description>
	<access>read-only</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>PLL96M_FINE_CNT</name>
	<description>Counts subsequent cycles that the controller is in fine-adjust algorithm (high number predicts low jitter)</description>
	<access>read-only</access>
	<bitRange>[23:18]</bitRange>
	
</field><field>
	<name>PLL96M_TRIGGER</name>
	<description>Trigger output that can restart the RC oscillator</description>
	<access>read-only</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>PLL96M_EFF_DELAY</name>
	<description>Effective delay value</description>
	<access>read-only</access>
	<bitRange>[16:8]</bitRange>
	
</field><field>
	<name>PLL96M_DELTA_DELAY</name>
	<description>Delta delay correction value</description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
