irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>PLL96M_STATUS2_REG</name>
	<description>System PLL status register 2</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL96M_CNT96</name>
	<description>Number of internal oscillator pulses within 4 periods of the reference clock (should be 12)</description>
	<access>read-only</access>
	<bitRange>[10:5]</bitRange>
	
</field><field>
	<name>PLL96M_PHD_OUT</name>
	<description>Phase-detector output vector.
0x00: UP3 - Clock is too slow
0x01: UP2
0x03: UP1
0x07: DN1
0x0F: DN2
0x1F: DN3 - Clock is too fast</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PLL_SYS_CTRL1_REG</name>
	<description>System PLL control register 1.</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00006860</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL_SEL_MIN_CUR_INT</name>
	<description>0: VCO current read from min_current &lt;5:0&gt;,
1: VCO current is internally determined with a calibration algoritm.</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>PLL_DEL_SEL</name>
	<description>PLL manual delay value for Phase Frequency Detector.
0: 0.493
1: 0.814
2: 1.13 ns &lt;- default
3: 1.44 ns </description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	
</field><field>
	<name>PLL_PRE_DIV</name>
	<description>PLL input divider (1: Indicates divide by 2).</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>PLL_N_DIV</name>
	<description>PLL loop divider N (x means divide by x, 0 means divide by 1) </description>
	<access>read-write</access>
	<bitRange>[10:4]</bitRange>
	
</field><field>
	<name>LDO_PLL_VREF_HOLD</name>
	<description>0: Indicates that the reference input is tracked,
1: Indicates that the reference input is sampled.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>LDO_PLL_ENABLE</name>
	<description>0: LDO PLL off,
1: LDO PLL on.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>PLL_EN</name>
	<description>0: Power down
1: PLL on </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PLL_SYS_CTRL2_REG</name>
	<description>System PLL control register 2.</description>
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000c00</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PLL_RECALIB</name>
	<description>Recalibrate</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>PLL_START_DEL</name>
	<description>Programmable delay time for the loop filter voltage preset value. After PLL_EN is set, the loopfilter precharge resistors are disabled after this delay time. One LSB is 48 ns </description>
	<access>read-write</access>
	<bitRange>[14:10]</bitRange>
	
</field><field>
	<name>PLL_ICP_SEL</name>
	<description>PLL charge pump current select
One LSB is 5uA. </description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PLL_SYS_CTRL3_REG</name>
	<description>System PLL control register 3.</description>
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00008070</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PLL_LOCK_DET_RES_CNT</name>
	<description>Lock measurement time in &lt;tbd&gt; clock cycle of xx usec. After this period PLL_LOCK_FINE is calculated based on the difference of the M and N counted pulses in that period. If PLL_LOCK_FINE is still 0, the lock state machine restarts until PLL_LOCK_FINE gets 1
0: &lt;tbd&gt; usec
7: &lt;tbd&gt; usec </description>
	<access>read-write</access>
	<bitRange>[15:13]</bitRange>
	
</field><field>
	<name>PLL_SEL_N_DIV_TEST</name>
	<description>Select test mode for loop divider N.
Maps PLL_N_DIV input on pins &lt;tbd&gt; and divider output on pin &lt;tbd&gt; </description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PLL_CHANGE</name>
	<description>0: normal value
1: reverse charge pump up/down signals </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>PLL_OPEN_LOOP</name>
	<description>1: set to open loop to termine max frequency </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>PLL_TEST_VCTR</name>
	<description>1: map loopfilter voltage on external pin &lt;tbd&gt; </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>PLL_MIN_CURRENT</name>
	<description>VCO current trimming.</description>
	<access>read-write</access>
	<bitRange>[6:1]</bitRange>
	
</field><field>
	<name>PLL_DIS_LOOPFILT</name>
	<description>1: disable PLL internal loop filter </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PLL_SYS_STATUS_REG</name>
	<description>System PLL status register.</description>
	<addressOffset>0x00000070</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>LDO_PLL_OK</name>
	<description>1: Indicates that LDO PLL is in regulation.</description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>PLL_CALIBRATION_END</name>
	<description>Indicates that calibration has finished.</description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>PLL_BEST_MIN_CUR</name>
	<description>Calibrated VCO current.</description>
	<access>read-only</access>
	<bitRange>[10:5]</bitRange>
	
</field><field>
	<name>PLL_LOCK_FINE</name>
	<description>1: PLL locked </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
