irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>TRIM_CTRL_REG</name>
	<description>Control trimming of the XTAL32M</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000522</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>XTAL_SETTLE_N</name>
	<description>Designates that the XTAL can be safely used as the CPU clock. When XTAL_CLK_CNT reases this value, the signal XTAL_SETTLE_READY will be set</description>
	<access>read-write</access>
	<bitRange>[13:8]</bitRange>
	
</field><field>
	<name>XTAL_TRIM_SELECT</name>
	<description>Select which source controls the XTAL trimming
0b00: xtal counter. Starts XTAL32M_START_REG, after COUNT_N * 32 xtal pulses trim is changed to CLK_FREQ_TRIM_REG.
0b01: xtal OK filter. Starts with XTAL32_START_REG, when xtal is ramping is changed to CLK_FREQ_TRIM_REG
0b10: statically forced off. Only uses CLK_FREQ_TRIM_REG.
0b11: xtal OK filter, 2 stage. Starts with XTAL32_START_REG switches to XTAL16M_RAMP_REG when sw1='1', and switches to CLK_FREQ_TRIM_REG when sw2='1'.</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>XTAL_COUNT_N</name>
	<description>Defines the number of XTAL cycles to be counted, before the xtal trimming is applied, in steps of 32.
0x01: 32
0x02: 64
0x3f:2016 </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>XTAL32M_CTRL0_REG</name>
	<description>Control register for XTAL32M</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0b80e6b4</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>XTAL32M_VARICAP_CX_ENABLE</name>
	<description>Enables shunt-cap compensation capacitance (OSF BOOST)</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>XTAL32M_DXTAL_SYSPLL_ENABLE</name>
	<description>Enables DXTAL for the system PLL.</description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_MAX_CURRENT</name>
	<description>Forces maximum current in output device.</description>
	<access>read-write</access>
	<bitRange>[29:29]</bitRange>
	
</field><field>
	<name>XTAL32M_SW_DELAY</name>
	<description>Set sw1 delay (sample output current comparator) and sw2 mask delay time.
0x0: 128 us
0x1: 64 us
0x2: 32 us
0x3: 16 us
0x4: 8 us
0x5: 4 us
0x6: 2 us
0x7: 1 us</description>
	<access>read-write</access>
	<bitRange>[28:26]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_AMPREG_SIG_SELECT</name>
	<description>1: Select xtal_n for amplitude control.
0: Select xtal_p for amplitude control.</description>
	<access>read-write</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_FREQ_TRIM_SW2_AMP</name>
	<description>Set threshold for amplitude control ok detection.
0x0: Highest current delta
0x6: Lowest current delta
0x7: off</description>
	<access>read-write</access>
	<bitRange>[24:22]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_AMPL_CTRL_DISABLE</name>
	<description>Disable amplitude-control block.</description>
	<access>read-write</access>
	<bitRange>[21:21]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_AMPL_TRIM</name>
	<description>Core amplitude trim setting.
0x0: min amplitude
...
...
0x5: max amplitude
0x6 &amp; 0x7 are equal to 0x3.</description>
	<access>read-write</access>
	<bitRange>[20:18]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_CUR_SET</name>
	<description>Core current trim setting.
0x0: min current
...
0x3: default current
...
0x6 max amplitude
0x7 is equal to 0x3.</description>
	<access>read-write</access>
	<bitRange>[17:15]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_GM_CURRENT</name>
	<description>Enables biassing of the main oscillator output device</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_SYNC_MODE_ENABLE</name>
	<description>Enable synchronization of the crystal startup.</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_HOLD_AMPREG</name>
	<description>Put amplitude detector in HOLD mode.</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>XTAL32M_SPIKE_FLT_DISABLE</name>
	<description>Disable DXTAL spike filter.</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>XTAL32M_RFCLK_ENABLE</name>
	<description>If set, rfclk is allowed to be enabled</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>XTAL32M_HOLD_AMPREG_RADIO_GATE</name>
	<description>Allow radio_enable to put amplitude detector in HOLD mode.</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>XTAL32M_DIFFBUF_BYPASS</name>
	<description>Bypass comparator to use external input.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>XTAL32M_BIAS_SAH_RADIO_GATE</name>
	<description>Allow radio_enable to put the bias block in HOLD mode.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>XTAL32M_BIAS_SAH_HOLD</name>
	<description>Put the bias block in HOLD mode.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>XTAL32M_LDO_VREF_HOLD</name>
	<description>Put the LDO in HOLD mode.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>XTAL32M_DCBLOCK_ENABLE</name>
	<description>Eable dcblock circuit.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_CALIBRATE</name>
	<description>Request an RC-oscillator calibration. If set, calibration will be started after xtal startup.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>XTAL32M_DXTAL_ENABLE</name>
	<description>Enable DXTAL - signal is gated by state-machine. Bit should always be set.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_XTAL_DRIVE</name>
	<description>Enable drive of crystal by RCOSC, needed for fast startup</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>XTAL32M_CXCOMP_ENABLE</name>
	<description>Enable the shunt-capacitance compensation amplifier circuit (OSF BOOST).</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
