irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>XTAL32M_CTRL1_REG</name>
	<description>Control register for XTAL32M</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7503e8a4</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>XTAL32M_STARTUP_TDISCHARGE</name>
	<description>Discharge time.
0x0: disable
0x1: 8 us
0x2: 4 us
0x3: 2 us
0x4: 1 us
0x5: 1/2 us
0x6: 1/8 us
0x7: 1/32 us</description>
	<access>read-write</access>
	<bitRange>[30:28]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_XTAL_DISCHARGE</name>
	<description>Software control mode: discharges the crystal.</description>
	<access>read-write</access>
	<bitRange>[27:27]</bitRange>
	
</field><field>
	<name>XTAL32M_STARTUP_TSETTLE</name>
	<description>Settle time.
0x0: 16 us
0x1: 8 us
0x2: 4 us
0x3: 2 us
0x4: 1 us
0x5: 1/2 us
0x6: 1/4 us
0x7: 1/8 us</description>
	<access>read-write</access>
	<bitRange>[26:24]</bitRange>
	
</field><field>
	<name>XTAL32M_XTAL_ENABLE</name>
	<description>Enable xtal (startup) or enable xtal block (software control mode) - testing only, to enable xtal, use PDC.</description>
	<access>read-write</access>
	<bitRange>[23:23]</bitRange>
	
</field><field>
	<name>XTAL32M_STARTUP_TDRIVE_LSB</name>
	<description>LSB part of the sequence drive time. From 0 to 32us with steps of 1/32us.</description>
	<access>read-write</access>
	<bitRange>[22:13]</bitRange>
	
</field><field>
	<name>XTAL32M_DRIVE_CYCLES</name>
	<description>Number of sequences to drive at startup.</description>
	<access>read-write</access>
	<bitRange>[12:8]</bitRange>
	
</field><field>
	<name>XTAL32M_STARTUP_TDRIVE</name>
	<description>Drive time of the sequence.
0x0: 32 us
0x1: 16 us
0x2: 8 us
0x3: 4 us
0x4: 2 us
0x5: 1 us
0x6: 1/2 us
0x7: 1/4 us</description>
	<access>read-write</access>
	<bitRange>[7:5]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_SYNC_DELAY_TRIM</name>
	<description>Synchronization mode delay trim..</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>XTAL32M_CTRL2_REG</name>
	<description>Control register for XTAL32M</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x001e4007</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>XTAL32M_FREQ_DET_OFFSET</name>
	<description>Add extra offset to the frequency-detector result to compensate for mismatch between actual startup and frequency-detector result.</description>
	<access>read-write</access>
	<bitRange>[31:24]</bitRange>
	
</field><field>
	<name>XTAL32M_FREQ_DET_LEN</name>
	<description>Length of frequency detection, used during calibration of the RC-oscillator.
0x0 :256us M=8k
0x1: 128us M=4k
0x2: 64us M=2k
0x3: 32us M=1k</description>
	<access>read-write</access>
	<bitRange>[23:22]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_TRIM_SNS</name>
	<description>Trim sensitivity used during calibration of the RC-oscillator.set to 122*M/128</description>
	<access>read-write</access>
	<bitRange>[21:14]</bitRange>
	
</field><field>
	<name>XTAL32M_CXCOMP_PHI_TRIM</name>
	<description>Phase correction for cxcomp circuit.</description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	
</field><field>
	<name>XTAL32M_CXCOMP_TRIM_CAP</name>
	<description>Size of shunt capacitance compensation cap</description>
	<access>read-write</access>
	<bitRange>[11:3]</bitRange>
	
</field><field>
	<name>XTAL32M_CXCOMP_BIAS_TRIM</name>
	<description>Bias current of the cxcomp circuit.
0x0: minimum current (disabled)
...
0x7: maximum current</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>XTAL32M_CTRL3_REG</name>
	<description>Control register for XTAL32M</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00096255</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>XTAL32M_LDO_ENABLE</name>
	<description>Force enable LDO.</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_TRIM_STROBE</name>
	<description>Force RC-oscillator trim setting.</description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	
</field><field>
	<name>XTAL32M_OSC_TRIM_CAP_BIAS</name>
	<description>0: Connect varicap bottom-plate to top-plate with resistor.
1: Connect varicap bottom-plate to fixed bias voltage.</description>
	<access>read-write</access>
	<bitRange>[29:29]</bitRange>
	
</field><field>
	<name>XTAL32M_SW1_OUT</name>
	<description>Software control mode: force SW1 signal (xtaltrim delay between RAMP and START)</description>
	<access>read-write</access>
	<bitRange>[28:28]</bitRange>
	
</field><field>
	<name>XTAL32M_DCBLOCK_LV_MODE</name>
	<description>Low-voltage cmp testmode.</description>
	<access>read-write</access>
	<bitRange>[27:27]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC2DXTAL</name>
	<description>Use RC-oscillator output for DXTAL.</description>
	<access>read-write</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_I2V_TO_TESTBUS_10X</name>
	<description>Increase the gain of the core amplifier testmode.</description>
	<access>read-write</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_I2V_TO_TESTBUS</name>
	<description>Enable the core amplifier testmode.</description>
	<access>read-write</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>XTAL32M_OSC_TRIM_OPEN_DISABLE</name>
	<description>Varicap testmode, feedback resistors are disabled.</description>
	<access>read-write</access>
	<bitRange>[23:23]</bitRange>
	
</field><field>
	<name>XTAL32M_FREQ_DET_START</name>
	<description>Force start frequency detector.</description>
	<access>read-write</access>
	<bitRange>[22:22]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_ENABLE</name>
	<description>Force Enable RC-oscillator</description>
	<access>read-write</access>
	<bitRange>[21:21]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_SYNC_FORCE</name>
	<description>Force a the RCOSC synchronization: driver startst.</description>
	<access>read-write</access>
	<bitRange>[20:20]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_SYNC_GATE</name>
	<description>Gate the RC-oscillator (and driver), when signal falls, the RC-oscillator will startup synchronized.</description>
	<access>read-write</access>
	<bitRange>[19:19]</bitRange>
	
</field><field>
	<name>XTAL32M_SW_CTRL_MODE</name>
	<description>Enable all the software overrides, the state-machine will remain in IDLE.</description>
	<access>read-write</access>
	<bitRange>[18:18]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_BAND_SELECT</name>
	<description>Set RCOSC band select - apply with RCOSC_TRIM_STROBE</description>
	<access>read-write</access>
	<bitRange>[17:14]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_TRIM</name>
	<description>Set RCOSC trim (fine) - apply with RCOSC_TRIM_STROBE</description>
	<access>read-write</access>
	<bitRange>[13:4]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_AMPREG_NULLBIAS</name>
	<description>Keep bias in ampdet alive, even when there is a large drive.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_FB_ENABLE</name>
	<description>Enable feedback resistors on core amplifier output.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_SAMPLE_AMPL_CTRL</name>
	<description>Software control mode: Sample voltage on amplitude detector.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_AMPREG_SIG_ENABLE</name>
	<description>Software override to enable amplitude detector input signal.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
