irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>XTAL32M_CTRL4_REG</name>
	<description>Control register for XTAL32M</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>XTAL32M_CORE_CUR_PTAT</name>
	<description>Adds PTAT current contribution to the ampltude regulator (TEST ONLY)</description>
	<access>read-write</access>
	<bitRange>[23:23]</bitRange>
	
</field><field>
	<name>XTAL32M_CORE_CUR_NTAT_DIS</name>
	<description>Disables the (NTAT) current contribution in the ampltidue regulator</description>
	<access>read-write</access>
	<bitRange>[22:22]</bitRange>
	
</field><field>
	<name>XTAL32M_SYNC_DELAY_TEST_INT</name>
	<description>When in SYNC_DELAY_TESTMODE, use RCOSC output instead of DXTAL. This allows for the xtal pins not to be in the delay-loop (ATE test)</description>
	<access>read-write</access>
	<bitRange>[21:21]</bitRange>
	
</field><field>
	<name>XTAL32M_TAMPDET_BLANK_SETTLE</name>
	<description>Amplitude regulator settling time - allows for amplitude regulator to settle to its value when drive sequence is completed.</description>
	<access>read-write</access>
	<bitRange>[20:19]</bitRange>
	
</field><field>
	<name>XTAL32M_TAMPDET_BLANK</name>
	<description>Blanking time for amplitude regulator when GM_CURRENT is set by state-machine</description>
	<access>read-write</access>
	<bitRange>[18:17]</bitRange>
	
</field><field>
	<name>XTAL32M_AMPDET_BLANK</name>
	<description>Enable blaning of the amplitude regulator - blanks glitch from the enabling of GM_CURRENT</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>XTAL32M_CXCOMP_ENABLE_GATE</name>
	<description>Use CXCOMP circuit only at startup. Enable signal of CXCOMP circuit is gated with trim_ready signal.</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>XTAL32M_RST_N_XTAL</name>
	<description>Software control mode - releases reset of control logic in xtal</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>XTAL32M_LDO_VREF_SELECT</name>
	<description>0: Select 1.2V reference input for the LDO.
1: Select vref2 as reference input for the LDO.</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>XTAL32M_RFCLK_ADPLL_TO_GPIO</name>
	<description>Enable test output of rfclk_adpll to GPIO</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>XTAL32M_RFCLK_ADC_TO_GPIO</name>
	<description>Enable test output of rfclk_adc to GPIO</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>XTAL32M_CXCOMP_TEST_P_TO_TB</name>
	<description>Shuntcap measurement testmode: Put xtal_p on testbus&lt;0&gt;.</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>XTAL32M_CXCOMP_TEST_N_TO_TB</name>
	<description>Shuntcap measurement testmode: Put xtal_n on testbus&lt;0&gt;.</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>XTAL32M_CXCOMP_TEST_CTRL</name>
	<description>Shuntcap measurement testmode: Control cxcomp test switches.
Bit 0: x_lo - discharge nodes
Bit 1: p_hi - charge xtal_p to 1.2V
Bit 2: n_hi - charge xtal_n to 1.2V
Bit 3: cx_hi - charge CX node to 1.2V</description>
	<access>read-write</access>
	<bitRange>[8:5]</bitRange>
	
</field><field>
	<name>XTAL32M_SW2_MASK</name>
	<description>Software control mode: mask signal for sw2 (amplitude comparator output)</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>XTAL32M_VARICAP_TEST_ENABLE</name>
	<description>Enable varicap test outputs to DCORE.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>XTAL32M_CXCOMP_TEST</name>
	<description>Enable the testmode of the cxcomp circuit.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>XTAL32M_LDO_TEST</name>
	<description>Put the LDO output voltage on testbus&lt;0&gt;.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>XTAL32M_SYNC_DELAY_TEST</name>
	<description>Enable the calibration/testmode of the sync circuit.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>XTAL32M_STAT0_REG</name>
	<description>Status register for XTAL32M</description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>XTAL32M_RCOSC_BAND_SELECT_STAT</name>
	<description>Currently selected band.</description>
	<access>read-only</access>
	<bitRange>[31:28]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_TRIM_STAT</name>
	<description>Current trim result.</description>
	<access>read-only</access>
	<bitRange>[27:18]</bitRange>
	
</field><field>
	<name>XTAL32M_LDO_OK</name>
	<description>XTAL32M LDO output voltage is: 0: not OK, 1: OK </description>
	<access>read-only</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>XTAL32M_SW2_IN</name>
	<description>Amplitude comparator output signal.</description>
	<access>read-only</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_CALIBRATION_DONE</name>
	<description>Signals that the calibration phase has been completed.</description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>XTAL32M_FREQ_DET_END</name>
	<description>Signals that frequency detection has been completed.</description>
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>XTAL32M_FREQ_DET_OUT</name>
	<description>Result of frequency detection.</description>
	<access>read-only</access>
	<bitRange>[13:0]</bitRange>
	
