irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>XTAL32M_STAT1_REG</name>
	<description>Status register for XTAL32M</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>XTAL32M_XTAL_OVERLOAD</name>
	<description>Indicates xtal is (heavily) overloaded</description>
	<access>read-only</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_SYNC_FORCE_STAT</name>
	<description>Value of the synchronization force signal from the calibration or startup state-machine.</description>
	<access>read-only</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_SYNC_GATE_STAT</name>
	<description>Value of the gate force signal from the calibration and startup state-machine.</description>
	<access>read-only</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>XTAL32M_RCOSC_XTAL_DRIVE_STAT</name>
	<description>Value of the XTAL drive signal from the startup state-machine.</description>
	<access>read-only</access>
	<bitRange>[23:23]</bitRange>
	
</field><field>
	<name>XTAL32M_SM_TIMER</name>
	<description>Current value of the counter used for various timeouts.</description>
	<access>read-only</access>
	<bitRange>[22:11]</bitRange>
	
</field><field>
	<name>XTAL32M_TRIM_READY</name>
	<description>Signals that the crystal-oscillator trimming has been completed.</description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>XTAL32M_SETTLE_READY</name>
	<description>Signals that the crystal has been settled.</description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>XTAL32M_SW2_OUT</name>
	<description>Masked sw2_in signal.</description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>XTAL32M_CAL_STATE</name>
	<description>Current state of the calibration state-machine.
0x0: CAL_DELAY - Delay for the biasing to settle
0x1: CAL_SYNC - Enables synchronization circuit
0x2: CAL_FREQDET - Enables the frequency detector
0x3: CAL_OFFSET - Evaluate OFFSET trimresult
0x4: CAL_MULT_SHIFT - Evaluate (delta) trimresult
0x5: CAL_TRIM - Generate new trimvalue
0x6: CAL_BAND_UPDWN - Delay after band change
0x7: CAL_END - Calibration ended
0x8: CAL_IDLE - Calibration IDLE (default state)
</description>
	<access>read-only</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>XTAL32M_STATE</name>
	<description>Current state of the startup state-machine.
0x0: XTAL_WAIT_LDO - Allow for setling of the biasing
0x1: XTAL_DRIVE - Crystal is driven by rcosc
0x2: XTAL_DISCHARGE - Discharge loadcaps
0x3: XTAL_SETTLE - Allows for settling of the xtal signal
0x4: XTAL_SYNC - Restart RCOSC, and synchronize
0x5: XTAL_OVERLOAD_DETECT - amplitude detection mode by overload bit
0x6: XTAL_OVERLOAD_BLANK_SETTLE - setling delay for amplitude regulator when drive ends
0x7: XTAL_OVERLOAD_BLANK - blank glitch from enabling gm_current
0x8: XTAL_RUN - Startup ended
0x9: XTAL_SAMPLE - Delay before sample amplitude control
0xa: XTAL_SW2_MASK - Delay for masked SW2
0xb: XTAL_IDLE - Idle state (default)</description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>XTAL32M_TRSTAT_REG</name>
	<description>Read back value of current XTAL trimming</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>XTAL32M_TRSTAT</name>
	<description>Reads value of the current XTAL trimming</description>
	<access>read-only</access>
	<bitRange>[14:0]</bitRange>
	
</field></fields>
</register><register>
	<name>XTALRDY_CTRL_REG</name>
	<description>Control register for XTALRDY IRQ</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000100</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>XTALRDY_CLK_SEL</name>
	<description>XTALRDY IRQ timer clock selection:
0: 32KHz
1: 256kHz</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>XTALRDY_CNT</name>
	<description>Number of 32kHz or 256kHz cycles between the crystal is enabled, and the XTALRDY_IRQ is fired. Frequency set by XTALRDY_CLK_SEL.
0x00: no interrupt
</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>XTALRDY_STAT_REG</name>
	<description>Difference between XTAL_OK and XTALRDY_IRQ in LP clock cycles</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>XTALRDY_COUNT</name>
	<description>Current value of IRQ counter</description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>XTALRDY_STAT</name>
	<description>Value of IRQ counter when trimming is switched from RAMP to TRIM</description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DCDC</name>
	<version>1.0</version>
	<description>DCDC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000300</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>60</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>DCDC_CTRL1_REG</name>
	<description>DCDC First Control Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DCDC_SH_ENABLE</name>
	<description>Enables sample and hold circuit in output comparators.</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>DCDC_STARTUP_DELAY</name>
	<description>Delay between turning bias on and converter becoming active
0 - 31 us, 1 us step size</description>
	<access>read-write</access>
	<bitRange>[30:26]</bitRange>
	
</field><field>
	<name>DCDC_IDLE_MAX_FAST_DOWNRAMP</name>
	<description>Maximum output idle time for fast current limit downramping.
0 - 7875 ns, 125 ns step size</description>
	<access>read-write</access>
	<bitRange>[25:20]</bitRange>
	
</field><field>
	<name>DCDC_SW_TIMEOUT</name>
	<description>P and N switch timeout, if switch is closed longer than this a timeout is generated and the FSM is forced to the next state
Writing 0 disables timeout functionality
62.5 - 1937.5 ns, 62.5 ns step size</description>
	<access>read-write</access>
	<bitRange>[19:15]</bitRange>
	
</field><field>
	<name>DCDC_FAST_STARTUP</name>
	<description>Set current limit to maximum during initial startup</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>DCDC_MAN_LV_MODE</name>
	<description>Manually activates low voltage settings</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>DCDC_AUTO_LV_MODE</name>
	<description>Switches to low voltage settings when battery voltage drops below 2.5 V</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>DCDC_IDLE_CLK_DIV</name>
	<description>Idle Clock Divider
00 = 2
01 = 4
10 = 8
11 = 16</description>
	<access>read-write</access>
	<bitRange>[11:10]</bitRange>
	
</field><field>
	<name>DCDC_PRIORITY</name>
	<description>Charge priority register (4x 2 bit ID)
Charge sequence is [1:0] &gt; [3:2] &gt; [5:4] &gt; [7:6]
V14 = 00
V18 = 01
VDD = 10
V18P = 11</description>
	<access>read-write</access>
	<bitRange>[9:2]</bitRange>
	
</field><field>
	<name>DCDC_FW_ENABLE</name>
	<description>Freewheel switch enable</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DCDC_ENABLE</name>
	<description>Enable setting for DCDC converter</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
