irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>DCDC_CTRL2_REG</name>
	<description>DCDC Second Control Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x080888df</resetValue>
	<resetMask>0x0fffffff</resetMask>
	<fields>
	<field>
	<name>DCDC_V_NOK_CNT_MAX</name>
	<description>Maximum number of V_NOK events on an output before V_AVAILABLE is reset</description>
	<access>read-write</access>
	<bitRange>[27:24]</bitRange>
	
</field><field>
	<name>DCDC_N_COMP_TRIM_MAN</name>
	<description>Enables manual trimming for N side comparator</description>
	<access>read-write</access>
	<bitRange>[22:22]</bitRange>
	
</field><field>
	<name>DCDC_N_COMP_TRIM_VAL</name>
	<description>Manual trim value for N side comparator
Signed magnitude representation
011111 = +13 mV
000000 = 100000 = -22 mV
111111 = -56 mV</description>
	<access>read-write</access>
	<bitRange>[21:16]</bitRange>
	
</field><field>
	<name>DCDC_TIMEOUT_IRQ_TRIG</name>
	<description>Number of timeout events before timeout interrupt is generated</description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	
</field><field>
	<name>DCDC_TIMEOUT_IRQ_RES</name>
	<description>Number of successive non-timed out charge events required to clear timeout event counter</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>DCDC_SLOPE_CONTROL</name>
	<description>Sets strength of N and P switch drivers</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>DCDC_VBTSTRP_TRIM</name>
	<description>Trim bootstrap voltage
V = 1.6 V + 100 mV * N</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>DCDC_LSSUP_TRIM</name>
	<description>Trim low side supply voltage
V = 2 V + 300 mV * N</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>DCDC_HSGND_TRIM</name>
	<description>Trim high side ground
V = VBAT - (2 V + 400 mV * N)</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_IRQ_CLEAR_REG</name>
	<description>DCDC Interrupt Clear Register</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>DCDC_LOW_VBAT_IRQ_CLEAR</name>
	<description>Clear low VBAT interrupt</description>
	<access>write-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DCDC_V18P_TIMEOUT_IRQ_CLEAR</name>
	<description>Clear V18P timeout interrupt</description>
	<access>write-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DCDC_VDD_TIMEOUT_IRQ_CLEAR</name>
	<description>Clear VDD timeout interrupt</description>
	<access>write-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DCDC_V18_TIMEOUT_IRQ_CLEAR</name>
	<description>Clear V18 timeout interrupt</description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DCDC_V14_TIMEOUT_IRQ_CLEAR</name>
	<description>Clear V14 timeout interrupt</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_IRQ_MASK_REG</name>
	<description>DCDC Interrupt Clear Register</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>DCDC_LOW_VBAT_IRQ_MASK</name>
	<description>Mask low VBAT interrupt</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DCDC_V18P_TIMEOUT_IRQ_MASK</name>
	<description>Mask V18P timeout interrupt</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DCDC_VDD_TIMEOUT_IRQ_MASK</name>
	<description>Mask VDD timeout interrupt</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DCDC_V18_TIMEOUT_IRQ_MASK</name>
	<description>Mask V18 timeout interrupt</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DCDC_V14_TIMEOUT_IRQ_MASK</name>
	<description>Mask V14 timeout interrupt</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_IRQ_STATUS_REG</name>
	<description>DCDC Interrupt Status Register</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>DCDC_LOW_VBAT_IRQ_STATUS</name>
	<description>Low VBAT detector triggered (battery voltage below 2.5 V)</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DCDC_V18P_TIMEOUT_IRQ_STATUS</name>
	<description>Timeout occured on V18P output</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DCDC_VDD_TIMEOUT_IRQ_STATUS</name>
	<description>Timeout occured on VDD output</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DCDC_V18_TIMEOUT_IRQ_STATUS</name>
	<description>Timeout occured on V18 output</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DCDC_V14_TIMEOUT_IRQ_STATUS</name>
	<description>Timeout occured on V14 output</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_STATUS1_REG</name>
	<description>DCDC First Status Register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0fffffff</resetMask>
	<fields>
	<field>
	<name>DCDC_V18P_AVAILABLE</name>
	<description>Indicates whether V18P is available
Requires that converter is enabled, output is enabled and V_OK has occured. Reset when too many V_NOK events have occured.</description>
	<access>read-only</access>
	<bitRange>[27:27]</bitRange>
	
</field><field>
	<name>DCDC_VDD_AVAILABLE</name>
	<description>Indicates whether VDD is available
Requires that converter is enabled, output is enabled and V_OK has occured. Reset when too many V_NOK events have occured.</description>
	<access>read-only</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>DCDC_V18_AVAILABLE</name>
	<description>Indicates whether V18 is available
Requires that converter is enabled, output is enabled and V_OK has occured. Reset when too many V_NOK events have occured.</description>
	<access>read-only</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>DCDC_V14_AVAILABLE</name>
	<description>Indicates whether V14 is available
Requires that converter is enabled, output is enabled and V_OK has occured. Reset when too many V_NOK events have occured.</description>
	<access>read-only</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>DCDC_V18P_COMP_OK</name>
	<description>OK output of V18P comparator</description>
	<access>read-only</access>
	<bitRange>[23:23]</bitRange>
	
</field><field>
	<name>DCDC_VDD_COMP_OK</name>
	<description>OK output of VDD comparator</description>
	<access>read-only</access>
	<bitRange>[22:22]</bitRange>
	
</field><field>
	<name>DCDC_V18_COMP_OK</name>
	<description>OK output of V18 comparator</description>
	<access>read-only</access>
	<bitRange>[21:21]</bitRange>
	
</field><field>
	<name>DCDC_V14_COMP_OK</name>
	<description>OK output of V14 comparator</description>
	<access>read-only</access>
	<bitRange>[20:20]</bitRange>
	
</field><field>
	<name>DCDC_V18P_COMP_NOK</name>
	<description>NOK output of V18P comparator</description>
	<access>read-only</access>
	<bitRange>[19:19]</bitRange>
	
</field><field>
	<name>DCDC_VDD_COMP_NOK</name>
	<description>NOK output of VDD comparator</description>
	<access>read-only</access>
	<bitRange>[18:18]</bitRange>
	
</field><field>
	<name>DCDC_V18_COMP_NOK</name>
	<description>NOK output of V18 comparator</description>
	<access>read-only</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>DCDC_V14_COMP_NOK</name>
	<description>NOK output of V14 comparator</description>
	<access>read-only</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>DCDC_N_COMP_P</name>
	<description>DCDC N side dynamic comparator P output</description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>DCDC_N_COMP_N</name>
	<description>DCDC N side dynamic comparator N output</description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>DCDC_P_COMP</name>
	<description>DCDC P side continuous time comparator output</description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>DCDC_N_COMP</name>
	<description>DCDC N side continuous time comparator output</description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>DCDC_LV_MODE</name>
	<description>Indicates if the converter is in low battery voltage mode</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DCDC_V18P_SW_STATE</name>
	<description>DCDC state machine V18P output</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DCDC_VDD_SW_STATE</name>
	<description>DCDC state machine VDD output</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DCDC_V18_SW_STATE</name>
	<description>DCDC state machine V18 output</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DCDC_V14_SW_STATE</name>
	<description>DCDC state machine V14 output</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DCDC_N_SW_STATE</name>
	<description>DCDC state machine NSW output</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DCDC_P_SW_STATE</name>
	<description>DCDC state machine PSW output</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DCDC_STARTUP_COMPLETE</name>
	<description>Indicates if the converter is enabled and the startup counter has expired (internal biasing settled)</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
