irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>DCDC_STATUS2_REG</name>
	<description>DCDC Second Status Register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00840084</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields>
	<field>
	<name>DCDC_V18P_CUR_LIM</name>
	<description>Actual V18P current limit</description>
	<access>read-only</access>
	<bitRange>[25:21]</bitRange>
	
</field><field>
	<name>DCDC_V18_CUR_LIM</name>
	<description>Actual V18 current limit</description>
	<access>read-only</access>
	<bitRange>[20:16]</bitRange>
	
</field><field>
	<name>DCDC_VDD_CUR_LIM</name>
	<description>Actual VDD current limit</description>
	<access>read-only</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>DCDC_V14_CUR_LIM</name>
	<description>Actual V14 current limit</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_STATUS3_REG</name>
	<description>DCDC Third Status Register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x02080208</resetValue>
	<resetMask>0x0fffffff</resetMask>
	<fields>
	<field>
	<name>DCDC_V18P_N_COMP_TRIM</name>
	<description>Actual V18P N side comparator trim value</description>
	<access>read-only</access>
	<bitRange>[27:22]</bitRange>
	
</field><field>
	<name>DCDC_V18_N_COMP_TRIM</name>
	<description>Actual V18 N side comparator trim value</description>
	<access>read-only</access>
	<bitRange>[21:16]</bitRange>
	
</field><field>
	<name>DCDC_VDD_N_COMP_TRIM</name>
	<description>Actual VDD N side comparator trim value</description>
	<access>read-only</access>
	<bitRange>[11:6]</bitRange>
	
</field><field>
	<name>DCDC_V14_N_COMP_TRIM</name>
	<description>Actual V14 N side comparator trim value</description>
	<access>read-only</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_STATUS4_REG</name>
	<description>DCDC Fourth Status Register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>DCDC_CHARGE_REG_3</name>
	<description>Charge register position 3</description>
	<access>read-only</access>
	<bitRange>[11:9]</bitRange>
	
</field><field>
	<name>DCDC_CHARGE_REG_2</name>
	<description>Charge register position 2</description>
	<access>read-only</access>
	<bitRange>[8:6]</bitRange>
	
</field><field>
	<name>DCDC_CHARGE_REG_1</name>
	<description>Charge register position 1</description>
	<access>read-only</access>
	<bitRange>[5:3]</bitRange>
	
</field><field>
	<name>DCDC_CHARGE_REG_0</name>
	<description>Charge register position 0</description>
	<access>read-only</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_TEST_REG</name>
	<description>DCDC Test Register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x1fffffff</resetMask>
	<fields>
	<field>
	<name>DCDC_TEST_OUT</name>
	<description>Selects which register appears on the test mode pins
0 = None
1 = DCDC_STATUS_1 High Bits
2 = DCDC_STATUS_1 Low Bits
3 = DCDC_STATUS_2 High Bits
4 = DCDC_STATUS_2 Low Bits
5 = DCDC_STATUS_3 High Bits
6 = DCDC_STATUS_3 Low Bits
7 = DCDC_STATUS_4 Low Bits
8-F = Reserved</description>
	<access>read-write</access>
	<bitRange>[28:25]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_CUR_LIM_VAL</name>
	<description>Current limit setting when forced</description>
	<access>read-write</access>
	<bitRange>[24:20]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_COMP_CLK_VAL</name>
	<description>Sets clock lines for the output comparators</description>
	<access>read-write</access>
	<bitRange>[19:16]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_CUR_LIM</name>
	<description>Force output current setting</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_COMP_CLK</name>
	<description>Disables automatic comparator clock, clock lines values based on FORCE_COMP_CLK_VAL</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>DCDC_OUTPUT_MON</name>
	<description>Output monitor switch (connect to ADC)
000 = None
001 = VDD
010 = V18
011 = V14
100 = V18P
101 = V18F
110 = None
111 = None</description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	
</field><field>
	<name>DCDC_ANA_TEST</name>
	<description>Analog test bus
000 = None
001 = High side ground
010 = Low side supply
011 = Bootstrap voltage
100 = 1.0 V buffer output
101 = None
110 = None
111 = None</description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_IDLE</name>
	<description>Force idle mode</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_V18P_SW</name>
	<description>Force V18P switch on</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_VDD_SW</name>
	<description>Force VDD switch on</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_V18_SW</name>
	<description>Force V18 switch on</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_V14_SW</name>
	<description>Force V14 switch on</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_FW_SW</name>
	<description>Force FW switch on</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_N_SW</name>
	<description>Force N switch on</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DCDC_FORCE_P_SW</name>
	<description>Force P switch on</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
