irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>DCDC_V14_REG</name>
	<description>DCDC V14 Control Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x034c4243</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DCDC_V14_FAST_RAMPING</name>
	<description>Fast current ramping (improves response time at the cost of more ripple)</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>DCDC_V14_TRIM</name>
	<description>Output voltage trim
Steps of 25 mV</description>
	<access>read-write</access>
	<bitRange>[27:27]</bitRange>
	
</field><field>
	<name>DCDC_V14_CUR_LIM_MAX_HV</name>
	<description>Mximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[26:22]</bitRange>
	
</field><field>
	<name>DCDC_V14_CUR_LIM_MAX_LV</name>
	<description>Maximum current limit (low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[21:17]</bitRange>
	
</field><field>
	<name>DCDC_V14_CUR_LIM_MIN</name>
	<description>Minimum current limit
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[16:12]</bitRange>
	
</field><field>
	<name>DCDC_V14_IDLE_HYST</name>
	<description>Idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<access>read-write</access>
	<bitRange>[11:7]</bitRange>
	
</field><field>
	<name>DCDC_V14_IDLE_MIN</name>
	<description>Minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<access>read-write</access>
	<bitRange>[6:2]</bitRange>
	
</field><field>
	<name>DCDC_V14_ENABLE_HV</name>
	<description>Output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DCDC_V14_ENABLE_LV</name>
	<description>Output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_V18P_REG</name>
	<description>DCDC V18P Control Register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x47fe4242</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DCDC_V18P_FAST_RAMPING</name>
	<description>Fast current ramping (improves response time at the cost of more ripple)</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>DCDC_V18P_TRIM</name>
	<description>Output voltage trim
Steps of 25 mV</description>
	<access>read-write</access>
	<bitRange>[30:27]</bitRange>
	
</field><field>
	<name>DCDC_V18P_CUR_LIM_MAX_HV</name>
	<description>Maximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[26:22]</bitRange>
	
</field><field>
	<name>DCDC_V18P_CUR_LIM_MAX_LV</name>
	<description>Maximum current limit (low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[21:17]</bitRange>
	
</field><field>
	<name>DCDC_V18P_CUR_LIM_MIN</name>
	<description>Minimum current limit
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[16:12]</bitRange>
	
</field><field>
	<name>DCDC_V18P_IDLE_HYST</name>
	<description>Idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<access>read-write</access>
	<bitRange>[11:7]</bitRange>
	
</field><field>
	<name>DCDC_V18P_IDLE_MIN</name>
	<description>Minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<access>read-write</access>
	<bitRange>[6:2]</bitRange>
	
</field><field>
	<name>DCDC_V18P_ENABLE_HV</name>
	<description>Output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DCDC_V18P_ENABLE_LV</name>
	<description>Output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DCDC_V18_REG</name>
	<description>DCDC V18 Control Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x47fe4242</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DCDC_V18_FAST_RAMPING</name>
	<description>Fast current ramping (improves response time at the cost of more ripple)</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>DCDC_V18_TRIM</name>
	<description>Output voltage trim
Steps of 25 mV</description>
	<access>read-write</access>
	<bitRange>[30:27]</bitRange>
	
</field><field>
	<name>DCDC_V18_CUR_LIM_MAX_HV</name>
	<description>Maximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[26:22]</bitRange>
	
</field><field>
	<name>DCDC_V18_CUR_LIM_MAX_LV</name>
	<description>Maximum current limit (low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[21:17]</bitRange>
	
</field><field>
	<name>DCDC_V18_CUR_LIM_MIN</name>
	<description>Minimum current limit
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[16:12]</bitRange>
	
</field><field>
	<name>DCDC_V18_IDLE_HYST</name>
	<description>Idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<access>read-write</access>
	<bitRange>[11:7]</bitRange>
	
</field><field>
	<name>DCDC_V18_IDLE_MIN</name>
	<description>Minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<access>read-write</access>
	<bitRange>[6:2]</bitRange>
	
</field><field>
	<name>DCDC_V18_ENABLE_HV</name>
	<description>Output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DCDC_V18_ENABLE_LV</name>
	<description>Output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
