irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>DCDC_VDD_REG</name>
	<description>DCDC VDD Control Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x261a4243</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DCDC_VDD_FAST_RAMPING</name>
	<description>Fast current ramping (improves response time at the cost of more ripple)</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>DCDC_VDD_TRIM</name>
	<description>Output voltage trim
Steps of 25 mV</description>
	<access>read-write</access>
	<bitRange>[29:27]</bitRange>
	
</field><field>
	<name>DCDC_VDD_CUR_LIM_MAX_HV</name>
	<description>Maximum current limit (high battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[26:22]</bitRange>
	
</field><field>
	<name>DCDC_VDD_CUR_LIM_MAX_LV</name>
	<description>Maximum current limit (low battery voltage mode)
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[21:17]</bitRange>
	
</field><field>
	<name>DCDC_VDD_CUR_LIM_MIN</name>
	<description>Minimum current limit
I = 30 mA * (1 + N)</description>
	<access>read-write</access>
	<bitRange>[16:12]</bitRange>
	
</field><field>
	<name>DCDC_VDD_IDLE_HYST</name>
	<description>Idle time hysteresis
0 - 3875 ns, 125 ns step size
IDLE_MAX = IDLE_MIN + IDLE_HYST
Maximum idle time before decreasing CUR_LIM</description>
	<access>read-write</access>
	<bitRange>[11:7]</bitRange>
	
</field><field>
	<name>DCDC_VDD_IDLE_MIN</name>
	<description>Minimum idle time
0 - 3875 ns, 125 ns step size
Minimum idle time, CUR_LIM is increased if this limit is not reached</description>
	<access>read-write</access>
	<bitRange>[6:2]</bitRange>
	
</field><field>
	<name>DCDC_VDD_ENABLE_HV</name>
	<description>Output enable (high battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DCDC_VDD_ENABLE_LV</name>
	<description>Output enable (low battery voltage mode)
0 = Disabled
1 = Enabled</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DEM</name>
	<version>1.0</version>
	<description>DEM registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x40021000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>112</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>RF_AFC_CTRL_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000015</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>AFC_SYNCF_DIRECT</name>
	<description>Allow the AFC state to directly transit from IDLE or PREAMBLE detection state to LOCKED state</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>APD_MODE</name>
	<description>Select the mode in the APD FSM:

xx1: Enable the transition from the ADDRESSDETECTION state to the IDLE state when the signal detection is low
x1x: Enable the reset of the AFC filter when the FSM is in the IDLE state
1xx: Enable the time out in the PREAMBLEDETECTION state. The FSM returns to the IDLE state after the time out.</description>
	<access>read-write</access>
	<bitRange>[8:6]</bitRange>
	
</field><field>
	<name>PAD_MODE</name>
	<description>The PAD mode in BLE mode

00: No limits
01: Wrapping
10: Saturate to zero
11: 580 legacy mode</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>AFC_MODE</name>
	<description>Choose the method to use for AFC tracking during the slot
Description TBD </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_AGC_CTRL1_REG</name>
	
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0056d50d</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields>
	<field>
	<name>AGC_MODE</name>
	<description>Choose the method to use for AGC evaluation
Description TBD </description>
	<access>read-write</access>
	<bitRange>[22:21]</bitRange>
	
</field><field>
	<name>AGC_TH2_HIGH</name>
	<description>AGC treshhold for FASTAGC mode... switch up number of steps defined by FASTAGC_STEPS</description>
	<access>read-write</access>
	<bitRange>[20:14]</bitRange>
	
</field><field>
	<name>AGC_TH_HIGH</name>
	<description>AGC hysteresis high threshold (switch up one AGC_SETTING_R step when exceeding this level) </description>
	<access>read-write</access>
	<bitRange>[13:7]</bitRange>
	
</field><field>
	<name>AGC_TH_LOW</name>
	<description>AGC hysteresis low threshold (switch down one AGC_SETTING_R step when dropping below this level) </description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_AGC_CTRL2_REG</name>
	
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0040168d</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields>
	<field>
	<name>EN_FRZ_GAIN</name>
	<description>'0': AGC always active'1': Freeze gain after Access Address detection </description>
	<access>read-write</access>
	<bitRange>[22:22]</bitRange>
	
</field><field>
	<name>AGCSETTING_WR</name>
	<description>Fixed AGC setting to be used to configure LNA, VGA1 and VGA2 when AGCSETTING_SEL = 1
0: Highest gain as configured in RF_AGC_LUT_01_REG
1: Lower gain as configured in RF_AGC_LUT_01_REG
2: Still lower gain as configured in RF_AGC_LUT_23_REG
...
9-F: Lowest gain as configured in RF_AGC_LUT_89_REG </description>
	<access>read-write</access>
	<bitRange>[21:18]</bitRange>
	
</field><field>
	<name>AGCSETTING_SEL</name>
	<description>LNA, VGA1 and VGA2 gains
'0': controlled by AGC'1': provided manually through AGCSETTING_WR </description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>AGC_MAX_SETTING</name>
	<description>Maximum AGC setting used from AGC LUT</description>
	<access>read-write</access>
	<bitRange>[12:9]</bitRange>
	
</field><field>
	<name>AGCDEC_WAIT</name>
	<description>Wait time for settling after a single AGC step decrease (increasing gain)

