irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
0x0 - 1us
0x1 - 2us
0x2 - 3us
0x3 - 4us

</description>
	<access>read-write</access>
	<bitRange>[8:7]</bitRange>
	
</field><field>
	<name>AGCINC_WAIT</name>
	<description>Wait time for settling after a single AGC step increase (decreasing gain)

0x0 - 1us
0x1 - 2us
0x2 - 3us
0x3 - 4us
</description>
	<access>read-write</access>
	<bitRange>[6:5]</bitRange>
	
</field><field>
	<name>FASTAGC_WAIT</name>
	<description>Wait time for signal settling after fast AGC toggling

0x0 - 1us
0x1 - 2us
0x2 - 3us
0x3 - 4us

</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>FASTAGC_STEPS</name>
	<description>Define the number of 6dB steps that is used when the RSSI level
is larger than AGC_TH2_HIGH

0x0 - 1 step
0x1 - 2 steps
0x2 - 3 steps
0x3 - 4 steps

</description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	
</field><field>
	<name>FASTAGC_EN</name>
	<description>Allow the AGC to decrease the gain by multiple steps of 6dB

</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_AGC_LUT_0123_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x23030201</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LNA_GAIN3</name>
	<description>LNA gain setting while in AGC setting 3</description>
	<access>read-write</access>
	<bitRange>[31:29]</bitRange>
	
</field><field>
	<name>VGA1_GAIN3</name>
	<description>VGA1 gain setting while in AGC setting 3</description>
	<access>read-write</access>
	<bitRange>[28:26]</bitRange>
	
</field><field>
	<name>VGA2_GAIN3</name>
	<description>VGA2 gain setting while in AGC setting 3</description>
	<access>read-write</access>
	<bitRange>[25:24]</bitRange>
	
</field><field>
	<name>LNA_GAIN2</name>
	<description>LNA gain setting while in AGC setting 2</description>
	<access>read-write</access>
	<bitRange>[23:21]</bitRange>
	
</field><field>
	<name>VGA1_GAIN2</name>
	<description>VGA1 gain setting while in AGC setting 2</description>
	<access>read-write</access>
	<bitRange>[20:18]</bitRange>
	
</field><field>
	<name>VGA2_GAIN2</name>
	<description>VGA2 gain setting while in AGC setting 2</description>
	<access>read-write</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>LNA_GAIN1</name>
	<description>LNA gain setting while in AGC setting 0 </description>
	<access>read-write</access>
	<bitRange>[15:13]</bitRange>
	
</field><field>
	<name>VGA1_GAIN1</name>
	<description>VGA1 gain setting while in AGC setting 1 </description>
	<access>read-write</access>
	<bitRange>[12:10]</bitRange>
	
</field><field>
	<name>VGA2_GAIN1</name>
	<description>VGA2 gain setting while in AGC setting 1 </description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>LNA_GAIN0</name>
	<description>LNA gain setting while in AGC setting 0 </description>
	<access>read-write</access>
	<bitRange>[7:5]</bitRange>
	
</field><field>
	<name>VGA1_GAIN0</name>
	<description>VGA1 gain setting while in AGC setting 0 </description>
	<access>read-write</access>
	<bitRange>[4:2]</bitRange>
	
</field><field>
	<name>VGA2_GAIN0</name>
	<description>VGA2 gain setting while in AGC setting 0 </description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_AGC_LUT_4567_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x332f2b27</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LNA_GAIN7</name>
	<description>LNA gain setting while in AGC setting 7</description>
	<access>read-write</access>
	<bitRange>[31:29]</bitRange>
	
</field><field>
	<name>VGA1_GAIN7</name>
	<description>VGA1 gain setting while in AGC setting 7</description>
	<access>read-write</access>
	<bitRange>[28:26]</bitRange>
	
</field><field>
	<name>VGA2_GAIN7</name>
	<description>VGA2 gain setting while in AGC setting 7</description>
	<access>read-write</access>
	<bitRange>[25:24]</bitRange>
	
</field><field>
	<name>LNA_GAIN6</name>
	<description>LNA gain setting while in AGC setting 6</description>
	<access>read-write</access>
	<bitRange>[23:21]</bitRange>
	
</field><field>
	<name>VGA1_GAIN6</name>
	<description>VGA1 gain setting while in AGC setting 6</description>
	<access>read-write</access>
	<bitRange>[20:18]</bitRange>
	
</field><field>
	<name>VGA2_GAIN6</name>
	<description>VGA2 gain setting while in AGC setting 6</description>
	<access>read-write</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>LNA_GAIN5</name>
	<description>LNA gain setting while in AGC setting 5</description>
	<access>read-write</access>
	<bitRange>[15:13]</bitRange>
	
</field><field>
	<name>VGA1_GAIN5</name>
	<description>VGA1 gain setting while in AGC setting 5</description>
	<access>read-write</access>
	<bitRange>[12:10]</bitRange>
	
</field><field>
	<name>VGA2_GAIN5</name>
	<description>VGA2 gain setting while in AGC setting 5</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>LNA_GAIN4</name>
	<description>LNA gain setting while in AGC setting 4</description>
	<access>read-write</access>
	<bitRange>[7:5]</bitRange>
	
</field><field>
	<name>VGA1_GAIN4</name>
	<description>VGA1 gain setting while in AGC setting 4</description>
	<access>read-write</access>
	<bitRange>[4:2]</bitRange>
	
</field><field>
	<name>VGA2_GAIN4</name>
	<description>VGA2 gain setting while in AGC setting 4</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_AGC_LUT_89AB_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LNA_GAIN11</name>
	<description>LNA gain setting while in AGC setting 11</description>
	<access>read-write</access>
	<bitRange>[31:29]</bitRange>
	
</field><field>
	<name>VGA1_GAIN11</name>
	<description>VGA1 gain setting while in AGC setting 11</description>
	<access>read-write</access>
	<bitRange>[28:26]</bitRange>
	
</field><field>
	<name>VGA2_GAIN11</name>
	<description>VGA2 gain setting while in AGC setting 11</description>
	<access>read-write</access>
	<bitRange>[25:24]</bitRange>
	
</field><field>
	<name>LNA_GAIN10</name>
	<description>LNA gain setting while in AGC setting 10</description>
	<access>read-write</access>
	<bitRange>[23:21]</bitRange>
	
</field><field>
	<name>VGA1_GAIN10</name>
	<description>VGA1 Gain setting while in AGC setting 10</description>
	<access>read-write</access>
	<bitRange>[20:18]</bitRange>
	
</field><field>
	<name>VGA2_GAIN10</name>
	<description>VGA2 gain setting while in AGC setting 10</description>
	<access>read-write</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>LNA_GAIN9</name>
	<description>LNA gain setting while in AGC setting 9 </description>
	<access>read-write</access>
	<bitRange>[15:13]</bitRange>
	
</field><field>
	<name>VGA1_GAIN9</name>
	<description>VGA1 gain setting while in AGC setting 9 </description>
	<access>read-write</access>
	<bitRange>[12:10]</bitRange>
	
</field><field>
	<name>VGA2_GAIN9</name>
	<description>VGA2 gain setting while in AGC setting 9 </description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>LNA_GAIN8</name>
	<description>LNA gain setting while in AGC setting 8 </description>
	<access>read-write</access>
	<bitRange>[7:5]</bitRange>
	
</field><field>
	<name>VGA1_GAIN8</name>
	<description>VGA1 gain setting while in AGC setting 8 </description>
	<access>read-write</access>
	<bitRange>[4:2]</bitRange>
	
</field><field>
	<name>VGA2_GAIN8</name>
	<description>VGA2 gain setting while in AGC setting 8 </description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
