irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RF_AGC_LUT_CDEF_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x01022243</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LNA_GAIN15</name>
	<description>LNA gain setting while in AGC setting 15</description>
	<access>read-write</access>
	<bitRange>[31:29]</bitRange>
	
</field><field>
	<name>VGA1_GAIN15</name>
	<description>VGA1 gain setting while in AGC setting 15</description>
	<access>read-write</access>
	<bitRange>[28:26]</bitRange>
	
</field><field>
	<name>VGA2_GAIN15</name>
	<description>VGA2 gain setting while in AGC setting 15</description>
	<access>read-write</access>
	<bitRange>[25:24]</bitRange>
	
</field><field>
	<name>LNA_GAIN14</name>
	<description>LNA gain setting while in AGC setting 14</description>
	<access>read-write</access>
	<bitRange>[23:21]</bitRange>
	
</field><field>
	<name>VGA1_GAIN14</name>
	<description>VGA1 Gain setting while in AGC setting 14</description>
	<access>read-write</access>
	<bitRange>[20:18]</bitRange>
	
</field><field>
	<name>VGA2_GAIN14</name>
	<description>VGA2 gain setting while in AGC setting 14</description>
	<access>read-write</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>LNA_GAIN13</name>
	<description>LNA gain setting while in AGC setting 13</description>
	<access>read-write</access>
	<bitRange>[15:13]</bitRange>
	
</field><field>
	<name>VGA1_GAIN13</name>
	<description>VGA1 gain setting while in AGC setting 13</description>
	<access>read-write</access>
	<bitRange>[12:10]</bitRange>
	
</field><field>
	<name>VGA2_GAIN13</name>
	<description>VGA2 gain setting while in AGC setting 13</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>LNA_GAIN12</name>
	<description>LNA gain setting while in AGC setting 12</description>
	<access>read-write</access>
	<bitRange>[7:5]</bitRange>
	
</field><field>
	<name>VGA1_GAIN12</name>
	<description>VGA1 gain setting while in AGC setting 12</description>
	<access>read-write</access>
	<bitRange>[4:2]</bitRange>
	
</field><field>
	<name>VGA2_GAIN12</name>
	<description>VGA2 gain setting while in AGC setting 12</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_AGC_RESULT_REG</name>
	
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>AGCSETTING_RD</name>
	<description>AGC setting as automatically selected in receive mode to configure LNA, VGA1 and VGA2
0: Highest gain as configured in RF_AGC_LUT_01_REG
1: Lower gain as configured in RF_AGC_LUT_01_REG
2: Still lower gain as configured in RF_AGC_LUT_23_REG
...
9-F: Lowest gain as configured in RF_AGC_LUT_89_REG </description>
	<access>read-only</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>AFC_RD</name>
	<description>Frequency offset estimation (in 2s complement) with a resolution of approximately 5 kHz. </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL1_REG</name>
	
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00020100</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>DCOFFSET_Q_WR</name>
	<description>DC offset compensation value in Q channel valid when DCOFFSET_SEL = 1 </description>
	<access>read-write</access>
	<bitRange>[17:9]</bitRange>
	
</field><field>
	<name>DCOFFSET_I_WR</name>
	<description>DC offset compensation value in I channel valid when DCOFFSET_SEL = 1 </description>
	<access>read-write</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL2_REG</name>
	
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00f86696</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields>
	<field>
	<name>DCOC_RESULT_LNAGAIN345_LUT</name>
	<description>DCoffset result used for LNA gain settings 3 4 and 5. </description>
	<access>read-write</access>
	<bitRange>[23:22]</bitRange>
	
</field><field>
	<name>DCOC_RESULT_LNAGAIN2_LUT</name>
	<description>DCoffset result used for LNA gain setting 2</description>
	<access>read-write</access>
	<bitRange>[21:20]</bitRange>
	
</field><field>
	<name>DCOC_RESULT_LNAGAIN1_LUT</name>
	<description>DCoffset result used for LNA gain setting 1</description>
	<access>read-write</access>
	<bitRange>[19:18]</bitRange>
	
</field><field>
	<name>DCOC_RESULT_LNAGAIN0_LUT</name>
	<description>DCoffset result used for LNA gain setting 0</description>
	<access>read-write</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>DCPAR_DCF_EN</name>
	<description>Use a DCF to start the partial DC offset calibration.
</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>DCPAR_MULT_STEPS_EN</name>
	<description>Enable the partial DCOC calibration with multiple gain settings.
When not set, the partial calibration is the same as in 680BA.

</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>DCPARNGAIN</name>
	<description>Number of gain settings for the partial DC offset calibration</description>
	<access>read-write</access>
	<bitRange>[13:11]</bitRange>
	
</field><field>
	<name>DCVGA1SCALE_EN</name>
	<description>Enable the DC offset scaling with the VGA1 gain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>DCPARCAL_INIT</name>
	<description>Select the inital value used for the partial DC offset calibration.

0: The DC offset from the previous packet
1: The DC offset found with the full DC offset calibration
2: Start from the mid value. </description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>DCFULLNGAIN</name>
	<description>Number of gain settings for the full DC offset calibration </description>
	<access>read-write</access>
	<bitRange>[7:5]</bitRange>
	
</field><field>
	<name>DCNSTEP</name>
	<description>Number of the steps per.gain setting for the full or partial DC offset calibrations </description>
	<access>read-write</access>
	<bitRange>[4:2]</bitRange>
	
</field><field>
	<name>DCPARCAL_EN</name>
	<description>Enable flag for the partial DC offset calibration The calbration is executed when the demodulator is enabled. 
When the bit DCPAR_DCF_EN is set, the enabling is started by the DCF. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DCOFFSET_SEL</name>
	<description>'0': Normal operation
'1': Use the manual DC offset compensation values from RF_DC_OFFSET_CTRL1_REG </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
