irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL3_REG</name>
	
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000dce4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCBETA_Q</name>
	<description>Quadrature feedback gain for the DC offset calibration </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>DCBETA_I</name>
	<description>Inphase feedback gain for the DC offset calibration </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DC_OFFSET_CTRL4_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00009210</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DCAGCSETTING_FULL3</name>
	<description>AGC setting for forth last the gain step for the full DC offset calibration </description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	
</field><field>
	<name>DCAGCSETTING_FULL2</name>
	<description>AGC setting for third last the gain step for the full DC offset calibration </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>DCAGCSETTING_FULL1</name>
	<description>AGC setting for second last the gain step for the full DC offset calibration </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>DCAGCSETTING_FULL0</name>
	<description>AGC setting for last the gain step for the full DC offset calibration </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DC_OFFSET_FULL_RES_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>DCOFFSET_Q_RD</name>
	<description>Stored DC offset FULL calibration result value of the Q channel. </description>
	<access>read-only</access>
	<bitRange>[17:9]</bitRange>
	
</field><field>
	<name>DCOFFSET_I_RD</name>
	<description>Stored DC offset FULL calibration result value of the Q channel. </description>
	<access>read-only</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DC_OFFSET_MPAR_RES0_REG</name>
	
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>DCOFFSET_Q_RD</name>
	<description>DC offset calibration result value of the last step of the multiple partial calibration. (Q channel) </description>
	<access>read-only</access>
	<bitRange>[17:9]</bitRange>
	
</field><field>
	<name>DCOFFSET_I_RD</name>
	<description>DC offset calibration result value of the last step of the multiple partial calibration. (I channel) </description>
	<access>read-only</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DC_OFFSET_MPAR_RES1_REG</name>
	
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>DCOFFSET_Q_RD</name>
	<description>DC offset calibration result value of the (last step -1) of the multiple partial calibration. (Q channel) </description>
	<access>read-only</access>
	<bitRange>[17:9]</bitRange>
	
</field><field>
	<name>DCOFFSET_I_RD</name>
	<description>DC offset calibration result value of the (last step -1) of the multiple partial calibration. (I channel) </description>
	<access>read-only</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DC_OFFSET_MPAR_RES2_REG</name>
	
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>DCOFFSET_Q_RD</name>
	<description>DC offset calibration result value of the (last step -2) of the multiple partial calibration. (Q channel) </description>
	<access>read-only</access>
	<bitRange>[17:9]</bitRange>
	
</field><field>
	<name>DCOFFSET_I_RD</name>
	<description>DC offset calibration result value of the (last step-2) of the multiple partial calibration. (I channel) </description>
	<access>read-only</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DC_OFFSET_MPAR_RES3_REG</name>
	
	<addressOffset>0x0000006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>DCOFFSET_Q_RD</name>
	<description>DC offset calibration result value of the (last step -3) of the multiple partial calibration. (Q channel) </description>
	<access>read-only</access>
	<bitRange>[17:9]</bitRange>
	
</field><field>
	<name>DCOFFSET_I_RD</name>
	<description>DC offset calibration result value of the (last step-3) of the multiple partial calibration. (I channel) </description>
	<access>read-only</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DC_OFFSET_RESULT_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>DCOFFSET_Q_RD</name>
	<description>DC offset compensation value in Q channel valid when DCOFFSET_SEL = 0</description>
	<access>read-only</access>
	<bitRange>[17:9]</bitRange>
	
</field><field>
	<name>DCOFFSET_I_RD</name>
	<description>DC offset compensation value in I channel valid when DCOFFSET_SEL = 0. </description>
	<access>read-only</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DEM_ATTR_REG</name>
	
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00e4a19f</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>ADDR_TIMEOUT_X2</name>
	<description>Program the Address Time Out when AFC is in MAC ADDRESS correlation state

