irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
0x0 - short time (32us in 2Mbit mode and 64us in 1Mbit mode)
0x1 - long time (64us in 2Mbit mode and 128us in 1Mbit mode)

</description>
	<access>read-write</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>RFADC_CLK_PHASE</name>
	<description>Select the phase of the RFADC clock</description>
	<access>read-write</access>
	<bitRange>[23:22]</bitRange>
	
</field><field>
	<name>DEM_16M_CLK_SET</name>
	<description>Sets the Demodulator clock speed. Automatically the RFADC speed is adjusted as well. </description>
	<access>read-write</access>
	<bitRange>[21:21]</bitRange>
	
</field><field>
	<name>RSSI_TH</name>
	<description>RSSI threshold for the packet detection </description>
	<access>read-write</access>
	<bitRange>[20:15]</bitRange>
	
</field><field>
	<name>DCPOLE</name>
	<description>Set the frequency of the DC offset highpass filter.

The frequency is different when the demodulator is used with 8MHz or 16MHz clock. 

For 8MHz clock:

0x0 - 100kHz
0x1 - 50kHz
0x2 - 150kHz
0x3 - N/A </description>
	<access>read-write</access>
	<bitRange>[14:13]</bitRange>
	
</field><field>
	<name>DCOC_SPEED8M_EN</name>
	<description>Set the preferred Clock Speed for the DC Offset Block </description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>AGC_SPEED8M_EN</name>
	<description>Set the preferred clock speed for the AGC block</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>DEM_SET_DEC2N</name>
	<description>Bit to select of the deimate by 2 is enabled.

0 - Decimation by 2 is enabled, use for 1Mbit mode with 16MHz clock
1 - Decimation by 2 disabled, use for 2Mbit mode with 16MHz clock or 1Mbit mode with 8MHz clock

</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>MATCH0101_TH</name>
	<description>Threshold for the 0101 pattern matching </description>
	<access>read-write</access>
	<bitRange>[9:6]</bitRange>
	
</field><field>
	<name>DEM_HSI_POL</name>
	<description>Invert "frequency" polarity of the demodulator </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>RXDATA_INV</name>
	<description>'0': Normal operation
'1': Invert the polarity of the received bits</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>AFC_POLE2</name>
	<description>Set the frequency of the AFC pole (Highpass filter) that is used before and after preamble detection.
The absolute frequency is different for 1Mbit and 2Mbit mode.

3dB cut off frequency in 1Mbit mode.

0 - NA
1 - 78Hz
2 - 156Hz
3 - 311Hz

In 2Mbit mode, the frequency doubles.
</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>AFC_POLE1</name>
	<description>Set the frequency of the AFC pole (Highpass filter) that is used during preamble detection.
The absolute frequency is different for 1Mbit and 2Mbit mode.

3dB cut off frequency in 1Mbit mode.

0 - NA
1 - 1.3kHz 
2 - 2.5kHz
3 - 5.1kHz

In 2Mbit mode, the frequency doubles.


</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DEM_CTRL_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>IQ_TO_GPIO_EN</name>
	<description>Enable the IQ data output for exposed radio mode. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>AGC_USE_GPIO_IN</name>
	<description>Select to use the GPIO input as AGC setting.
To be used with FPGA platform
</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>CIC_EN</name>
	<description>Enable the CIC filter in the decimator. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>IQCORR_EN</name>
	<description>Enable the IQ mismatch correction

The correction coefficients are define in the RF_DEM_IQCORRECT_REG register</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>BLE_DDC_EN</name>
	<description>Enable the digital conversion in BLE mode</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>EQUAL_EN</name>
	<description>Enable the equalizer in the demodulator </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DEM_IQCORRECT_REG</name>
	
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>IQCORR_ALPHA</name>
	
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>IQCORR_BETA</name>
	
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_DEM_TESTMODE_REG</name>
	
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>DEM_TESTMODE</name>
	<description>Defines the demodulator test mode

DEM_TESTMODE[3:0] selects the data mapped on the testbus (see demodulator documentation for details.

The upper and lower 16-bits test data are swapped when DEM_TESTMODE[4] is set.

The lower 16-bits are assigned to the test bus when DEM_TESTMODE[5] is set. The input test bus is copied when DEM_TESTMODE[6] is reset.

The upper 16-bits are assigned to the test bus when DEM_TESTMODE[6] is set. The input test bus is copied with DEM_TESTMODE[7] is reset.

The trigger is slected with DEM_TESTMODE[8:7]
00: dem_en
01: Signal detected
10: Set with the rising edge of DEM_EN and reset with the rising edge of SYNC_FOUND_P
11: Set with the rising edge of SYNC_FOUND_P and reset with the falling edge of DEM_EN


