irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
DEM_TESTMODE[9] is reserved</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PAD_CNT_CTRL_REG</name>
	
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00004000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>PAD_CLEAR_COUNT</name>
	
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>PAD_NEG_LIMIT</name>
	
	<access>read-write</access>
	<bitRange>[13:7]</bitRange>
	
</field><field>
	<name>PAD_POS_LIMIT</name>
	
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PAD_CNT_RESULT_REG</name>
	
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>PAD_NEG_CNT_RD</name>
	
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>PAD_POS_CNT_RD</name>
	
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_RSSI_COMP_CTRL_REG</name>
	
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00088888</resetValue>
	<resetMask>0x000fffff</resetMask>
	<fields>
	<field>
	<name>RSSI_COMP4</name>
	<description>RSSI compensation value for LNA gain setting 3
Coding identical to RSSI_COMP0</description>
	<access>read-write</access>
	<bitRange>[19:16]</bitRange>
	
</field><field>
	<name>RSSI_COMP3</name>
	<description>RSSI compensation value for LNA gain setting 3
Coding identical to RSSI_COMP0</description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	
</field><field>
	<name>RSSI_COMP2</name>
	<description>RSSI compensation value for LNA gain setting 2
Coding identical to RSSI_COMP0</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>RSSI_COMP1</name>
	<description>RSSI compensation value for LNA gain setting 1
'0x0': -8
'0x1': -7
'0x2': -6
'0x3': -5
'0x4': -4
'0x5': -3
'0x6': -2
'0x7': -1
'0x8': 0 (reset)
'0x9': 1
'0xA': 2
'0xB': 3
'0xC': 4
'0xD': 5
'0xE': 6
'0xF': 7 </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>RSSI_COMP0</name>
	<description>RSSI compensation value for LNA gain setting 00
'0x0': -8
'0x1': -7
'0x2': -6
'0x3': -5
'0x4': -4
'0x5': -3
'0x6': -2
'0x7': -1
'0x8': 0 (reset)
'0x9': 1
'0xA': 2
'0xB': 3
'0xC': 4
'0xD': 5
'0xE': 6
'0xF': 7 </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_RSSI_RESULT_REG</name>
	
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000fffff</resetMask>
	<fields>
	<field>
	<name>RSSI_AVG_RD</name>
	<description>RSSI value measured in averaging mode in continuous RX mode (used for LNA selectivity calibration) </description>
	<access>read-only</access>
	<bitRange>[19:10]</bitRange>
	
</field><field>
	<name>RSSI_LATCHED_RD</name>
	<description>Averaged RSSI value latched with the Sync Found Pulse.
Value is resetted when the demodulator is started and when stopped.
</description>
	<access>read-only</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DMA</name>
	<version>1.0</version>
	<description>DMA registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50040800</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>272</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>DMA0_A_START_REG</name>
	<description>Start address A of DMA channel 0</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DMA0_A_START</name>
	<description>Source start address</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DMA0_B_START_REG</name>
	<description>Start address B of DMA channel 0</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>DMA0_B_START</name>
	<description>Destination start address</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DMA0_CTRL_REG</name>
	<description>Control register for the DMA channel 0</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00008000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>BUS_ERROR_DETECT</name>
	<description>0 = Ignores bus error response from the AHB bus, so DMA continues normally.
1 = Detects the bus response and tracks any bus error may occur during the transfer. If a bus error is detected, the channel completes the current read-write DMA cycle (either in burst or single transfers mode) and then closes the transfer, de-asserting DMA_ON bit automatically.
It is noted that the respective bus error detection status bit of DMA_INT_STATUS_REG is automatically cleared as soon as the channel is switched-on again, in order to perform a new transfer.</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>BURST_MODE</name>
	<description>Enables the DMA read/write bursts, according to the following configuration:
00 = Bursts are disabled
01 = Bursts of 4 are enabled
10 = Bursts of 8 are enabled
11 = Reserved</description>
	<access>read-write</access>
	<bitRange>[14:13]</bitRange>
	
</field><field>
	<name>REQ_SENSE</name>
	<description>0 = DMA operates with level-sensitive peripheral requests (default)
1 = DMA operates with (positive) edge-sensitive peripheral requests</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>DMA_INIT</name>
	<description>0 = DMA performs copy A1 to B1, A2 to B2, etc ...
1 = DMA performs copy of A1 to B1, B2, etc ...
This feature is useful for memory initialization to any value. Thus, BINC must be set to '1', while AINC is don't care, as only one fetch from A is done. This process cannot be interrupted by other DMA channels. It is also noted that DMA_INIT should not be used when DREQ_MODE='1'.</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>DMA_IDLE</name>
	<description>0 = Blocking mode, the DMA performs a fast back-to-back copy, disabling bus access for any bus master with lower priority.
1 = Interrupting mode, the DMA inserts a wait cycle after each store allowing the CPU to steal cycles or cache to perform a burst read. If DREQ_MODE='1', DMA_IDLE is don't care.</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>DMA_PRIO</name>
	<description>The priority level determines which DMA channel will be granted access for transferring data, in case more than one channels are active and request the bus at the same time. The greater the value, the higher the priority. In specific:
000 = lowest priority
111 = highest priority
If different channels with equal priority level values request the bus at the same time, an inherent priority mechanism is applied. According to this mechanism, if, for example, both the DMA0 and DMA1 channels have the same priority level, then DMA0 will first be granted access to the bus.</description>
	<access>read-write</access>
	<bitRange>[9:7]</bitRange>
	
</field><field>
	<name>CIRCULAR</name>
	<description>0 = Normal mode. The DMA channel stops after having completed the transfer of length determined by DMAx_LEN_REG. DMA_ON automatically deasserts when the transfer is completed.
1 = Circular mode (applicable only if DREQ_MODE = '1'). In this mode, DMA_ON never deasserts, as the DMA channel automatically resets DMAx_IDX_REG and starts a new transfer.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>AINC</name>
	<description>Enable increment of source address.
0 = do not increment (source address stays the same during the transfer)
1 = increment according to the value of BW bit-field (by 1, when BW="00" ; by 2, when BW="01" ; by 4, when BW="10")</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>BINC</name>
	<description>Enable increment of destination address.
0 = do not increment (destination address stays the same during the transfer)
1 = increment according to the value of BW bit-field (by 1, when BW="00" ; by 2, when BW="01" ; by 4, when BW="10")</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DREQ_MODE</name>
	<description>0 = DMA channel starts immediately
1 = DMA channel must be triggered by peripheral DMA request (see also the description of DMA_REQ_MUX_REG)</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>BW</name>
	<description>Bus transfer width:
00 = 1 Byte (suggested for peripherals like UART and 8-bit SPI)
01 = 2 Bytes (suggested for peripherals like I2C and 16-bit SPI)
10 = 4 Bytes (suggested for Memory-to-Memory transfers)
11 = Reserved</description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	
</field><field>
	<name>DMA_ON</name>
	<description>0 = DMA channel is off, clocks are disabled
1 = DMA channel is enabled. This bit will be automatically cleared after the completion of a transfer, if circular mode is not enabled. In circular mode, this bit stays set.
Note: If DMA_ON is disabled by SW while the DMA channel is active, it cannot be enabled again until the channel has completed the last on-going read-write cycle and has stopped. Thus, the SW has to check that the reading of DMAx_CTRL_REG.DMA_ON returns 0, before setting again the specific bit-field.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
