irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>DMA7_IDX_REG</name>
	<description>Index value of DMA channel 7</description>
	<addressOffset>0x000000f4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DMA7_IDX</name>
	<description>This (read-only) register determines the data items already transferred by the DMA channel. Hence, if its value is 1, then the DMA channel has already copied one data item and it is currently performing the next copy. If its value is 2, then two items have already been copied and so on.
When the transfer is completed (so when DMAx_CTRL_REG.DMA_ON has been cleared) and DMAx_CTRL_REG.CIRCULAR is not set, the register keeps its (last) value (which should be equal to DMAx_LEN_REG) and it is automatically reset to 0 upon starting a new transfer. In CIRCULAR mode, the register is automatically initialized to 0 as soon as the DMA channel starts-over again.</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DMA7_INT_REG</name>
	<description>DMA receive interrupt register channel 7</description>
	<addressOffset>0x000000e8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DMA7_INT</name>
	<description>Number of transfers until an interrupt is generated. The interrupt is generated after a transfer, if DMAx_INT_REG is equal to DMAx_IDX_REG and before DMAx_IDX_REG is incremented. The bit-field IRQ_ENABLE of DMAx_CTRL_REG must be set to '1' to let the controller generate the interrupt.</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DMA7_LEN_REG</name>
	<description>DMA receive length register channel 7</description>
	<addressOffset>0x000000ec</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DMA7_LEN</name>
	<description>DMA channel's transfer length. DMAx_LEN of value 0, 1, 2, ... results into an actual transfer length of 1, 2, 3, ...</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DMA_CLEAR_INT_REG</name>
	<description>DMA clear interrupt register</description>
	<addressOffset>0x00000108</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>DMA_RST_IRQ_CH7</name>
	<description>Writing a 1 will reset the IRQ of channel 7 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DMA_RST_IRQ_CH6</name>
	<description>Writing a 1 will reset the IRQ of channel 6 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DMA_RST_IRQ_CH5</name>
	<description>Writing a 1 will reset the IRQ of channel 5 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DMA_RST_IRQ_CH4</name>
	<description>Writing a 1 will reset the IRQ of channel 4 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DMA_RST_IRQ_CH3</name>
	<description>Writing a 1 will reset the IRQ of channel 3 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DMA_RST_IRQ_CH2</name>
	<description>Writing a 1 will reset the IRQ of channel 2 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DMA_RST_IRQ_CH1</name>
	<description>Writing a 1 will reset the IRQ of channel 1 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DMA_RST_IRQ_CH0</name>
	<description>Writing a 1 will reset the IRQ of channel 0 ; writing a 0 will have no effect.</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DMA_INT_MASK_REG</name>
	<description>DMA Interrupt mask register</description>
	<addressOffset>0x0000010c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>DMA_IRQ_ENABLE7</name>
	<description>0 = disable interrupts on channel 7
1 = enable interrupts on channel 7</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DMA_IRQ_ENABLE6</name>
	<description>0 = disable interrupts on channel 6
1 = enable interrupts on channel 6</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DMA_IRQ_ENABLE5</name>
	<description>0 = disable interrupts on channel 5
1 = enable interrupts on channel 5</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DMA_IRQ_ENABLE4</name>
	<description>0 = disable interrupts on channel 4
1 = enable interrupts on channel 4</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DMA_IRQ_ENABLE3</name>
	<description>0 = disable interrupts on channel 3
1 = enable interrupts on channel 3</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DMA_IRQ_ENABLE2</name>
	<description>0 = disable interrupts on channel 2
1 = enable interrupts on channel 2</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DMA_IRQ_ENABLE1</name>
	<description>0 = disable interrupts on channel 1
1 = enable interrupts on channel 1</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DMA_IRQ_ENABLE0</name>
	<description>0 = disable interrupts on channel 0
1 = enable interrupts on channel 0</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
