irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>DMA_INT_STATUS_REG</name>
	<description>DMA interrupt status register</description>
	<addressOffset>0x00000104</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DMA_BUS_ERR7</name>
	<description>0 = No bus error response is detected for channel 7
1 = Bus error response detected for channel 7
NOTE: This bit-field is auto-clear and it is initialized to '0' as soon as a new transfer is started.It is also noted that when the specific channel becomes secure (so when either of the PROT_AES_KEY_READ and PROT_QSPI_KEY_READ bits of SECURE_BOOT_REG is set), this bit-field is overruled to '0', masking the bus error status reporting to the user.</description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>DMA_BUS_ERR6</name>
	<description>0 = No bus error response is detected for channel 6
1 = Bus error response detected for channel 6
NOTE: This bit-field is auto-clear and it is initialized to '0' as soon as a new transfer is started.</description>
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>DMA_BUS_ERR5</name>
	<description>0 = No bus error response is detected for channel 5
1 = Bus error response detected for channel 5
NOTE: This bit-field is auto-clear and it is initialized to '0' as soon as a new transfer is started.</description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>DMA_BUS_ERR4</name>
	<description>0 = No bus error response is detected for channel 4
1 = Bus error response detected for channel 4
NOTE: This bit-field is auto-clear and it is initialized to '0' as soon as a new transfer is started.</description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>DMA_BUS_ERR3</name>
	<description>0 = No bus error response is detected for channel 3
1 = Bus error response detected for channel 3
NOTE: This bit-field is auto-clear and it is initialized to '0' as soon as a new transfer is started.</description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>DMA_BUS_ERR2</name>
	<description>0 = No bus error response is detected for channel 2
1 = Bus error response detected for channel 2
NOTE: This bit-field is auto-clear and it is initialized to '0' as soon as a new transfer is started.</description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>DMA_BUS_ERR1</name>
	<description>0 = No bus error response is detected for channel 1
1 = Bus error response detected for channel 1
NOTE: This bit-field is auto-clear and it is initialized to '0' as soon as a new transfer is started.</description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>DMA_BUS_ERR0</name>
	<description>0 = No bus error response is detected for channel 0
1 = Bus error response detected for channel 0
NOTE: This bit-field is auto-clear and it is initialized to '0' as soon as a new transfer is started.</description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>DMA_IRQ_CH7</name>
	<description>0 = IRQ on channel 7 is not set
1 = IRQ on channel 7 is set</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DMA_IRQ_CH6</name>
	<description>0 = IRQ on channel 6 is not set
1 = IRQ on channel 6 is set</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>DMA_IRQ_CH5</name>
	<description>0 = IRQ on channel 5 is not set
1 = IRQ on channel 5 is set</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>DMA_IRQ_CH4</name>
	<description>0 = IRQ on channel 4 is not set
1 = IRQ on channel 4 is set</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>DMA_IRQ_CH3</name>
	<description>0 = IRQ on channel 3 is not set
1 = IRQ on channel 3 is set</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>DMA_IRQ_CH2</name>
	<description>0 = IRQ on channel 2 is not set
1 = IRQ on channel 2 is set</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>DMA_IRQ_CH1</name>
	<description>0 = IRQ on channel 1 is not set
1 = IRQ on channel 1 is set</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>DMA_IRQ_CH0</name>
	<description>0 = IRQ on channel 0 is not set
1 = IRQ on channel 0 is set</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>DMA_REQ_MUX_REG</name>
	<description>DMA channel assignments</description>
	<addressOffset>0x00000100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000ffff</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DMA67_SEL</name>
	<description>Select which combination of peripherals are mapped on the DMA channels. The peripherals are mapped as pairs on two channels.
Here, the first DMA request is mapped on channel 6 and the second on channel 7.
See DMA01_SEL for the peripheral mapping.</description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	
</field><field>
	<name>DMA45_SEL</name>
	<description>Select which combination of peripherals are mapped on the DMA channels. The peripherals are mapped as pairs on two channels.
Here, the first DMA request is mapped on channel 4 and the second on channel 5.
See DMA01_SEL for the peripherals' mapping.</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>DMA23_SEL</name>
	<description>Select which combination of peripherals are mapped on the DMA channels. The peripherals are mapped as pairs on two channels.
Here, the first DMA request is mapped on channel 2 and the second on channel 3.
See DMA01_SEL for the peripherals' mapping.</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>DMA01_SEL</name>
	<description>Select which combination of peripherals are mapped on the DMA channels. The peripherals are mapped as pairs on two channels.
Here, the first DMA request is mapped on channel 0 and the second on channel 1.
0x0: SPI_rx / SPI_tx
0x1: SPI2_rx / SPI2_tx
0x2: UART_rx / UART_tx
0x3: UART2_rx / UART2_tx
0x4: I2C_rx / I2C_tx
0x5: I2C2_rx / I2C2_tx
0x6: USB_rx / USB_tx
0x7: UART3_rx/UART3_tx
0x8: PCM_rx / PCM_tx
0x9: SRC_rx / SRC_tx (for all the supported conversions)
0xA: Reserved
0xB: Reserved
0xC: GP_ADC / -
0xD: SD_ADC / -
0xE: Reserved
0xF: None

Note: If any of the four available peripheral selector fields (DMA01_SEL, DMA23_SEL, DMA45_SEL, DMA67_SEL) have the same value, the lesser significant selector has higher priority and will control the DMA acknowledge signal driven to the selected peripheral. Hence, if DMA01_SEL = DMA23_SEL, the channels 0 and 1 will provide the Rx and Tx DMA acknowledge signals for the selected peripheral. Consequently, it is suggested to assign the intended peripheral value to a unique selector field.</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
