irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>GP_ADC_OFFN_REG</name>
	<description>General Purpose ADC Negative Offset Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>GP_ADC_OFFN</name>
	<description>Offset adjust of 'negative' array of ADC-network (effective if "GP_ADC_SE=0", or "GP_ADC_SE=1 AND GP_ADC_SIGN=1")</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>GP_ADC_OFFP_REG</name>
	<description>General Purpose ADC Positive Offset Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>GP_ADC_OFFP</name>
	<description>Offset adjust of 'positive' array of ADC-network (effective if "GP_ADC_SE=0", or "GP_ADC_SE=1 AND GP_ADC_SIGN=0")</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>GP_ADC_RESULT_REG</name>
	<description>General Purpose ADC Result Register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>GP_ADC_VAL</name>
	<description>Returns the 10 up to 16 bits linear value of the last AD conversion. The upper 10 bits are always valid, the lower 6 bits are only valid in case oversampling has been applied. Two samples results in one extra bit and 64 samples results in six extra bits.</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>GPIO</name>
	<version>1.0</version>
	<description>GPIO registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50020a00</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>304</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>BIST_CTRL_REG</name>
	<description>Memory BIST Control Register</description>
	<addressOffset>0x00000104</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>SYSRAMBIST_ENABLE</name>
	<description>Enable Memory Build In Self Test of all RAMs.
Control of the MBIST is by means of a JTAG interface.
0: mission mode.
1: MBIST pinmapping:
GPIO_P0_24: JTAG_TRST
GPIO_P0_25: JTAG_TCK
GPIO_P0_26: JTAG_TMS
GPIO_P0_27: JTAG_TDI
GPIO_P0_28: MBIST_ON
GPIO_P0_29: MBIST_GO
GPIO_P0_30: MBIST_DONE
GPIO_P0_31: JTAG_TDO</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>ROMBIST_ENABLE</name>
	<description>Enable the ROM bist </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>ROMBIST_CONFIG</name>
	<description>Bist configuration for ROMBIST:
00 = Perform all 2 phases
01 = Perform only phase 1
10 = Perform only phase 2
11 = Reserved</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>GPIO_CLK_SEL_REG</name>
	<description>Select which clock to map on ports P0/P1</description>
	<addressOffset>0x000000fc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>DIVN_OUTPUT_EN</name>
	<description>DIVN output enable bit-field. When set, it enables the mapping of DIVN clock on dedicated GPIO (P0_15). The specific GPIO must be configured as GPIO output.</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>RC32M_OUTPUT_EN</name>
	<description>RC32M output enable bit-field. When set, it enables the mapping of RC32M clock on dedicated GPIO (P0_13). The specific GPIO must be configured as GPIO output.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>XTAL32M_OUTPUT_EN</name>
	<description>XTALK32M output enable bit-field. When set, it enables the mapping of XTAL32M clock on dedicated GPIO (P0_12). The specific GPIO must be configured as GPIO output.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>RCX_OUTPUT_EN</name>
	<description>RCX output enable bit-field. When set, it enables the mapping of RCX clock on dedicated GPIO (P0_16). The specific GPIO must be configured as GPIO output.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>RC32K_OUTPUT_EN</name>
	<description>RC32K output enable bit-field. When set, it enables the mapping of RC32K clock on dedicated GPIO (P0_17). The specific GPIO must be configured as GPIO output.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>XTAL32K_OUTPUT_EN</name>
	<description>XTALK32K output enable bit-field. When set, it enables the mapping of XTAL32K clock on dedicated GPIO (P0_14).The specific GPIO must be configured as GPIO output.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>FUNC_CLOCK_EN</name>
	<description>If set, it enables the mapping of the selected clock signal, according to FUNC_CLOCK_SEL bit-field.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>FUNC_CLOCK_SEL</name>
	<description>Select which clock to map when PID = FUNC_CLOCK.
0x0: XTAL32K
0x1: RC32K
0x2: RCX
0x3: XTAL32M
0x4: RC32M
0x5: DIVN
0x6: Reserved
0x7: Reserved</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P0_00_MODE_REG</name>
	<description>P0_00 Mode Register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>PID</name>
	<description>Function of port:
0:  GPIO (see also the PUPD bit-field)
1:  UART_RX
2:  UART_TX
3:  UART2_RX
4:  UART2_TX
5:  UART2_CTSN
6:  UART2_RTSN
7:  UART3_RX
8:  UART3_TX
9:  UART3_CTSN
10: UART3_RTSN
11: ISO_CLK
12: ISO_DATA
13: SPI_DI
14: SPI_DO
15: SPI_CLK16: SPI_EN
17: SPI2_DI
18: SPI2_DO
19: SPI2_CLK
20: SPI2_EN
21: I2C_SCL
22: I2C_SDA
23: I2C2_SCL
24: I2C2_SDA
25: USB_SOF
26: ADC (dedicated pins)
27: USB (dedicated pins)
28: PCM_DI
29: PCM_DO
30: PCM_FSC
31: PCM_CLK
32: PDM_DATA
33: PDM_CLK
34: COEX_EXT_ACT0
35: COEX_SMART_ACT
36: COEX_SMART_PRI
37: PORT0_DCF
38: PORT1_DCF
39: PORT2_DCF
40: PORT3_DCF
41: PORT4_DCF
42: CLOCK (dedicated pins, see also GPIO_CLK_SEL_REG)
43: PG (dedicated pins)
44: LCD (dedicated pins)
45: LCD_SPI_DC
46: LCD_SPI_DO
47: LCD_SPI_CLK
48: LCD_SPI_EN
49: TIM_PWM
50: TIM2_PWM
51: TIM_1SHOT
52: TIM2_1SHOT
53: TIM3_PWM
54: TIM4_PWM
55: Reserved
56: CMAC_DIAG0
57: CMAC_DIAG1
58: CMAC_DIAG2
59: CMAC_DIAGX (dedicated pins)
</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
