irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>P0_08_MODE_REG</name>
	<description>P0_08 Mode Register</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care.</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P0_09_MODE_REG</name>
	<description>P0_09 Mode Register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care.</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID] </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P0_10_MODE_REG</name>
	<description>P0_10 Mode Register</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000100</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care.</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>PID</name>
	<description>See P0_00_MODE_REG[PID]</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P0_11_MODE_REG</name>
	<description>P0_11 Mode Register</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care.</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>PID</name>
	<description>See P0_00_MODE_REG[PID]</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P0_12_MODE_REG</name>
	<description>P0_12 Mode Register</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000100</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care.</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>PID</name>
	<description>See P0_00_MODE_REG[PID]</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P0_13_MODE_REG</name>
	<description>P0_13 Mode Register</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care.</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>PID</name>
	<description>See P0_00_MODE_REG[PID]</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P0_14_MODE_REG</name>
	<description>P0_14 Mode Register</description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>PPOD</name>
	<description>0: Push pull
1: Open drain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care.</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>PID</name>
	<description>See P0_00_MODE_REG[PID]</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
