irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>P1_DATA_REG</name>
	<description>P1 Data input / output Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields>
	<field>
	<name>P1_DATA</name>
	<description>Set P1 output register when written; Returns the value of P1 port when read </description>
	<access>read-write</access>
	<bitRange>[22:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P1_PADPWR_CTRL_REG</name>
	<description>P1 Output Power Control Register</description>
	<addressOffset>0x000000f8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields>
	<field>
	<name>P1_OUT_CTRL</name>
	<description>0 = P1_x port output is powered by the V30 rail (default)
1 = P1_x port output is powered by the 1V8P rail
bit x controls the power supply of P1[x]</description>
	<access>read-write</access>
	<bitRange>[22:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P1_RESET_DATA_REG</name>
	<description>P1 Reset port pins Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields>
	<field>
	<name>P1_RESET</name>
	<description>Writing a 1 to P1[y] sets P1[y] to 0. Writing 0 is discarded;
Reading returns 0 </description>
	<access>write-only</access>
	<bitRange>[22:0]</bitRange>
	
</field></fields>
</register><register>
	<name>P1_SET_DATA_REG</name>
	<description>P1 Set port pins Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields>
	<field>
	<name>P1_SET</name>
	<description>Writing a 1 to P1[y] sets P1[y] to 1. Writing 0 is discarded;
Reading returns 0 </description>
	<access>write-only</access>
	<bitRange>[22:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PAD_WEAK_CTRL_REG</name>
	<description>Weak Pads Control Register</description>
	<addressOffset>0x00000100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>P1_09_LOWDRV</name>
	<description>0 = Normal operation
1 = Reduces the driving strength of P1_09 pad
Note: This mode should be coupled with the selection of VDD1V8P supply rail for the specific pad (see also the description of P1_PADPWDR_CTRL_REG).</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>P1_06_LOWDRV</name>
	<description>0 = Normal operation
1 = Reduces the driving strength of P1_06 pad
Note: This mode should be coupled with the selection of VDD1V8P supply rail for the specific pad (see also the description of P1_PADPWDR_CTRL_REG).</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>P1_02_LOWDRV</name>
	<description>0 = Normal operation
1 = Reduces the driving strength of P1_02 pad
Note: This mode should be coupled with the selection of VDD1V8P supply rail for the specific pad (see also the description of P1_PADPWDR_CTRL_REG).</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>P1_01_LOWDRV</name>
	<description>0 = Normal operation
1 = Reduces the driving strength of P1_01 pad
Note: This mode should be coupled with the selection of VDD1V8P supply rail for the specific pad (see also the description of P1_PADPWDR_CTRL_REG).</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>P1_00_LOWDRV</name>
	<description>0 = Normal operation
1 = Reduces the driving strength of P1_00 pad
Note: This mode should be coupled with the selection of VDD1V8P supply rail for the specific pad (see also the description of P1_PADPWDR_CTRL_REG).</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>P0_27_LOWDRV</name>
	<description>0 = Normal operation
1 = Reduces the driving strength of P0_27 pad
Note: This mode should be coupled with the selection of VDD1V8P supply rail for the specific pad (see also the description of P0_PADPWDR_CTRL_REG).</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>P0_26_LOWDRV</name>
	<description>0 = Normal operation
1 = Reduces the driving strength of P0_26 pad
Note: This mode should be coupled with the selection of VDD1V8P supply rail for the specific pad (see also the description of P0_PADPWDR_CTRL_REG).</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>P0_25_LOWDRV</name>
	<description>0 = Normal operation
1 = Reduces the driving strength of P0_25 pad
Note: This mode should be coupled with the selection of VDD1V8P supply rail for the specific pad (see also the description of P0_PADPWDR_CTRL_REG).</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>P0_18_LOWDRV</name>
	<description>0 = Normal operation
1 = Reduces the driving strength of P0_18 pad
Note: This mode should be coupled with the selection of VDD1V8P supply rail for the specific pad (see also the description of P0_PADPWDR_CTRL_REG).</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>P0_17_LOWDRV</name>
	<description>0 = Normal operation
1 = Reduces the driving strength of P0_17 pad
Note: This mode should be coupled with the selection of VDD1V8P supply rail for the specific pad (see also the description of P0_PADPWDR_CTRL_REG).</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>P0_16_LOWDRV</name>
	<description>0 = Normal operation
1 = Reduces the driving strength of P0_16 pad
Note: This mode should be coupled with the selection of VDD1V8P supply rail for the specific pad (see also the description of P0_PADPWDR_CTRL_REG).</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>P0_07_LOWDRV</name>
	<description>0 = Normal operation
1 = Reduces the driving strength of P0_07 pad
Note: This mode should be coupled with the selection of VDD1V8P supply rail for the specific pad (see also the description of P0_PADPWDR_CTRL_REG).</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>P0_06_LOWDRV</name>
	<description>0 = Normal operation
1 = Reduces the driving strength of P0_06 pad
Note: This mode should be coupled with the selection of VDD1V8P supply rail for the specific pad (see also the description of P0_PADPWDR_CTRL_REG).</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
