irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RAMBIST_STATUS1_REG</name>
	<description>RAM BIST Status Register</description>
	<addressOffset>0x00000108</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ROM_BIST_BUSY</name>
	<description>status of internal signal "busy" of rom bist </description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field></fields>
</register><register>
	<name>RAMBIST_STATUS2_REG</name>
	<description>RAM BIST Status Register 2</description>
	<addressOffset>0x0000010c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	</fields>
</register><register>
	<name>RAMBIST_STATUS3_REG</name>
	<description>RAM BIST Status Register 3</description>
	<addressOffset>0x00000110</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields>
	</fields>
</register><register>
	<name>ROMBIST_RESULTH_REG</name>
	<description>ROM BIST Status Register - 16 MSBs</description>
	<addressOffset>0x00000118</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ROMBIST_RESULTH</name>
	<description>Read version of bist status, result[31:16] </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>ROMBIST_RESULTL_REG</name>
	<description>ROM BIST Status Register - 16 LSBs</description>
	<addressOffset>0x00000114</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ROMBIST_RESULTL</name>
	<description>Read version of bist status, result[15:0] </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TEST_CTRL2_REG</name>
	<description>Test Control Register 2</description>
	<addressOffset>0x00000120</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>RF_IN_TESTMUX_CTRL</name>
	<description>Connect the RF input testbus to pins:
Switch 1 (bit 8) connects T0 of the radio test input bus to pin P1_6
Switch 2 (bit 9) connects T1 of the radio test input bus to pin P1_9
If this bit is 0, the switch is open (not conducting).</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>ANA_TESTMUX_CTRL</name>
	<description>Control of analog test bus switches:
Switch 1 connects T0 of the radio test output bus to P1_7
Switch 2 connects T1 of the radio test output bus to P1_10]
Switch 3 connects T0 of the analog test output bus to P1_7
Switch 4 connects T1 of the analog test output bus to P1_10

0: all switches open
1: only switch 1 closed
2: only switch 2 closed
3: only switch 3 closed
4: only switch 4 closed
5: switches 1 &amp; 2 closed
6: switches 1 &amp; 4 closed
7: switches 2 &amp; 3 closed
8: switches 3 &amp; 4 closed </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TEST_CTRL3_REG</name>
	<description>Test Control Register 3</description>
	<addressOffset>0x00000124</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RF_TEST_OUT_PARAM</name>
	<description>Select which test will be enabled on the block selected by the RF output testbus (see </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>VBUS_COMPARATOR_TEST</name>
	<description>Control for the testability of VBUS input on V33 comparator</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>RF_TEST_OUT_SEL</name>
	<description>Select a radio block to have its testbus connected to P1[1] and P1[2]. See
Table 7
for more information.
NOTE: all 0 represent no testmode and the testbusses are shorted to ground to prevent floating busses. </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TEST_CTRL4_REG</name>
	<description>Test Control Register 4</description>
	<addressOffset>0x00000128</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RF_TEST_IN_PARAM</name>
	<description>Select which test will be enabled on the block selected by the RF output testbus (see </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>RF_TEST_IN_SEL</name>
	<description>Select an RF block to have its test input connected to the input testbus at pins P0[0] and P0[3]. NOTE: all 0 represent no testmode and the testbusses are shorted to ground to prevent floating busses. </description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TEST_CTRL5_REG</name>
	<description>Test Control Register 5</description>
	<addressOffset>0x0000012c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LDO_RET_FORCE_HOLD</name>
	
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>POR_VBAT_FORCE_ON</name>
	
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	
</field><field>
	<name>POR_VBAT_FORCE_OFF</name>
	
	<access>read-write</access>
	<bitRange>[29:29]</bitRange>
	
</field><field>
	<name>POR_VBAT_FORCE_MASK</name>
	
	<access>read-write</access>
	<bitRange>[28:28]</bitRange>
	
</field><field>
	<name>TEST_VCAP_PRECHARGE</name>
	
	<access>read-write</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>LDO_CORE_BOOST_VDD</name>
	
	<access>read-write</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>BGR_BOOST_VREF</name>
	
	<access>read-write</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>TEST_BANDGAP</name>
	
	<access>read-write</access>
	<bitRange>[23:20]</bitRange>
	
</field><field>
	<name>TEST_BANDGAP_I_TEST</name>
	
	<access>read-write</access>
	<bitRange>[19:19]</bitRange>
	
</field><field>
	<name>TEST_PLL</name>
	
	<access>read-write</access>
	<bitRange>[18:18]</bitRange>
	
</field><field>
	<name>TEST_LRA_ADC</name>
	
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>TEST_POR_VBAT</name>
	
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>TEST_FORCE_RUNNING</name>
	
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>TEST_DIFFTEMP</name>
	
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>TEST_VCONT</name>
	
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>TEST_SIMO_BUCK</name>
	
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>TEST_VDDX_ADPLL</name>
	
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>TEST_VDDX_RCX</name>
	
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>TEST_VDDX_OSC32M</name>
	
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>TEST_VDDD_NOTSLEEP</name>
	
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>TEST_LDO_VDDHIGH</name>
	
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>TEST_LDO_PLL</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>TEST_LDO_ADC</name>
	
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>TEST_LDO_1V8P</name>
	
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>TEST_LDO_CORE</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>TEST_LDO_1V8</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>TEST_LDO_1V4</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>TEST_BUS_TO_AVS</name>
	
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
