irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>TEST_CTRL_REG</name>
	<description>Test Control Register</description>
	<addressOffset>0x0000011c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields>
	<field>
	<name>PM_MON_CTRL</name>
	<description>PM control bus ([7:0])</description>
	<access>read-write</access>
	<bitRange>[22:17]</bitRange>
	
</field><field>
	<name>LED1_PWM_DISABLE</name>
	<description>Disable PWM on LED1 driver, dutycycle LED1=100%</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>LED0_PWM_DISABLE</name>
	<description>Disable PWM on LED0 driver, dutycycle LED0=100%</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>XTAL32M_TRIM_TEST_EN</name>
	<description>0: normal port function, 1: shows xtal32m_trim_sw2_isolated onto pin P1_6</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>SDADC_TEST_OUT_EN</name>
	<description>0: Normal operation, 1: Maps the Sigma-Delta ADC bitstream signal onto the P1_8 pin.</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>RADIO_ONLY_MODE_EN</name>
	<description>0: Normal operation,
1: Enables the Exposed Radio mode (Radio-only mode).</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>SHOW_PWR_TST_OUT</name>
	<description>0: Normal operation
1: P1[7:1] = ldo_1v8_flash_ret_enable, ldo_supply_vbat_ok, ldo_supply_usb_ok, ldo_1v8_pa_ret_enable, bandgap_bgr_ok, 0, ldo_vbat_ret_enable
2: P1[7:1] = ldo_vbat_ret_vref_hold, ldo_core_ok, pll_status_reg_isolated_1, ldo_radio_ok,ldo_1v8_pa_ok, ldo_1v8_flash_ok, ldo_supply_usb_enable
3: P1[7:1] = ldo_1v8_flash_ret_vref_hold, vbus_available, newbat, clear_newbat, ldo_1v8_pa_ret_vref_hold, 0, power_on_reset
4: P1[7:1] = comp_v18_pa_high, comp_v18_flash_high, comp_vdd_high, comp_vbus_low, comp_vbus_high, comp_v33_high, comp_vbat_ok
5: P1[7:1] = charge_gate_enable, bod_v18_pa_low, bod_v33_low, bod_v18_flash_low, bod_vdd_low, bod_vbat_low, bod_clk
</description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>PM_MON_EN</name>
	<description>0: Normal operation
1: Shows the PM_MON[3:0] bus on pins P0[25:22]</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>ADPLL_SCAN_TEST_EN</name>
	<description>0: Normal operation
1: Enables the ADPLL scan test signal, activating the respective scan mode.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>SHOW_IF_RO</name>
	<description>0: Normal Port function.
1: Show IF filter Reference Oscillator I and Q signals.
P10 = iff_ro_out_i
P06 = iff_ro_out_q </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>XTAL32M_CAP_TEST_EN</name>
	<description>0: Normal Port function.
1: Shows xtal16m_cap_test_out output onto pins P1[3:2]
Notes:
- The control signal should go to the radio to enable this test mode.
- This register should be zero during scan test! </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>SHOW_DCDC_TESTBUS</name>
	<description>0: normal port function
1: map the DCDC testbus [11:0] on the following GPIO's (MSB first): P23,P21,P20,P1[7:0],P07</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>SHOW_PLL_TEST_OUT</name>
	<description>0: normal port function
1: map pll_out_div_test_out on P06 and pll_loop_div_test_out on P10</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>ENABLE_RFPT</name>
	<description>0: normal port function
1: enable the RF Production Test Unit. Used to store RX ADC samples or PLL TDC samples in SRAM.
See RFPT_CTRL_REG, RFPT_ADDR_REG and RFPT_LEN_REG for details. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SHOW_CLOCKS</name>
	<description>0: normal port function
1: show DIVN clock on P10
</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>GPREG</name>
	<version>1.0</version>
	<description>GPREG registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50040300</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>28</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>DEBUG_REG</name>
	<description>Various debug information register.</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000101</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CROSS_CPU_HALT_SENSITIVITY</name>
	<description>Select the cross CPU halt sensitivity.
0: Level triggered,
1: Pulse triggered.
Note: This bit is retained.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>SYS_CPUWAIT_ON_JTAG</name>
	<description>1: Stall the processor core out of reset (only after a wake-up from JTAG). Debugger access continue when the core is stalled. When set to '0' again the core resumes instruction execution.
This feature is independent of the PDC (Power Domain Controller) settings. If this bit is set and there is SW/JTAG activity during deep sleep, the SYS CPU is stalled after the wake-up.
Note: This bit is retained.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>SYS_CPUWAIT</name>
	<description>1: Stall the processor core out of reset (always after a wake-up). Debugger access continue when the core is stalled. When set to '0' again the core resumes instruction execution.
Note: This bit is retained.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>CMAC_CPU_IS_HALTED</name>
	<description>1: CMAC CPU is halted.</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>SYS_CPU_IS_HALTED</name>
	<description>1: SYS CPU (ARM CM33) is halted.</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>HALT_CMAC_SYS_CPU_EN</name>
	<description>1: Enable CMAC CPU halting to the SYS CPU (ARM CM33).
Note: This bit is retained.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>HALT_SYS_CMAC_CPU_EN</name>
	<description>1: Enable SYS CPU (ARM CM33) halting to the CMAC CPU.
Note: This bit is retained.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>CMAC_CPU_FREEZE_EN</name>
	<description>1: Enable Freezing peripherals by the CMAC CPU.
Note: This bit is retained.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SYS_CPU_FREEZE_EN</name>
	<description>1: Enable Freezing peripherals by the SYS CPU (ARM CM33).
Default '1', freezing of the on-chip timers is enabled when the Cortex-M33 is halted in DEBUG State.
If '0', freezing of the on-chip timers is depending on FREEZE_REG when the Cortex-M33 is halted in DEBUG State except the system watchdog timer. The system watchdog timer is always frozen when the Cortex-M33 is halted in DEBUG State.
Note: This bit is retained.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
