irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>GP_CONTROL_REG</name>
	<description>General purpose system control register.</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CMAC_H2H_BRIDGE_BYPASS</name>
	<description>If '1', the AHB-to-AHB bridge is bypassed, reducing the wait cycles needed to access the CMAC Register File, only when the system clock source is the XTAL and both hclk and cmac_hclk are running at 32 MHz, i.e. at the XTAL clock rate.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field></fields>
</register><register>
	<name>GP_STATUS_REG</name>
	<description>General purpose system status register.</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CAL_PHASE</name>
	<description>If '1', it designates that the chip is in Calibration Phase i.e. the OTP has been initially programmed but no Calibration has occured. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RESET_FREEZE_REG</name>
	<description>Controls unfreezing of various timers/counters (incl. DMA and USB).</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>FRZ_CMAC_WDOG</name>
	<description>If '1', the CMAC SW Watchdog Timer continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>FRZ_SWTIM4</name>
	<description>If '1', the SW Timer4 continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>FRZ_SWTIM3</name>
	<description>If '1', the SW Timer3 continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>FRZ_PWMLED</name>
	<description>If '1', the PWM LED continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>FRZ_SWTIM2</name>
	<description>If '1', the SW Timer2 continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>FRZ_DMA</name>
	<description>If '1', the DMA continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>FRZ_USB</name>
	<description>If '1', the USB continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>FRZ_SYS_WDOG</name>
	<description>If '1', the SYS SW Watchdog Timer continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>FRZ_RESERVED</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>FRZ_SWTIM</name>
	<description>If '1', the SW Timer continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>FRZ_WKUPTIM</name>
	<description>If '1', the Wake Up Timer continues, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SET_FREEZE_REG</name>
	<description>Controls freezing of various timers/counters (incl. DMA and USB).</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>FRZ_CMAC_WDOG</name>
	<description>If '1', the CMAC SW Watchdog Timer is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>FRZ_SWTIM4</name>
	<description>If '1', the SW Timer4 is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>FRZ_SWTIM3</name>
	<description>If '1', the SW Timer3 is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>FRZ_PWMLED</name>
	<description>If '1', the PWM LED is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>FRZ_SWTIM2</name>
	<description>If '1', the SW Timer2 is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>FRZ_DMA</name>
	<description>If '1', the DMA is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>FRZ_USB</name>
	<description>If '1', the USB is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>FRZ_SYS_WDOG</name>
	<description>If '1', the SYS SW Watchdog Timer is frozen, '0' is discarded. WATCHDOG_CTRL_REG[NMI_RST] must be '0' to allow the freeze function. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>FRZ_RESERVED</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>FRZ_SWTIM</name>
	<description>If '1', the SW Timer is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>FRZ_WKUPTIM</name>
	<description>If '1', the Wake Up Timer is frozen, '0' is discarded. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>USBPAD_REG</name>
	<description>USB pads control register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields>
	<field>
	<name>USBPHY_FORCE_SW2_ON</name>
	<description>0: Pull up resistor SW2 is controlled by the USB controller. It is off when the USB is not enabled.
1: Force the pull up resistor on USBP to be 2.3Kohm</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>USBPHY_FORCE_SW1_OFF</name>
	<description>0: Pull up resistor SW1 is controlled by the USB controller. It is off when the USB is not enabled.
1: Force the pull up resistor on USBP to be switched off.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>USBPAD_EN</name>
	<description>0: The power for the USB PHY and USB pads is switched on when the USB is enabled.
1: The power for the USB PHY and USB pads is forced on.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
