irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>I2C_CLR_TX_ABRT_REG</name>
	<description>Clear TX_ABRT Interrupt Register</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CLR_TX_ABRT</name>
	<description>Read this register to clear the TX_ABRT interrupt (bit 6) of the
IC_RAW_INTR_STAT register, and the I2C_TX_ABRT_SOURCE register. This also releases the TX FIFO from the flushed/reset state, allowing more writes to the TX FIFO. Refer to Bit 9 of the I2C_TX_ABRT_SOURCE register for an exception to clearing IC_TX_ABRT_SOURCE. </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>I2C_CLR_TX_OVER_REG</name>
	<description>Clear TX_OVER Interrupt Register</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CLR_TX_OVER</name>
	<description>Read this register to clear the TX_OVER interrupt (bit 3) of the I2C_RAW_INTR_STAT register. </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>I2C_COMP_PARAM1_REG</name>
	<description>Component Parameter Register</description>
	<addressOffset>0x000000f4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>IC_COMP_PARAM1</name>
	<description>This is a constant read-only register that contains encoded information about the component's parameter settings.</description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>I2C_COMP_TYPE_REG</name>
	<description>I2C Component Type Register</description>
	<addressOffset>0x000000fc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x44570140</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>IC_COMP_TYPE</name>
	
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>I2C_COMP_VERSION_REG</name>
	<description>I2C Component Version Register</description>
	<addressOffset>0x000000f8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x3230322a</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>IC_COMP_VERSION</name>
	
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>I2C_CON_REG</name>
	<description>I2C Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000007f</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>I2C_STOP_DET_IF_MASTER_ACTIVE</name>
	<description>In Master mode:
1 = issues the STOP_DET interrupt only when master is active.
0 = issues the STOP_DET irrespective of whether master is active or not. </description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>I2C_RX_FIFO_FULL_HLD_CTRL</name>
	<description>This bit controls whether DW_apb_i2c should hold the bus when the Rx FIFO is physically full to its RX_BUFFER_DEPTH
1 = Hold bus when RX_FIFO is full
0 = Overflow when RX_FIFO is full</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>I2C_TX_EMPTY_CTRL</name>
	<description>This bit controls the generation of the TX_EMPTY interrupt, as described in the IC_RAW_INTR_STAT register.
1 = Controlled generation of TX_EMPTY interrupt
0 = Default behaviour of TX_EMPTY interrupt </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>I2C_STOP_DET_IFADDRESSED</name>
	<description>1 = slave issues STOP_DET intr only if addressed
0 = slave issues STOP_DET intr always
During a general call address, this slave does not issue the STOP_DET interrupt if STOP_DET_IF_ADDRESSED = 1'b1, even if the slave responds to the general call address by generating ACK. The STOP_DET interrupt is generated only when the transmitted address matches the slave address (SAR).</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>I2C_SLAVE_DISABLE</name>
	<description>Slave enabled or disabled after reset is applied, which means software does not have to configure the slave.
0=slave is enabled
1=slave is disabled
Software should ensure that if this bit is written with '0', then bit 0 should also be written with a '0'. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>I2C_RESTART_EN</name>
	<description>Determines whether RESTART conditions may be sent when acting as a master
0= disable
1=enable </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>I2C_10BITADDR_MASTER</name>
	<description>Controls whether the controller starts its transfers in 7- or 10-bit addressing mode when acting as a master.
0= 7-bit addressing
1= 10-bit addressing </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>I2C_10BITADDR_SLAVE</name>
	<description>When acting as a slave, this bit controls whether the controller responds to 7- or 10-bit addresses.
0= 7-bit addressing
1= 10-bit addressing </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>I2C_SPEED</name>
	<description>These bits control at which speed the controller operates.
1= standard mode (100 kbit/s)
2= fast mode (400 kbit/s)
3= high speed mode </description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	
</field><field>
	<name>I2C_MASTER_MODE</name>
	<description>This bit controls whether the controller master is enabled.
0= master disabled
1= master enabled
Software should ensure that if this bit is written with '1' then bit 6 should also be written with a '1'. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
