irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>I2C2_TAR_REG</name>
	<description>I2C Target Address Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000055</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SPECIAL</name>
	<description>On read
This bit indicates whether software performs a General Call or START BYTE command.
0 = ignore bit 10 GC_OR_START and use IC_TAR normally
1 = perform special I2C command as specified in GC_OR_START
bit
On write
1 = Enables programming of GENERAL_CALL or START_BYTE transmission
0 = Disables programming of GENERAL_CALL or START_BYTE transmission </description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>GC_OR_START</name>
	<description>On read
If bit 11 (SPECIAL) is set to 1, then this bit indicates whether a General Call or START byte command is to be performed by the controller.
0 = General Call Address - after issuing a General Call, only writes may be performed. Attempting to issue a read command results in setting bit 6 (TX_ABRT) of the IC_RAW_INTR_STAT register. The controller remains in General Call mode until the SPECIAL bit value (bit 11) is cleared.
1 = START BYTE
On write
1 = START byte transmission
0 = GENERAL_CALL byte transmission</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>IC_TAR</name>
	<description>This is the target address for any master transaction. When transmitting a General Call, these bits are ignored. To generate a START BYTE, the CPU needs to write only once into these bits.
Note: If the IC_TAR and IC_SAR are the same, loopback exists but the FIFOs are shared between master and slave, so full loopback is not feasible. Only one direction loopback mode is supported (simplex), not duplex. A master cannot transmit to itself; it can transmit to only a slave </description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>I2C2_TXFLR_REG</name>
	<description>I2C Transmit FIFO Level Register</description>
	<addressOffset>0x00000074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TXFLR</name>
	<description>Transmit FIFO Level. Contains the number of valid data entries in the transmit FIFO. Size is constrained by the TXFLR value </description>
	<access>read-only</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>I2C2_TX_ABRT_SOURCE_REG</name>
	<description>I2C Transmit Abort Source Register</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0001ffff</resetMask>
	<fields>
	<field>
	<name>ABRT_USER_ABRT</name>
	<description>Master-Transmitter : This is a master-mode-only bit. Master has detected the transfer abort (IC_ENABLE[1]) </description>
	<access>read-only</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>ABRT_SLVRD_INTX</name>
	<description>Slave-Transmitter : When the processor side responds to a slave mode request for data to be transmitted to a remote master and user writes a 1 in CMD (bit 8) of 2IC_DATA_CMD register
1 = Slave trying to transmit to remote master in read mode
0 = Slave trying to transmit to remote master in read mode- scenario not present </description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>ABRT_SLV_ARBLOST</name>
	<description>Slave-Transmitter : Slave lost the bus while transmitting data to a remote master. I2C_TX_ABRT_SOURCE[12] is set at the same time. Note: Even though the slave never "owns" the bus, something could go wrong on the bus. This is a fail safe check. For instance, during a data transmission at the low-to-high transition of SCL, if what is on the data bus is not what is supposed to be transmitted, then the controller no longer own the bus.
1 = Slave lost arbitration to remote master
0 = Slave lost arbitration to remote master- scenario not present </description>
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>ABRT_SLVFLUSH_TXFIFO</name>
	<description>Slave-Transmitter : Slave has received a read command and some data exists in the TX FIFO so the slave issues a TX_ABRT interrupt to flush old data in TX FIFO.
1 = Slave flushes existing data in TX-FIFO upon getting read command
0 = Slave flushes existing data in TX-FIFO upon getting read command- scenario not present </description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>ARB_LOST</name>
	<description>Master-Transmitter or Slave-Transmitter : Master has lost arbitration, or if I2C_TX_ABRT_SOURCE[14] is also set, then the slave transmitter has lost arbitration. Note: I2C can be both master and slave at the same time.
1 = Master or Slave-Transmitter lost arbitration
0 = Master or Slave-Transmitter lost arbitration- scenario not present </description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>ABRT_MASTER_DIS</name>
	<description>Master-Transmitter or Master-Receiver : User tries to initiate a Master operation with the Master mode disabled.
1 = User intitating master operation when MASTER disable
0 = User initiating master operation when MASTER disabled- scenario not present </description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>ABRT_10B_RD_NORSTRT</name>
	<description>Master-Receiver : The restart is disabled (IC_RESTART_EN bit (I2C_CON[5]) = 0) and the master sends a read command in 10-bit addressing mode.
1 =Master trying to read in 10Bit addressing mode when RESTART disabled
0 =Master not trying to read in 10Bit addressing mode when RESTART disabled </description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>ABRT_SBYTE_NORSTRT</name>
	<description>Master : To clear Bit 9, the source of the ABRT_SBYTE_NORSTRT must be fixed first; restart must be enabled (I2C_CON[5]=1), the SPECIAL bit must be cleared (I2C_TAR[11]), or the GC_OR_START bit must be cleared (I2C_TAR[10]). Once the source of the ABRT_SBYTE_NORSTRT is fixed, then this bit can be cleared in the same manner as other bits in this register. If the source of the ABRT_SBYTE_NORSTRT is not fixed before attempting to clear this bit, bit 9 clears for one cycle and then gets re-asserted. 1: The restart is disabled (IC_RESTART_EN bit (I2C_CON[5]) = 0) and the user is trying to send a START Byte. 
1 = User trying to send START byte when RESTART disabled
0 = User trying to send START byte when RESTART disabled- scenario not present </description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>ABRT_HS_NORSTRT</name>
	<description>Master-Transmitter or Master-Receiver : The restart is disabled (IC_RESTART_EN bit (I2C_CON[5]) = 0) and the user is trying to use the master to transfer data in High Speed mode
1 = User trying to switch Master to HS mode when RESTART disabled
0 = User trying to switch Master to HS mode when RESTART disabled- scenario not present </description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>ABRT_SBYTE_ACKDET</name>
	<description>Master : Master has sent a START Byte and the START Byte was acknowledged (wrong behavior). 
1 = ACK detected for START byte
0 = ACK detected for START byte- scenario not present </description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>ABRT_HS_ACKDET</name>
	<description>Master : Master is in High Speed mode and the High Speed Master code was acknowledged (wrong behavior).
1 = HS Master code ACKed in HS Mode
0 = HS Master code ACKed in HS Mode- scenario not present </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>ABRT_GCALL_READ</name>
	<description>Master-Transmitter : The controller in master mode sent a General Call but the user programmed the byte following the General Call to be a read from the bus (IC_DATA_CMD[9] is set to 1).
1 = GCALL is followed by read from bus
0 = GCALL is followed by read from bus-scenario not present </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>ABRT_GCALL_NOACK</name>
	<description>Master-Transmitter : the controller in master mode sent a General Call and no slave on the bus acknowledged the General Call.
1 = GCALL not ACKed by any slave
0 = GCALL not ACKed by any slave-scenario not present </description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>ABRT_TXDATA_NOACK</name>
	<description>Master-Transmitter : This is a master-mode only bit. Master has received an acknowledgement for the address, but when it sent data byte(s) following the address, it did not receive an acknowledge from the remote slave(s).
1 = Transmitted data not ACKed by addressed slave
0 = Transmitted data non-ACKed by addressed slave-scenario not present </description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>ABRT_10ADDR2_NOACK</name>
	<description>Master-Transmitter or Master-Receiver : Master is in 10-bit address mode and the second address byte of the 10-bit address was not acknowledged by any slave.
1= Byte 2 of 10Bit Address not ACKed by any slave
0 = This abort is not generated </description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>ABRT_10ADDR1_NOACK</name>
	<description>Master-Transmitter or Master-Receiver : Master is in 10-bit address mode and the first 10-bit address byte was not acknowledged by any slave.
1 =Byte 1 of 10Bit Address not ACKed by any slave
0 =This abort is not generated </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>ABRT_7B_ADDR_NOACK</name>
	<description>Master-Transmitter or Master-Receiver : Master is in 7-bit addressing mode and the address sent was not acknowledged by any slave.
1 =This abort is generated because of NOACK for 7-bit address
0 =This abort is not generated </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
