irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>I2C2_TX_TL_REG</name>
	<description>I2C Transmit FIFO Threshold Register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TX_TL</name>
	<description>Transmit FIFO Threshold Level Controls the level of entries (or below) that trigger the TX_EMPTY interrupt (bit 4 in I2C_RAW_INTR_STAT register). The valid range is 0-31, with the additional restriction that it may not be set to value larger than the depth of the buffer. If an attempt is made to do that, the actual value set will be the maximum depth of the buffer. A value of 0 sets the threshold for 0 entries, and a value of 31 sets the threshold for 32 entries.. </description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>LCDC</name>
	<version>1.0</version>
	<description>LCDC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x30030000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>396</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>LCDC_BACKPORCHXY_REG</name>
	<description>Back Porch X and Y</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_BPORCH_X</name>
	<description>Back porch X (lines)</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LCDC_BPORCH_Y</name>
	<description>Back porch Y (pixel clocks)</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_BGCOLOR_REG</name>
	<description>Background Color</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_BG_RED</name>
	<description>Red color used as background.</description>
	<access>read-write</access>
	<bitRange>[31:24]</bitRange>
	
</field><field>
	<name>LCDC_BG_GREEN</name>
	<description>Green color used as background.</description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	
</field><field>
	<name>LCDC_BG_BLUE</name>
	<description>Blue color used as background.</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>LCDC_BG_ALPHA</name>
	<description>Alpha color used as background.</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_BLANKINGXY_REG</name>
	<description>Blanking X and Y</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_BLANKING_X</name>
	<description>Blanking period X (VSYNC lines)</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LCDC_BLANKING_Y</name>
	<description>Blanking period Y (HSYNC pulse length)</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_CLKCTRL_REG</name>
	<description>Clock Divider</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000401</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_SEC_CLK_DIV</name>
	<description>Secondary clock divider that generates the format pipeline clock. Source clock of this divider is the main clock of LCD controller. The period of the generated clock is defined as : (LCDC_SEC_CLK_DIV + 1) x period_of_main_clock.</description>
	<access>read-write</access>
	<bitRange>[31:27]</bitRange>
	
</field><field>
	<name>LCDC_DMA_HOLD</name>
	<description>Hold time before DMA activated.</description>
	<access>read-write</access>
	<bitRange>[13:8]</bitRange>
	
</field><field>
	<name>LCDC_CLK_DIV</name>
	<description>Clock divider that generates the pixel pipeline clock. Source clock of this divider is the format pipeline clock (see also LCDC_SEC_CLK_DIV). The period of the generated clock is defines as : LCDC_CLK_DIV x period_of_format_clk. A zero value gives division by one.</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_CRC_REG</name>
	<description>CRC check</description>
	<addressOffset>0x00000184</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_CRC</name>
	<description>CRC check.</description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_DBIB_CFG_REG</name>
	<description>MIPI Config Register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_DBIB_TE_DIS</name>
	<description>Disable the sampling of the tearing effect signal, which is provided by the LCD device.
0: the tearing effect signal is sampled
1: the tearing effect signal is not sampled.</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_CSX_FORCE</name>
	<description>Forces the DBIB CSX value. When is enabled the DBIB CSX takes the value of the LCDC_DBIB_CSX_FORCE_VAL.
0 : disable
1 : enable</description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_CSX_FORCE_VAL</name>
	<description>Value of DBIB CSX to be forced, if bit 30 is set. Defines also the active level of the DBIB CSX even if the bit 30 is not set.</description>
	<access>read-write</access>
	<bitRange>[29:29]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_SPI_PAD</name>
	<description>Data padding :
0 : disable
1 : enable</description>
	<access>read-write</access>
	<bitRange>[28:28]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_RESX</name>
	<description>DBIB RESX, reset signal for MIPI DBIB display.</description>
	<access>read-write</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_DMA_EN</name>
	<description>Send pixels from DMA to DBIB display.
0 : disable
1 : enable</description>
	<access>read-write</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_SPI3_EN</name>
	<description>Enable SPI3 interface.
0 : disable
1 : enable</description>
	<access>read-write</access>
	<bitRange>[23:23]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_SPI4_EN</name>
	<description>Enable SPI4 interface.
0 : disable
1 : enable</description>
	<access>read-write</access>
	<bitRange>[22:22]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_SPI_CPHA</name>
	<description>Sets the data phase for the SPI interface</description>
	<access>read-write</access>
	<bitRange>[20:20]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_SPI_CPOL</name>
	<description>Sets the polarity of the clock (SCL)</description>
	<access>read-write</access>
	<bitRange>[19:19]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_SPI_JDI</name>
	<description>Enables the line addressing between the horizontal lines (JDI SPI output format).
0 : disable
1 : enable</description>
	<access>read-write</access>
	<bitRange>[18:18]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_SPI_HOLD</name>
	<description>Enables the command HOLD mode of operation. Commands and data transmissions binding.
0 : disable
1 : enable</description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_SPI_INV_ADDR</name>
	<description>Enables horizontal line address inversion.
0 : disable
1 : enable</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_INV_DATA</name>
	<description>Data inversion
0 : disable
1 : enable</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_JDI_INV_PIX</name>
	<description>MSB-LSB bit selection for JDI parallel interface
0 : disable (MSB - LSB)
1 : enable (LSB -MSB)</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_JDI_SOFT_RST</name>
	<description>JDI timing generation soft reset.
0 : disable
1 : enable</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_FMT</name>
	<description>Defines the output format and depends of the type of the output interface. For the SPI3 and the SPI4 are supported the following formats:
0x10 : RGB332
0x11 : RGB444
0x12 : RGB565
0x13 : RGB666
0x14 : RGB888

For the SPI4 only are supported additionally the following formats:
0x06 : RGB111-1 {2b00, R(n), G(n), B(n), R(n+1), G(n+1), B(n+1)}
0x07 : RGB111-2 {R(n), G(n), B(n), 1b0, R(n+1), G(n+1), B(n+1), 1b0}
0x08 : RGB111-3 {R(n), G(n), B(n), R(n+1), G(n+1), B(n+1), R(n+2), G(n+2), B(n+2),... }
0x09 : RGB111-4 {D(n), D(n+1), D(n+2),...}

For the JDI parallel interface should be used the format :
0x0A : RGB222</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
