irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>LCDC_DBIB_CMD_REG</name>
	<description>MIPI DBIB Command Register</description>
	<addressOffset>0x000000e8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_DBIB_CMD_SEND</name>
	<description>Send command to the DBI interface</description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_CMD_STORE</name>
	<description>This bit has meaning only when LCDC_DBIB_CFG_REG[LCDC_DBIB_SPI_JDI] = 1. When is enabled, stores the LCDC_DBIB_CMD_VAL to the register that keeps the Y position. </description>
	<access>read-write</access>
	<bitRange>[27:27]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_CMD_VAL</name>
	<description>Data to send to the DBI interface</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_FRONTPORCHXY_REG</name>
	<description>Front Porch X and Y</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_FPORCH_X</name>
	<description>Front porch X (lines)</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LCDC_FPORCH_Y</name>
	<description>Front porch Y (pixel clocks)</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_GPIO_REG</name>
	<description>General Purpose IO (2-bits)</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_TE_INV</name>
	<description>Applies an inversion on the TE (tearing effect) signal.
0 : the inversion is not applied on the TE signal
1 : the inversion is applied on TE signal</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LCDC_PARIF_SEL</name>
	<description>Selection of the parallel interface type that is forwarded to the gpio pins.
0 : JDI interface signals
1 : Clasic parallel interface</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_IDREG_REG</name>
	<description>Identification Register</description>
	<addressOffset>0x000000f4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_ID</name>
	<description>Identification register</description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_INTERRUPT_REG</name>
	<description>Interrupt Register</description>
	<addressOffset>0x000000f8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_IRQ_TRIGGER_SEL</name>
	<description>IRQ trigger control
0: Level triggering
1: Edge triggering
In the case of the level triggering, the request remains active in the LCDC until to be cleared. The request can be cleared by performing a write access in the LCDC_INTERRUPT_REG. This is not required in the case of the edge triggering.</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>LCDC_FRAME_END_IRQ_EN</name>
	<description>Continuous mode: frame end. Single mode: frame end or idle.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>LCDC_TE_IRQ_EN</name>
	<description>TE interrupt enable. See also the configuration bit LCDC_DBIB_CFG_REG[LCDC_DBIB_TE_DIS]</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>LCDC_HSYNC_IRQ_EN</name>
	<description>HSYNC interrupt enabled</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LCDC_VSYNC_IRQ_EN</name>
	<description>VSYNC or TE interrupt enabled. See also the configuration bit LCDC_DBIB_CFG_REG[LCDC_DBIB_TE_DIS] for the TE signal.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_JDI_ENB_END_HLINE_REG</name>
	<description>ENB end horizontal line</description>
	<addressOffset>0x000000bc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_JDI_ENB_END_HLINE</name>
	<description>The number of the last horizontal line where the ENB signal is asserted</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_JDI_ENB_START_CLK_REG</name>
	<description>ENB start delay</description>
	<addressOffset>0x000000c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_JDI_ENB_START_CLK</name>
	<description>Defines the number of the HCK half periods that should take place after a transtion in the VCK and before to be enabled of the ENB. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_JDI_ENB_START_HLINE_REG</name>
	<description>ENB start horizontal line</description>
	<addressOffset>0x000000b8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_JDI_ENB_START_HLINE</name>
	<description>The number of the first horizontal line where the ENB signal is asserted</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_JDI_ENB_WIDTH_CLK_REG</name>
	<description>ENB width</description>
	<addressOffset>0x000000c4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_JDI_ENB_WIDTH_CLK</name>
	<description>ENB (high) width in HCK half periods</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
