irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>LCDC_JDI_FBX_BLANKING_REG</name>
	<description>Horizontal front/back blanking (hck half periods)</description>
	<addressOffset>0x00000094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_JDI_FXBLANKING</name>
	<description>Horizontal front blanking as a number of hck half periods</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LCDC_JDI_BXBLANKING</name>
	<description>Horizontal back blanking as a number of hck half periods</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_JDI_FBY_BLANKING_REG</name>
	<description>Vertical front/back blanking (vck half periods)</description>
	<addressOffset>0x00000098</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_JDI_FYBLANKING</name>
	<description>Vertical front blanking as a number of vck half periods</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LCDC_JDI_BYBLANKING</name>
	<description>Vertical back blanking as a number of vck half periods</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_JDI_HCK_WIDTH_REG</name>
	<description>HCK high/low width</description>
	<addressOffset>0x0000009c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_JDI_HCK_WIDTH</name>
	<description>Number of formal pipeline clock cycles that define the half period of the of the HCK (high and low width). The minimum allowed value is 2.</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_JDI_HST_DELAY_REG</name>
	<description>VCK-to-HST delay</description>
	<addressOffset>0x000000b0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_JDI_HST_DELAY</name>
	<description>VCK-to-HST delay in format pipeline clock cycles</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_JDI_HST_WIDTH_REG</name>
	<description>HST width</description>
	<addressOffset>0x000000b4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_JDI_HST_WIDTH</name>
	<description>HST width in format pipeline clock cycles</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_JDI_RESXY_REG</name>
	<description>Resolution XY for the JDI parallel I/F</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_JDI_RES_X</name>
	<description>Number of horizontal transfers. Should be equal to the half of the horizontal resolution (in pixels).</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LCDC_JDI_RES_Y</name>
	<description>Number of vertical transfers. Should be equal to the double of the vertical resolution (in lines). </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_JDI_VCK_DELAY_REG</name>
	<description>XRST-to-VCK delay</description>
	<addressOffset>0x000000ac</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_JDI_VCK_DELAY</name>
	<description>XRST-to-VCK delay in format pipeline clock cycles</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_JDI_VST_DELAY_REG</name>
	<description>XRST-to-VST delay</description>
	<addressOffset>0x000000a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_JDI_VST_DELAY</name>
	<description>XRST-to-VST delay in format pipeline clock cycles</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_JDI_VST_WIDTH_REG</name>
	<description>VST width</description>
	<addressOffset>0x000000a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_JDI_VST_WIDTH</name>
	<description>VST width in format pipeline clock cycles</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_JDI_XRST_WIDTH_REG</name>
	<description>XRST width</description>
	<addressOffset>0x000000a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_JDI_XRST_WIDTH</name>
	<description>Number of format pipeline clock cycles of XRST width</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_LAYER0_BASEADDR_REG</name>
	<description>Layer0 Base Addr</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_L0_FB_ADDR</name>
	<description>Base Address of the frame buffer</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
