irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>LCDC_LAYER0_MODE_REG</name>
	<description>Layer0 Mode</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_L0_EN</name>
	<description>Enable layer.
0 : disable
1 : enable</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>LCDC_L0_COLOUR_MODE</name>
	<description>Colour Mode:
00001: 16-bit RGBX5551 color format,
00010: 32-bit RGBX8888 color format,
00100: 8-bit RGB332 color format,
00101: 16-bit RGB565 color format,
00110: 32-bit XRGB8888,
00111: L8 Grayscale/Palette format,
01000: L1 Grayscale/Palette format,
01001: L4 Grayscale/Palette format,
01101: ABGR8888,
01110: BGRA8888</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_LAYER0_OFFSETX_REG</name>
	<description>Layer0 OffsetX and DMA prefetch</description>
	<addressOffset>0x00000188</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_L0_DMA_PREFETCH</name>
	<description>DMA fifo prefetch level (range: 0-4)
0x0 : Prefetch mechanism is disabled
0x1 : Prefetch at least 44 bytes
0x2 : Prefetch at least 84 bytes
0x3 : Prefetch at least 116 bytes
0x4 : Prefetch at least 108 bytes
Any other value : Reserved</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LCDC_L0_OFFSETX</name>
	<description>Offset X (negative) of X start pixel (range [n-1,0], n : pixels /8)</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_LAYER0_RESXY_REG</name>
	<description>Layer0 Res XY</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_L0_RES_X</name>
	<description>Resolution X (Resolution of layer in pixels)</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LCDC_L0_RES_Y</name>
	<description>Resolution Y (Resolution of layer in pixels)</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_LAYER0_SIZEXY_REG</name>
	<description>Layer0 Size XY</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_L0_SIZE_X</name>
	<description>Size X (Size of layer in pixels)</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LCDC_L0_SIZE_Y</name>
	<description>Size Y (Size of layer in pixels)</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_LAYER0_STARTXY_REG</name>
	<description>Layer0 Start XY</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_L0_START_X</name>
	<description>Start X (offset pixels)</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LCDC_L0_START_Y</name>
	<description>Start Y (offset pixels)</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_LAYER0_STRIDE_REG</name>
	<description>Layer0 Stride</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_L0_FIFO_THR</name>
	<description>Layer dma fifo threshold burst start
00: half fifo (default)
01: 2 burst size
10: 4 burst size
11: 8 burst size</description>
	<access>read-write</access>
	<bitRange>[20:19]</bitRange>
	
</field><field>
	<name>LCDC_L0_BURST_LEN</name>
	<description>Layer burst length
000: 16-beats (default)
001: 2-beats
010: 4-beats
011: 8-beats
100: 16-beats</description>
	<access>read-write</access>
	<bitRange>[18:16]</bitRange>
	
</field><field>
	<name>LCDC_L0_STRIDE</name>
	<description>Layer Stride (distance from line to line in bytes)</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_MODE_REG</name>
	<description>Display Mode</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_MODE_EN</name>
	<description>Mode register.
0 : disable
1 : enable</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>LCDC_VSYNC_POL</name>
	<description>VSYNC polarity.
0: positive
1: negative</description>
	<access>read-write</access>
	<bitRange>[28:28]</bitRange>
	
</field><field>
	<name>LCDC_HSYNC_POL</name>
	<description>HSYNC polarity.
0: positive
1: negative</description>
	<access>read-write</access>
	<bitRange>[27:27]</bitRange>
	
</field><field>
	<name>LCDC_DE_POL</name>
	<description>DE polarity.
0: positive
1: negative</description>
	<access>read-write</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>LCDC_VSYNC_SCPL</name>
	<description>Set VSYNC for a single cycle per line.
0: disable
1: enable</description>
	<access>read-write</access>
	<bitRange>[23:23]</bitRange>
	
</field><field>
	<name>LCDC_PIXCLKOUT_POL</name>
	<description>Pixel clock out polarity.
0: positive
1: negative</description>
	<access>read-write</access>
	<bitRange>[22:22]</bitRange>
	
</field><field>
	<name>LCDC_FORCE_BLANK</name>
	<description>Forces output to blank.
0: disable
1: enable</description>
	<access>read-write</access>
	<bitRange>[19:19]</bitRange>
	
</field><field>
	<name>LCDC_SFRAME_UPD</name>
	<description>Single frame update.
0: disable
1: enable</description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>LCDC_PIXCLKOUT_SEL</name>
	<description>Selects the pixel out clock for the display.
0: based on the pixel pipeline clock
1: based on the format pipeline clock
See also the LCDC_CLKCTRL_REG.</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>LCDC_OUT_MODE</name>
	<description>Selection of the output mode
0000: Parallel RGB
1000: JDI MIP
All the other values are reserved.</description>
	<access>read-write</access>
	<bitRange>[8:5]</bitRange>
	
</field><field>
	<name>LCDC_MIPI_OFF</name>
	<description>MIPI off.
0: disabled
1: enabled</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>LCDC_FORM_OFF</name>
	<description>Formating off
0: disabled
1: enabled</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>LCDC_DSCAN</name>
	<description>Double horizontal scan
0: disabled
1: enabled</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LCDC_TMODE</name>
	<description>Test mode
0: disabled
1: enabled</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
