irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>LCDC_RESXY_REG</name>
	<description>Resolution X,Y</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_RES_X</name>
	<description>Resolution X in pixels.</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LCDC_RES_Y</name>
	<description>Resolution Y in pixels.</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LCDC_STATUS_REG</name>
	<description>Status Register</description>
	<addressOffset>0x000000fc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LCDC_JDI_TIM_SW_RST</name>
	<description>JDI timing generation soft reset (active high)</description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>LCDC_FRAME_START</name>
	<description>Frame start (active high)</description>
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>LCDC_FRAME_END</name>
	<description>Frame end (active high)</description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_CMD_PENDING</name>
	<description>Transferring of command in progress.
0: idle
1: in progress</description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_CMD_FIFO_FULL</name>
	<description>Command fifo full indication.
0: is not full
1: is full</description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_CMD_FIFO_EMPTY_N</name>
	<description>Command fifo empty indication (negative)
0: the fifo is empty
1: the fifo is not empty</description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>LCDC_DBIB_TE</name>
	<description>The DBIB tearing effect signal</description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>LCDC_STICKY_UNDERFLOW</name>
	<description>Sticky underflow(clear with write in the LCDC_INTERRUPT_REG)
0: There is no underflow
1: Underflow has been detected.Remains high until to be cleared by performing a write access on the register LCDC_INTERRUPT_REG.</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>LCDC_UNDERFLOW</name>
	<description>Underflow on the current transfer.
0: There is no underflow
1: Underflow has been detected. </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>LCDC_LAST_ROW</name>
	<description>Last row (Last row is currently displayed)</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>LCDC_STAT_CSYNC</name>
	<description>CSYNC signal level</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>LCDC_STAT_VSYNC</name>
	<description>VSYNC signal level</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>LCDC_STAT_HSYNC</name>
	<description>HSYNC signal level</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>LCDC_FRAMEGEN_BUSY</name>
	<description>The frame generator is busy (active high).</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LCDC_STAT_ACTIVE</name>
	<description>Active (When not in vertical blanking)</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>lra2522_busif_00</name>
	<version>1.0</version>
	<description>lra2522_busif_00 registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50030a00</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>92</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>LRA_ADC_CTRL1_REG</name>
	<description>General Purpose ADC Control Register</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000020</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LRA_ADC_BUSY</name>
	<description>0:ADC conversion ready.
1:ADC conversion in progress.</description>
	<access>read-only</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>LRA_ADC_OFFSET</name>
	<description>ADC offset signed value</description>
	<access>read-write</access>
	<bitRange>[16:9]</bitRange>
	
</field><field>
	<name>LRA_ADC_TEST_PARAM</name>
	<description>Select which inputs will be enabled on the ADC.
0,1 = normal inputs (i.e. both I and Q inputs connected to LRA-current-sense voltage source)
2 = I channel connected to the analog input testbus on PORTS TBD, Q channel is muted.
3 =QI channel connected to the analog input testbus on PORTS TBD, I channel is muted.
Note: The LRA_ADC_CTRL1_REG[ADC_MUTE] field takes precedence over this test functionality. </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>LRA_ADC_TEST_IN_SEL</name>
	<description>Select analog testbus on ADC input.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>LRA_ADC_FREQ</name>
	<description>ADC clock divider</description>
	<access>read-write</access>
	<bitRange>[6:3]</bitRange>
	
</field><field>
	<name>LRA_ADC_SIGN</name>
	<description>Change polarity of ADC input</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>LRA_ADC_MUTE</name>
	<description>0: Normal operation
1: Short the inputs of the ADC (used for DC offset cal) </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LRA_ADC_START</name>
	<description>0: ADC conversion ready.
1: If a 1 is written, the ADC starts a conversion. After the conversion this bit will be set to 0 and the GP_ADC_INT bit will be set. It is not allowed to write this bit while it is not (yet) zero. </description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
