irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>LRA_ADC_CTRL2_REG</name>
	<description>Haptic Feedback Driver Current Sense ADC Control Register 2</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>ADC_OFFN_I_WR</name>
	<description>External value for the DC offset compensation in the I path negative side. With common mode input voltage at Vpwrp/2, this value is 512-ADC_OFFP_Q_WR. </description>
	<access>read-write</access>
	<bitRange>[17:9]</bitRange>
	
</field><field>
	<name>ADC_OFFP_I_WR</name>
	<description>External value for the DC offset compensation in the I path positive side. </description>
	<access>read-write</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_ADC_CTRL3_REG</name>
	<description>Haptic Feedback Driver Current Sense ADC Control Register 3</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>ADC_OFFN_Q_WR</name>
	<description>External value for the DC offset compensation in the Q path negative side. With common mode input voltage at Vpwrp/2, this value is 512-ADC_OFFP_Q_WR. </description>
	<access>read-write</access>
	<bitRange>[17:9]</bitRange>
	
</field><field>
	<name>ADC_OFFP_Q_WR</name>
	<description>External value for the DC offset compensation in the Q path positive side. </description>
	<access>read-write</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_ADC_RESULT_REG</name>
	<description>General Purpose ADC Result Register</description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00004000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MAN_FLT_IN</name>
	<description>Manual value to replace the ADC output. Select its use by FLT_IN_SEL.</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>GP_ADC_VAL</name>
	<description>Returns the 10 up to 16 bits linear value of the last AD conversion. The upper 10 bits are always valid, the lower 6 bits are only valid in case oversampling has been applied. Two samples results in one extra bit and 64 samples results in six extra bits.</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_BRD_HS_REG</name>
	<description>LRA Bridge Register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TRIM_GAIN</name>
	<description>Current-sensing amplifier gain settings:
0001: x6
0010: x8
0100: x10
1000: x12</description>
	<access>read-write</access>
	<bitRange>[14:11]</bitRange>
	
</field><field>
	<name>HSGND_TRIM</name>
	<description>HS gnd trim</description>
	<access>read-write</access>
	<bitRange>[10:8]</bitRange>
	
</field><field>
	<name>SCP_HS_TRIM</name>
	<description>HS short-circuit protection limit trimming</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>SCP_HS_EN</name>
	<description>HS short-circuit protection enable</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>ERC_HS_TRIM</name>
	<description>HS edge-rate control trimming. Lowto-High switching slewing:
00: 25 MV/s
01: 50 MV/s
10: 75 MV/s
11: 100 MV/s</description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	
</field><field>
	<name>ERC_HS_EN</name>
	<description>HS edge-rate control enable</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_BRD_LS_REG</name>
	<description>LRA Bridge Register</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00004fff</resetMask>
	<fields>
	<field>
	<name>SCP_LS_TRIM_N</name>
	<description>LSN short-circuit protection limit trimming</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>SCP_LS_TRIM_P</name>
	<description>LSP short-circuit protection limit trimming</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>SCP_LS_EN</name>
	<description>LS short-circuit protection enable</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>ERC_LS_TRIM</name>
	<description>LS edge-rate control trimming. High-to-Low switching slewing:
00: 25 MV/s
01: 50 MV/s
10: 75 MV/s
11: 100 MV/s</description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	
</field><field>
	<name>ERC_LS_EN</name>
	<description>LS edge-rate control enable</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_BRD_STAT_REG</name>
	<description>LRA Bridge Staus Register</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SCP_HS_OUT</name>
	<description>HS short circuit comparator output</description>
	<access>read-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>SCP_LS_COMP_OUT_N</name>
	<description>LSN short circuit comparator output</description>
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>SCP_LS_COMP_OUT_P</name>
	<description>LSP short circuit comparator output</description>
	<access>read-only</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>SC_EVENT_LS</name>
	<description>1: LS short-circuit event detected
0: no LS short-circuit event detected</description>
	<access>read-only</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>SC_EVENT_HS</name>
	<description>1: HS short-circuit event detected
0: no HS short-circuit event detected</description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>LOOP_STAT</name>
	<description>1: Loop saturation detected
0: Loop not saturated</description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>LSN_ON</name>
	<description>LSN control status</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>LSP_ON</name>
	<description>LSP control status</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>HSN_ON</name>
	<description>HSN control status</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>HSP_ON</name>
	<description>HSP control status</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>LSN_STAT</name>
	<description>LSN power FET gate actual status</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>LSP_STAT</name>
	<description>LSP power FET gate actual status</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>HSN_STAT</name>
	<description>HSN power FET gate actual status</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>HSP_STAT</name>
	<description>HSP power FET gate actual status</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
