irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>LRA_CTRL1_REG</name>
	<description>General Purpose LRA Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000071c0</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SMP_IDX</name>
	<description>Current bin index (0-15). Check if equal to IRQ_IDX before and/or after updating HALF_PERIOD with ISR.</description>
	<access>read-only</access>
	<bitRange>[27:24]</bitRange>
	
</field><field>
	<name>IRQ_SCP_EVENT_EN</name>
	<description>0 = interrupt scp event disabled
1 = interupt scp event enabled</description>
	<access>read-write</access>
	<bitRange>[18:18]</bitRange>
	
</field><field>
	<name>IRQ_ADC_EN</name>
	<description>0 = interrupt adc disabled
1 = interupt adc enabled</description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>IRQ_CTRL_EN</name>
	<description>0 = interrupt controller disabled
1 = interupt controller enabled</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>IRQ_IDX</name>
	<description>At which sample index an IRQ will be generated (0-15). When IRQ_IDX &lt; 8, IRQs are generated at both half cycles (IRQ_IDX and IRQ_IDX+8), otherwise only in the second half cycle.</description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	
</field><field>
	<name>IRQ_DIV</name>
	<description>Divider value of the interrupt request. Number of LRA/ERM periods, between successive IRQs. 0,1=every (half) cycle, depending on IRQ_IDX; 2=every second cycle, IRQ at the end of first or both half cycles (based on IRQ_IDX), etc.</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>SMP_SEL</name>
	<description>Select which samples to store for the resonance control algorithm.
0=Sense voltage after down-sampling
1=Error voltage (after subtraction of VREF and down-sampled sense voltgae input)
2=Duty cycle signal after loop-filter
3=Duty cycle signal after summation with DREF</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>PULLDOWN_EN</name>
	<description>LXP and LXN node pull down enbale, when SC_EVENT=0 &amp;&amp; LOOP_EN=0</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>LOOP_EN</name>
	<description>0=disable loop
1=enable loop</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>LDO_EN</name>
	<description>0=lra ldo disabled
1=lra ldo enabled</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>ADC_EN</name>
	<description>0=lra adc disabled
1=lra adc enabled</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>HBRIDGE_EN</name>
	<description>0=hbridge disabled
1=hbridge enabled</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LRA_EN</name>
	<description>0=lra controller disabled
1=lra controller enabled</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_CTRL2_REG</name>
	<description>General Purpose LRA Control Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x02710000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>HALF_PERIOD</name>
	<description>Half of the LRA period, in units of 4 ms (= 125 kHz divided by the resonant frequency of the LRA).</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>AUTO_MODE</name>
	<description>Automatic frequency control (0=disabled;, 1=enabled, not yet implemented)</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>SMP_MODE</name>
	<description>Sampling mode for data aiding automatic resonance control (0=averaging, 1=last sample)</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>POLARITY</name>
	<description>Polarity of the square wave (0=normal; 1=inverted); Use for rapid stop.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>FLT_IN_SEL</name>
	<description>0 = normal operation
1 = ADC output overruled by register value TBD</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>PWM_MODE</name>
	<description>PWM pulse placement: 0=middle, 1=left, 2=right, 3=alternate</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_CTRL3_REG</name>
	<description>General Purpose LRA Control Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00004000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>VREF</name>
	<description>Voltage reference for haptic feedback driver (1 bit sign + 7 bits integer + 8 bits fractional. (range -128 ... +127.99).
The voltage is computed based on the desired reference current (IREF) that flows into the haptic device.
VREF = IREF*TRIM_GAIN*128/2.4, with IREF in Amperes and TRIM_GAIN = 6, 8 (default), 10 or 12 as defined in LRA_BRD_HS_REG.</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>DREF</name>
	<description>Duty cycle reference, start value from which the current control loop settles (1 sign bit, 7 integer bits, 8 fractional bits, -128 ... +127.99). Valid settings 5% through 95% (0x0666 - 0x799A).</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_DFT_REG</name>
	<description>LRA test Register</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SPARE</name>
	<description>spare registers bits , currently not used</description>
	<access>read-write</access>
	<bitRange>[31:29]</bitRange>
	
</field><field>
	<name>SWM_SEL</name>
	<description>0=use SWM from controller
1=use SWM_MAN</description>
	<access>read-write</access>
	<bitRange>[28:28]</bitRange>
	
</field><field>
	<name>SWM_MAN</name>
	<description>swm manual</description>
	<access>read-write</access>
	<bitRange>[27:27]</bitRange>
	
</field><field>
	<name>PWM_SEL</name>
	<description>0=use PWM from controller
1=use PWM_MAN</description>
	<access>read-write</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>PWM_MAN</name>
	<description>pwm manual</description>
	<access>read-write</access>
	<bitRange>[25:25]</bitRange>
	
</field><field>
	<name>TIMER_TRIM</name>
	<description>20ns unit delay cell trimming bits</description>
	<access>read-write</access>
	<bitRange>[24:23]</bitRange>
	
</field><field>
	<name>TIMER_SCALE_TRIM</name>
	<description>Selection of delay of MAG and DEMAG signal:
00: 60ns
01: 80ns
10: 100ns
11: 120ns</description>
	<access>read-write</access>
	<bitRange>[22:21]</bitRange>
	
</field><field>
	<name>DFT_SEL</name>
	
	<access>read-write</access>
	<bitRange>[20:20]</bitRange>
	
</field><field>
	<name>DFT_FORCE_HSPN</name>
	<description>Force HSP and HSN power FETs on:
0: not actived
1: HSP and HSN are forced on</description>
	<access>read-write</access>
	<bitRange>[19:19]</bitRange>
	
</field><field>
	<name>DFT_EN_TIMER</name>
	<description>Enable for the timer trimming</description>
	<access>read-write</access>
	<bitRange>[18:18]</bitRange>
	
</field><field>
	<name>DFT_STALL</name>
	<description>Force state machine in a certain state:
00: No test
01: High-Z
10: Mag
11: Demag</description>
	<access>read-write</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>DFT_CTRL</name>
	<description>Selection of test bus connection</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
