irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>LRA_FLT_COEF1_REG</name>
	<description>LRA Filter Coefficient Register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x019a0e66</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>FLT_COEF_01</name>
	<description>Loop filter state-space coefficient a12 (1 sign bit, 1 integer bit, 14 fractional bits, range -2.000 .. +1.999).</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>FLT_COEF_00</name>
	<description>Loop filter state-space coefficient a11 (1 sign bit, 1 integer bit, 14 fractional bits, range -2.000 .. +1.999).</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_FLT_COEF2_REG</name>
	<description>LRA Filter Coefficient Register</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0e660f3e</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>FLT_COEF_10</name>
	<description>Loop filter state-space coefficient a21 (1 sign bit, 1 integer bit, 14 fractional bits, range -2.000 .. +1.999).</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>FLT_COEF_02</name>
	<description>Loop filter state-space coefficient b1 (1 sign bit, 1 integer bit, 14 fractional bits, range -2.000 .. +1.999).</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_FLT_COEF3_REG</name>
	<description>LRA Filter Coefficient Register</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x16ce019a</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>FLT_COEF_12</name>
	<description>Loop filter state-space coefficient b2 (1 sign bit, 1 integer bit, 14 fractional bits, range -2.000 .. +1.999).</description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>FLT_COEF_11</name>
	<description>Loop filter state-space coefficient a22 (1 sign bit, 1 integer bit, 14 fractional bits, range -2.000 .. +1.999).</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_FLT_SMP1_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LRA_SMP_2</name>
	<description>Second sample in first half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LRA_SMP_1</name>
	<description>First sample in first half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_FLT_SMP2_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LRA_SMP_4</name>
	<description>Fourth sample in first half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LRA_SMP_3</name>
	<description>Third sample in first half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_FLT_SMP3_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LRA_SMP_6</name>
	<description>Sixth sample in first half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LRA_SMP_5</name>
	<description>Fifth sample in first half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_FLT_SMP4_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LRA_SMP_8</name>
	<description>Eighth sample in first half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LRA_SMP_7</name>
	<description>Seventh sample in first half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_FLT_SMP5_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LRA_SMP_10</name>
	<description>Second sample in second half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LRA_SMP_9</name>
	<description>First sample in second half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_FLT_SMP6_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LRA_SMP_12</name>
	<description>Fourth sample in second half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LRA_SMP_11</name>
	<description>Third sample in second half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
