irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>LRA_FLT_SMP7_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LRA_SMP_14</name>
	<description>Sixth sample in second half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LRA_SMP_13</name>
	<description>Fifth sample in second half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_FLT_SMP8_REG</name>
	<description>LRA Sample Register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LRA_SMP_16</name>
	<description>Eighth sample in second half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[31:16]</bitRange>
	
</field><field>
	<name>LRA_SMP_15</name>
	<description>Seventh sample in second half-cycle used for resonance control algorithm.</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>LRA_LDO_REG</name>
	<description>LRA LDO Regsiter</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>LDO_OK</name>
	<description>0: LDO not yet ok
1: LDO voltage is ready</description>
	<access>read-only</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>LDO_TST</name>
	<description>When set to 1, LDO output is connected to the testbus through a test switch</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>LDO_VREF_HOLD</name>
	<description>0: Indicates that the reference input is tracked,
1: Indicates that the reference input is sampled</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>MEMCTRL</name>
	<version>1.0</version>
	<description>MEMCTRL registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50050000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>128</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>BUSY_RESET_REG</name>
	
	<addressOffset>0x00000078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>BUSY_SPARE</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[31:30]</bitRange>
	
</field><field>
	<name>BUSY_MOTOR</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[29:28]</bitRange>
	
</field><field>
	<name>BUSY_TIMER2</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[27:26]</bitRange>
	
</field><field>
	<name>BUSY_TIMER</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[25:24]</bitRange>
	
</field><field>
	<name>BUSY_UART3</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[23:22]</bitRange>
	
</field><field>
	<name>BUSY_GPADC</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[21:20]</bitRange>
	
</field><field>
	<name>BUSY_PDM</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[19:18]</bitRange>
	
</field><field>
	<name>BUSY_SRC</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>BUSY_PCM</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[15:14]</bitRange>
	
</field><field>
	<name>BUSY_SDADC</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	
</field><field>
	<name>BUSY_I2C2</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[11:10]</bitRange>
	
</field><field>
	<name>BUSY_I2C</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>BUSY_SPI2</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>BUSY_SPI</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>BUSY_UART2</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>BUSY_UART</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
