irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>BUSY_SET_REG</name>
	
	<addressOffset>0x00000074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>BUSY_SPARE</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[31:30]</bitRange>
	
</field><field>
	<name>BUSY_MOTOR</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[29:28]</bitRange>
	
</field><field>
	<name>BUSY_TIMER2</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[27:26]</bitRange>
	
</field><field>
	<name>BUSY_TIMER</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[25:24]</bitRange>
	
</field><field>
	<name>BUSY_UART3</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[23:22]</bitRange>
	
</field><field>
	<name>BUSY_GPADC</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[21:20]</bitRange>
	
</field><field>
	<name>BUSY_PDM</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[19:18]</bitRange>
	
</field><field>
	<name>BUSY_SRC</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>BUSY_PCM</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[15:14]</bitRange>
	
</field><field>
	<name>BUSY_SDADC</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[13:12]</bitRange>
	
</field><field>
	<name>BUSY_I2C2</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[11:10]</bitRange>
	
</field><field>
	<name>BUSY_I2C</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>BUSY_SPI2</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>BUSY_SPI</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>BUSY_UART2</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>BUSY_UART</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<access>writeonce</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>BUSY_STAT_REG</name>
	
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>BUSY_SPARE</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[31:30]</bitRange>
	
</field><field>
	<name>BUSY_MOTOR</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[29:28]</bitRange>
	
</field><field>
	<name>BUSY_TIMER2</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[27:26]</bitRange>
	
</field><field>
	<name>BUSY_TIMER</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[25:24]</bitRange>
	
</field><field>
	<name>BUSY_UART3</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[23:22]</bitRange>
	
</field><field>
	<name>BUSY_GPADC</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[21:20]</bitRange>
	
</field><field>
	<name>BUSY_PDM</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[19:18]</bitRange>
	
</field><field>
	<name>BUSY_SRC</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>BUSY_PCM</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[15:14]</bitRange>
	
</field><field>
	<name>BUSY_SDADC</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[13:12]</bitRange>
	
</field><field>
	<name>BUSY_I2C2</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[11:10]</bitRange>
	
</field><field>
	<name>BUSY_I2C</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>BUSY_SPI2</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>BUSY_SPI</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>BUSY_UART2</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>BUSY_UART</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<access>read-only</access>
	<bitRange>[1:0]</bitRange>
	
