irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>CMI_CODE_BASE_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0007ffff</resetMask>
	<fields>
	<field>
	<name>CMI_CODE_BASE_ADDR</name>
	<description>Base address for CMAC code with steps of 1 kB.
0x001: 1 kB base address
0x010: 16 kB base address
0x100: 256 kB base address</description>
	<access>read-write</access>
	<bitRange>[18:10]</bitRange>
	
</field></fields>
</register><register>
	<name>CMI_DATA_BASE_REG</name>
	
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0007ffff</resetMask>
	<fields>
	<field>
	<name>CMI_DATA_BASE_ADDR</name>
	<description>Base address for CMAC data with steps of 4 bytes.
0x00001: 4 byte base address
0x00010: 64 byte base address
0x00100: 1 kB base address
0x01000: 16 kB base address
0x10000: 256 kB base address</description>
	<access>read-write</access>
	<bitRange>[18:2]</bitRange>
	
</field></fields>
</register><register>
	<name>CMI_END_REG</name>
	
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0007ffff</resetValue>
	<resetMask>0x0007ffff</resetMask>
	<fields>
	<field>
	<name>CMI_END_ADDR</name>
	<description>End address for CMAC code and data accesses with steps of 1 kB.
0x000: accesses up to 1kB are allowed
0x001: accesses up to 2kB are allowed
0x01F: accesses up to 32kB are allowed
0x1FF: accesses up to 512kB are allowed</description>
	<access>read-write</access>
	<bitRange>[18:10]</bitRange>
	
</field></fields>
</register><register>
	<name>CMI_SHARED_BASE_REG</name>
	
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0007ffff</resetMask>
	<fields>
	<field>
	<name>CMI_SHARED_BASE_ADDR</name>
	<description>Base address for CMAC shared data with steps of 1 kB.
0x001: 1 kB base address
0x010: 16 kB base address
0x100: 256 kB base address</description>
	<access>read-write</access>
	<bitRange>[18:10]</bitRange>
	
</field></fields>
</register><register>
	<name>MEM_CTRL_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000006</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields>
	<field>
	<name>ROM_MARGIN_EN</name>
	<description>ROM read and write margin enable.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>ROM_MARGIN_CTRL</name>
	<description>ROM read and write margin control.</description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>RAM_DST</name>
	<description>RAM Disable-Self-Time. When asserted high, overrides the self-timed circuitry and causes the read margin to be controlled by the falling clock edge. Requires RAM_MARGIN to be set to "00".</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RAM_LPMX</name>
	<description>RAM Transparent Light Sleep (TLS) Core Enable. Assert low to enable the TLS core feature, which will result in lower leakage current.
It is required to power-on with this pin high (disabled) until the VDD supply is stable.
In case VDD is lowered below nominal-10%, it may be necessary to hold this pin high to maintain data retention.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RAM_MARGIN</name>
	<description>RAM read and write margin control. Setting "10" is recommended.
00: Provides the most margin (slowest speed).
11: Provides the least margin (fastest speed).</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>MEM_PRIO_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>AHB_PRIO</name>
	
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>AHB2_PRIO</name>
	
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>SNC_PRIO</name>
	
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>MEM_STALL_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000fff</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>AHB_MAX_STALL</name>
	
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>AHB2_MAX_STALL</name>
	
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>SNC_MAX_STALL</name>
	
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>MEM_STATUS2_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>RAM8_OFF_BUT_ACCESS</name>
	
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>RAM7_OFF_BUT_ACCESS</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>RAM6_OFF_BUT_ACCESS</name>
	
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>RAM5_OFF_BUT_ACCESS</name>
	
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>RAM4_OFF_BUT_ACCESS</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RAM3_OFF_BUT_ACCESS</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RAM2_OFF_BUT_ACCESS</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RAM1_OFF_BUT_ACCESS</name>
	
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>MEM_STATUS_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>CMI_CLEAR_READY</name>
	
