irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
	<access>write-only</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>CMI_NOT_READY</name>
	
	<access>read-only</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>AHB2_WR_BUFF_CNT</name>
	
	<access>read-only</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>AHB_WR_BUFF_CNT</name>
	
	<access>read-only</access>
	<bitRange>[7:4]</bitRange>
	
</field><field>
	<name>AHB2_CLR_WR_BUFF</name>
	
	<access>write-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>AHB_CLR_WR_BUFF</name>
	
	<access>write-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>AHB2_WRITE_BUFF</name>
	
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>AHB_WRITE_BUFF</name>
	
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SNC_BASE_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0007ffff</resetMask>
	<fields>
	<field>
	<name>SNC_BASE_ADDRESS</name>
	<description>Base address for SNC interface with steps of 4 bytes.
0x00001: 4 byte base address
0x00010: 64 byte base address
0x00100: 1 kB base address
0x01000: 16 kB base address
0x10000: 256 kB base address</description>
	<access>read-write</access>
	<bitRange>[18:2]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>OTPC</name>
	<version>1.0</version>
	<description>OTPC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x30070000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>24</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>OTPC_MODE_REG</name>
	<description>Mode register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_MODE_PRG_SEL</name>
	<description>Defines the part of the OTP cell that is programmed by the controller during the PROG mode, for each program request that is applied.
0x0 : Both normal and redundancy arrays are programmed. This is the normal way of programming.
0x1 : Only the normal array is programmed.
0x2 : Only the redundancy array is programmed.
0x3 : Reserved
The value of this configuration field can be modified only when the controller is in an inactive mode (PDOWN, DSTBY, STBY). The setting will take effect when will be enabled again the PROG mode.</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>OTPC_MODE_HT_MARG_EN</name>
	<description>Defines the temperature condition under which is performed a margin read. It affects only the initial margin read (RINI mode) and the programming verification margin read (PVFY).
0 : Regular temperature condition
1 : High temperature condition
The value of this configuration field can be modified only when the controller is in an inactive mode (PDOWN, DSTBY, STBY). The selection will take effect at the next PVFY or RINI mode that will be enabled. The READ mode is not affected by the setting of this configuration bit.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>OTPC_MODE_USE_TST_ROW</name>
	<description>Selects the memory area of the OTP cell that will be used.
0 - Uses the main memory area of the OTP cell
1 - Uses the test row of the OTP cell
The value of this configuration field can be modified only when the controller is in an inactive mode (PDOWN, DSTBY, STBY). The selection will take effect at the next programming or reading mode that will be enabled.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>OTPC_MODE_MODE</name>
	<description>Defines the mode of operation of the OTPC controller. The encoding of the modes is as follows:
0x0: PDOWN. The power supply of the OTP memory is OFF.
0x1: DSTBY. The OTP memory is in deep standby mode (power supply ON and internal LDO OFF).
0x2: STBY. The OTP memory is powered (power supply ON and internal LDO ON, but is not selected.
0x3: READ. The OTP memory is in the normal read mode.
0x4: PROG. The OTP memory is in programming mode.
0x5: PVFY. The OTP memory is in programming verification mode (margin read after programming).
0x6: RINI. The OTP memory is in initial read mode (initial margin read).
0x7: Reserved.

Whenever the OTPC_MODE_REG[MODE] is changing, the status bit OTPC_STAT_REG[OTPC_STAT_MRDY] gets the value zero. The new mode will be ready for use when the OTPC_STAT_MRDY become again 1. During the mode transition the OTPC_MODE_REG[MODE] become read only. Do not try to use or change any function of the controller until the OTPC_STAT_MRDY bit to become equal to 1.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>OTPC_PADDR_REG</name>
	<description>The address of the word that will be programmed, when the PROG mode is used.</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_PADDR</name>
	<description>The OTPC_PADDR_REG and the OTPC_PWORD_REG consist the PBUF buffer that keeps the information that will be programmed in the OTP, by using the PROG mode. The PBUF holds the address (OTPC_PADDR_REG) and the data (OTPC_PWORD_REG) of each of the programming requests that are applied in the OTP memory.
The OTPC_PADDR_REG refers to a word address. The OTPC_PADDR_REG has to be writen after the OTP_PWORD_REG and only if the OTPC_STAT_REG[OTPC_STAT_PBUF_EMPTY]=1. The register is read only for as long the PBUF is not empty (OTPC_STAT_REG[OTPC_STAT_PBUF_EMPTY]=0). A writting to the OTPC_PADDR_REG triggers the controller to start the programming procedure (only if the PROG mode is active).</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
