irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>OTPC_PWORD_REG</name>
	<description>The 32-bit word that will be programmed, when the PROG mode is used.</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_PWORD</name>
	<description>The OTPC_PADDR_REG and the OTPC_PWORD_REG consist the PBUF buffer that keeps the information that will be programmed in the OTP memory, by using the PROG mode. The PBUF holds the address (OTPC_PADDR_REG) and the data (OTPC_PWORD_REG) of each of the programming requests that are applied in the OTP memory.
The OTP_PWORD_REG must be written before the OTPC_PADDR_REG and only if OTPC_STAT_REG[OTPC_STAT_PBUF_EMPTY] = 1. The register is read only for as long the PBUF is not empty (OTPC_STAT_REG[OTPC_STAT_PBUF_EMPTY]=0). </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>OTPC_STAT_REG</name>
	<description>Status register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000007</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_STAT_MRDY</name>
	<description>Indicates the progress of the transition from a mode of operation to a new mode of operation.
0 : There is a transition in progress in a new mode of operation . Wait until the transition to be completed.
1 : The transition to the new mode of operation has been completed. The function that has been enabled by the new mode can be used. A new mode can be applied.
This status bit gets the value zero every time where the OTPC_MODE_REG[MODE] is changing. Do not try to use or change any function of the controller until this status bit to becomes equal to 1.</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>OTPC_STAT_PBUF_EMPTY</name>
	<description>Indicates the status of the programming buffer (PBUF).
0 : The PBUF contains the address and the data of a programming request. The OTPC_PADDR_REG and the OTPC_PWORD_REG should not be written as long as this status bit is zero.
1 : The PBUF is empty and a new programming request can be registered in the PBUF by using the OTPC_PADDR_REG and the OTPC_PWORD_REG registers.
This status bit gets the value zero every time where a progrmaming is triggered by the OTPC_PADDR_REG (only if the PROG mode is active).</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>OTPC_STAT_PRDY</name>
	<description>Indicates the state of the programming process.
0: The controller is busy. A programming is in progress.
1: The logic which performs programming is idle.</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>OTPC_TIM1_REG</name>
	<description>Various timing parameters of the OTP cell.</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0999101f</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_TIM1_US_T_CSP</name>
	<description>The number of microseconds (minus one) that are required after the selection of the OTP memory, until to be ready for programming. It must be :
- at least 10us
- no more than 100us</description>
	<access>read-write</access>
	<bitRange>[30:24]</bitRange>
	
</field><field>
	<name>OTPC_TIM1_US_T_CS</name>
	<description>The number of microseconds (minus one) that are required after the selection of the OTP memory, until to be ready for any kind of read. It must be at least 10us.</description>
	<access>read-write</access>
	<bitRange>[23:20]</bitRange>
	
</field><field>
	<name>OTPC_TIM1_US_T_PL</name>
	<description>The number of microseconds (minus one) that are required until to be enabled the LDO of the OTP. It must be at least 10us.</description>
	<access>read-write</access>
	<bitRange>[19:16]</bitRange>
	
</field><field>
	<name>OTPC_TIM1_CC_T_RD</name>
	<description>The number of hclk_c clock periods (minus one) that give a time interval at least higher than 60ns. This timing parameter refers to the access time of the OTP memory.</description>
	<access>read-write</access>
	<bitRange>[14:12]</bitRange>
	
</field><field>
	<name>OTPC_TIM1_CC_T_20NS</name>
	<description>The number of hclk_c clock periods (minus one) that give a time interval that is at least higher than 20 ns.</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>OTPC_TIM1_CC_T_1US</name>
	<description>The number of hclk_c clock periods (minus one) that give a time interval equal to 1us. This setting affects all the timing parameters that refer to microseconds, due to that defines the correspondence of a microsecond to a number of hclk_c clock cycles.</description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	
</field></fields>
</register><register>
	<name>OTPC_TIM2_REG</name>
	<description>Various timing parameters of the OTP cell.</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7fffffff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>OTPC_TIM2_US_ADD_CC_EN</name>
	<description>Adds an additional hclk_c clock cycle at all the time intervals that count in microseconds.
0 : The extra hclk_c clock cycle is not applied
1 : The extra hclk_c clock cycle is applied</description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	
</field><field>
	<name>OTPC_TIM2_US_T_SAS</name>
	<description>The number of microseconds (minus one) that are required after the exit from the deep sleep standby mode and before to become ready to enter in an active mode (reading or programming). It must be at least 2us.</description>
	<access>read-write</access>
	<bitRange>[30:29]</bitRange>
	
</field><field>
	<name>OTPC_TIM2_US_T_PPH</name>
	<description>The number of microseconds (minus one) that are required after the last programming pulse and before to be disabled the programming mode in the OTP memory. It must be:
- at least 5us
- no more than 20us</description>
	<access>read-write</access>
	<bitRange>[28:24]</bitRange>
	
</field><field>
	<name>OTPC_TIM2_US_T_VDS</name>
	<description>The number of microseconds (minus one) that are required after the enabling of the power supply of the OTP memory and before to become ready for the enabling of the internal LDO. It must be at least 1us.</description>
	<access>read-write</access>
	<bitRange>[23:21]</bitRange>
	
</field><field>
	<name>OTPC_TIM2_US_T_PPS</name>
	<description>The number of microseconds (minus one) that are required after the enabling of the programming in the OTP memory and before to be applied the first programming pulse. It must be :
- at least 5us
- no more than 20us</description>
	<access>read-write</access>
	<bitRange>[20:16]</bitRange>
	
</field><field>
	<name>OTPC_TIM2_US_T_PPR</name>
	<description>The number of microseconds (minus one) for recovery after a programming sequence. It must be :
- at least 5us
- no more than 100us</description>
	<access>read-write</access>
	<bitRange>[14:8]</bitRange>
	
</field><field>
	<name>OTPC_TIM2_US_T_PWI</name>
	<description>The number of microseconds (minus one) between two consecutive programming pulses. It must be :
- at least 1us
- no more than 5us</description>
	<access>read-write</access>
	<bitRange>[7:5]</bitRange>
	
</field><field>
	<name>OTPC_TIM2_US_T_PW</name>
	<description>The number of microseconds (minus one) that lasts the programming of each bit. It must be :
- at least 10us
- no more than 20us</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
