irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>PATCH</name>
	<version>1.0</version>
	<description>PATCH registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x30090000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>208</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>PATCH_ADDR0_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR10_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000070</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR11_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR12_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR13_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000088</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR14_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR15_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000098</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR16_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x000000a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR17_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x000000a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR18_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x000000b0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR19_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x000000b8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
