irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>PATCH_ADDR1_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR20_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x000000c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_D</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs, the reading data bus willl be replaced by the value of the corresponding PATCH_DATAx_REG.</description>
	<access>read-write</access>
	<bitRange>[16:2]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR21_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x000000c8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_D</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs, the reading data bus willl be replaced by the value of the corresponding PATCH_DATAx_REG.</description>
	<access>read-write</access>
	<bitRange>[16:2]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR2_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR3_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR4_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR5_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR6_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR7_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR8_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_ADDR9_REG</name>
	<description>Patch Address field</description>
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00900000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_ADDR_C</name>
	<description>The value which will be compared with the address on the AHB. If a match occurs then it is considered as the base address of a function.</description>
	<access>read-write</access>
	<bitRange>[16:1]</bitRange>
	
