irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>PATCH_DATA20_REG</name>
	<description>Patch Data field</description>
	<addressOffset>0x000000c4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_DATA</name>
	<description>This is the value which will be injected into the data bus if there is a match on the comparison of the address with the respective PATCH_ADDRx_REG </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_DATA21_REG</name>
	<description>Patch Data field</description>
	<addressOffset>0x000000cc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_DATA</name>
	<description>This is the value which will be injected into the data bus if there is a match on the comparison of the address with the respective PATCH_ADDRx_REG </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PATCH_VALID_REG</name>
	<description>Validity Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PATCH_VALID</name>
	<description>Indicates which patch entry is valid. For example, when bit x is high it indicates that entry x is valid, i.e. the values of PATCH_ADDRx_REG / PATCH_DATAx_REG, are effective. </description>
	<access>read-write</access>
	<bitRange>[21:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>PDC</name>
	<version>1.0</version>
	<description>PDC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000200</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>152</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>PDC_ACKNOWLEDGE_REG</name>
	<description>Clear a pending PDC bit</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>PDC_ACKNOWLEDGE</name>
	<description>Writing to this field acknowledges the PDC IRQ request.
The data controls which request is acknowledged</description>
	<access>write-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PDC_CTRL0_REG</name>
	<description>PDC control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>PDC_MASTER</name>
	<description>Chooses which master is triggered when waking up
0x0: entry is disabled.
0x1: PD_SYS is woken up and CM33 is triggered
0x2: PD_RAD is woken up and CMAC is triggered
0x3: PD_COM is woken up and SNC is triggered</description>
	<access>read-write</access>
	<bitRange>[12:11]</bitRange>
	
</field><field>
	<name>EN_COM</name>
	<description>If set, enables PD_COM for GPIO access. This bit is implied when PDC_MASTER=SNC</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>EN_PER</name>
	<description>If set, enables PD_PER</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>EN_TMR</name>
	<description>If set, enables PD_TMR</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>EN_XTAL</name>
	<description>If set, the XTAL32M will be started</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>TRIG_ID</name>
	<description>Selects which individual bit from the selected bank is used for wakup.
For the peripheral banks, selected with TRIG_SELECT = 0x2 or 0x3, only the lower 4 bits are considered.</description>
	<access>read-write</access>
	<bitRange>[6:2]</bitRange>
	
</field><field>
	<name>TRIG_SELECT</name>
	<description>Selects which bank is used as wakeup trigger
When TRIG_SELECT is 0x0, selects GPIO port0 through the WAKEUP block.
When TRIG_SELECT is 0x1, selects GPIO port1 through the WAKEUP block.
When TRIG_SELECT is 0x2 or 0x3, selects the peripheral IRQ.

peripheral IRQ table:
0x0: Timer
0x1: Timer2
0x2: Timer3
0x3: Timer4
0x4: RTC Alarm/Rollover
0x5: RTC Timer
0x6: CMAC Timer OR wake up from CMAC debugger
0x7: Motor Controller
0x8: XTAL32MRDY_IRQ
0x9: RFDIAG_IRQ
0xA: CMAC2SYS_IRQ OR VBUS Present IRQ OR JTAG present OR Debounced IO
0xB to 0xE: reserved
0xF: Software trigger only
</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PDC_CTRL10_REG</name>
	<description>PDC control register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>PDC_MASTER</name>
	<description>Chooses which master is triggered when waking up
0x0: entry is disabled.
0x1: PD_SYS is woken up and CM33 is triggered
0x2: PD_RAD is woken up and CMAC is triggered
0x3: PD_COM is woken up and SNC is triggered</description>
	<access>read-write</access>
	<bitRange>[12:11]</bitRange>
	
</field><field>
	<name>EN_COM</name>
	<description>If set, enables PD_COM for GPIO access. This bit is implied when PDC_MASTER=SNC</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>EN_PER</name>
	<description>If set, enables PD_PER</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>EN_TMR</name>
	<description>If set, enables PD_TMR</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>EN_XTAL</name>
	<description>If set, the XTAL32M will be started</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>TRIG_ID</name>
	<description>For description, see PDC_CTRL0_REG.TRIG_ID</description>
	<access>read-write</access>
	<bitRange>[6:2]</bitRange>
	
</field><field>
	<name>TRIG_SELECT</name>
	<description>For description, see PDC_CTRL0_REG.TRIG_SELECT</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
