irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>PDC_CTRL15_REG</name>
	<description>PDC control register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>PDC_MASTER</name>
	<description>Chooses which master is triggered when waking up
0x0: entry is disabled.
0x1: PD_SYS is woken up and CM33 is triggered
0x2: PD_RAD is woken up and CMAC is triggered
0x3: PD_COM is woken up and SNC is triggered</description>
	<access>read-write</access>
	<bitRange>[12:11]</bitRange>
	
</field><field>
	<name>EN_COM</name>
	<description>If set, enables PD_COM for GPIO access. This bit is implied when PDC_MASTER=SNC</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>EN_PER</name>
	<description>If set, enables PD_PER</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>EN_TMR</name>
	<description>If set, enables PD_TMR</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>EN_XTAL</name>
	<description>If set, the XTAL32M will be started</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>TRIG_ID</name>
	<description>For description, see PDC_CTRL0_REG.TRIG_ID</description>
	<access>read-write</access>
	<bitRange>[6:2]</bitRange>
	
</field><field>
	<name>TRIG_SELECT</name>
	<description>For description, see PDC_CTRL0_REG.TRIG_SELECT</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PDC_CTRL1_REG</name>
	<description>PDC control register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>PDC_MASTER</name>
	<description>Chooses which master is triggered when waking up
0x0: entry is disabled.
0x1: PD_SYS is woken up and CM33 is triggered
0x2: PD_RAD is woken up and CMAC is triggered
0x3: PD_COM is woken up and SNC is triggered</description>
	<access>read-write</access>
	<bitRange>[12:11]</bitRange>
	
</field><field>
	<name>EN_COM</name>
	<description>If set, enables PD_COM for GPIO access. This bit is implied when PDC_MASTER=SNC</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>EN_PER</name>
	<description>If set, enables PD_PER</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>EN_TMR</name>
	<description>If set, enables PD_TMR</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>EN_XTAL</name>
	<description>If set, the XTAL32M will be started</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>TRIG_ID</name>
	<description>For description, see PDC_CTRL0_REG.TRIG_ID</description>
	<access>read-write</access>
	<bitRange>[6:2]</bitRange>
	
</field><field>
	<name>TRIG_SELECT</name>
	<description>For description, see PDC_CTRL0_REG.TRIG_SELECT</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PDC_CTRL2_REG</name>
	<description>PDC control register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>PDC_MASTER</name>
	<description>Chooses which master is triggered when waking up
0x0: entry is disabled.
0x1: PD_SYS is woken up and CM33 is triggered
0x2: PD_RAD is woken up and CMAC is triggered
0x3: PD_COM is woken up and SNC is triggered</description>
	<access>read-write</access>
	<bitRange>[12:11]</bitRange>
	
</field><field>
	<name>EN_COM</name>
	<description>IIf set, enables PD_COM for GPIO access. This bit is implied when PDC_MASTER=SNC</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>EN_PER</name>
	<description>If set, enables PD_PER</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>EN_TMR</name>
	<description>If set, enables PD_TMR</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>EN_XTAL</name>
	<description>If set, the XTAL32M will be started</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>TRIG_ID</name>
	<description>For description, see PDC_CTRL0_REG.TRIG_ID</description>
	<access>read-write</access>
	<bitRange>[6:2]</bitRange>
	
</field><field>
	<name>TRIG_SELECT</name>
	<description>For description, see PDC_CTRL0_REG.TRIG_SELECT</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PDC_CTRL3_REG</name>
	<description>PDC control register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>PDC_MASTER</name>
	<description>Chooses which master is triggered when waking up
0x0: entry is disabled.
0x1: PD_SYS is woken up and CM33 is triggered
0x2: PD_RAD is woken up and CMAC is triggered
0x3: PD_COM is woken up and SNC is triggered</description>
	<access>read-write</access>
	<bitRange>[12:11]</bitRange>
	
</field><field>
	<name>EN_COM</name>
	<description>If set, enables PD_COM for GPIO access. This bit is implied when PDC_MASTER=SNC</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>EN_PER</name>
	<description>If set, enables PD_PER</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>EN_TMR</name>
	<description>If set, enables PD_TMR</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>EN_XTAL</name>
	<description>If set, the XTAL32M will be started</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>TRIG_ID</name>
	<description>For description, see PDC_CTRL0_REG.TRIG_ID</description>
	<access>read-write</access>
	<bitRange>[6:2]</bitRange>
	
</field><field>
	<name>TRIG_SELECT</name>
	<description>For description, see PDC_CTRL0_REG.TRIG_SELECT</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
