irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>PWMLED_DUTY_CYCLE_LED1_REG</name>
	<description>Defines duty cycle for PWM1</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>LED1_PWM_START_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes high. if start_cycle is larger than freq or end_cycle is equal to start_cycle, pwm out is always 0</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>LED1_PWM_END_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes low. If end_cycle is larger then freq and start_cycle is not larger then freq, output is always 1</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PWMLED_DUTY_CYCLE_LED2_REG</name>
	<description>Defines duty cycle for PWM2</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>LED2_PWM_START_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes high. if start_cycle is larger than freq or end_cycle is equal to start_cycle, pwm out is always 0</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>LED2_PWM_END_CYCLE</name>
	<description>Defines the cycle in which the PWM becomes low. If end_cycle is larger then freq and start_cycle is not larger then freq, output is always 1</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PWMLED_FREQUENCY_REG</name>
	<description>Defines the PWM frequecny</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>LED_PWM_FREQUENCY</name>
	<description>Defines the frequency of PWM 1 2, period = PWM_CLK * ( FREQ+1)</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>QSPIC</name>
	<version>1.0</version>
	<description>QSPIC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x38000000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>180</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>QSPIC_BURSTBRK_REG</name>
	<description>Read break sequence in Auto mode</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_SEC_HF_DS</name>
	<description>Disable output during the transmission of the second half (QSPIC_BRK_WRD[3:0]). Setting this bit is only useful if QSPIC_BRK_EN =1 and QSPIC_BRK_SZ= 1.
0: The controller drives the QSPI bus during the transmission of the QSPIC_BRK_WRD[3:0].
1: The controller leaves the QSPI bus in Hi-Z during the transmission of the QSPIC_BRK_WORD[3:0].</description>
	<access>read-write</access>
	<bitRange>[20:20]</bitRange>
	
</field><field>
	<name>QSPIC_BRK_TX_MD</name>
	<description>The mode of the QSPI Bus during the transmission of the burst break sequence.
0x0: Single
0x1: Dual
0x2: Quad
0x3: Reserved</description>
	<access>read-write</access>
	<bitRange>[19:18]</bitRange>
	
</field><field>
	<name>QSPIC_BRK_SZ</name>
	<description>The size of Burst Break Sequence
0: One byte (Send QSPIC_BRK_WRD[15:8])
1: Two bytes (Send QSPIC_BRK_WRD[15:0])</description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>QSPIC_BRK_EN</name>
	<description>Controls the application of a special command (read burst break sequence) that is used in order to force the device to abandon the continuous read mode.
0: The special command is not applied
1: The special command is applied

This special command is applied by the controller to the external device under the following conditions:
- the controller is in Auto mode
- the QSPIC_INST_MD = 1
- the previous command that has been applied in the external device was read
- the controller want to apply to the external device a command different than the read.</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>QSPIC_BRK_WRD</name>
	<description>This is the value of a special command (read burst break sequence) that is applied by the controller to the external memory device, in order to force the memory device to abandon the continuous read mode.</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_BURSTCMDA_REG</name>
	<description>The way of reading in Auto mode (command register A)</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_DMY_TX_MD</name>
	<description>It describes the mode of the SPI bus during the Dummy bytes phase.
0x0: Single SPI
0x1: Dual
0x2: Quad
0x3: Reserved</description>
	<access>read-write</access>
	<bitRange>[31:30]</bitRange>
	
</field><field>
	<name>QSPIC_EXT_TX_MD</name>
	<description>It describes the mode of the SPI bus during the Extra Byte phase.
0x0: Single SPI
0x1: Dual
0x2: Quad
0x3: Reserved</description>
	<access>read-write</access>
	<bitRange>[29:28]</bitRange>
	
</field><field>
	<name>QSPIC_ADR_TX_MD</name>
	<description>It describes the mode of the SPI bus during the address phase.
0x0: Single SPI
0x1: Dual
0x2: Quad
0x3: Reserved</description>
	<access>read-write</access>
	<bitRange>[27:26]</bitRange>
	
</field><field>
	<name>QSPIC_INST_TX_MD</name>
	<description>It describes the mode of the SPI bus during the instruction phase.
0x0: Single SPI
0x1: Dual
0x2: Quad
0x3: Reserved</description>
	<access>read-write</access>
	<bitRange>[25:24]</bitRange>
	
</field><field>
	<name>QSPIC_EXT_BYTE</name>
	<description>The value of an extra byte which will be transferred after address (only if QSPIC_EXT_BYTE_EN= 1). Usually this is the Mode Bits in Dual/Quad SPI I/O instructions.</description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	
</field><field>
	<name>QSPIC_INST_WB</name>
	<description>IInstruction Value for Wrapping Burst. This value is the selected instruction when QSPIC_WRAP_MD is equal to 1 and the access is a wrapping burst of length and size described by the bit fields QSPIC_WRAP_LEN and QSPIC_WRAP_SIZE respectively.</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>QSPIC_INST</name>
	<description>Instruction Value for Incremental Burst or Single read access. This value is the selected instruction at the cases of incremental burst or single read access. Also this value is used when a wrapping burst is not supported (QSPIC_WRAP_MD)</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
