irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
0: Adds wait states via hready signal when an access is performed on the QSPIC_WRITEDATA, QSPIC_READDATA and QSPIC_DUMMYDATA registers. It is not needed to checked the QSPIC_BUSY of the QSPIC_STATUS_REG.
1: The controller don't adds wait states via the hready signal, when is performed access on the QSPIC_WRITEDATA, QSPIC_READDATA and QSPIC_DUMMYDATA registers. The QSPIC_BUSY bit of the QSPIC_STATUS_REG must be checked in order to be detected the completion of the requested access.

It is applicable only when the controller is in Manual mode. In the case of the Auto mode, the controller always adds wait states via the hready signal.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>QSPIC_IO3_DAT</name>
	<description>The value of QSPI_IO3 pad if QSPI_IO3_OEN is 1</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>QSPIC_IO2_DAT</name>
	<description>The value of QSPI_IO2 pad if QSPI_IO2_OEN is 1</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>QSPIC_IO3_OEN</name>
	<description>QSPI_IO3 output enable. Use this only in SPI or Dual SPI mode to control /HOLD signal. When the Auto Mode is selected (QSPIC_AUTO_MD = 1) and the QUAD SPI is used, set this bit to zero.
0: The QSPI_IO3 pad is input.
1: The QSPI_IO3 pad is output.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>QSPIC_IO2_OEN</name>
	<description>QSPI_IO2 output enable. Use this only in SPI or Dual SPI mode to control /WP signal. When the Auto Mode is selected (QSPIC_AUTO_MD = 1) and the QUAD SPI is used, set this bit to zero.
0: The QSPI_IO2 pad is input.
1: The QSPI_IO2 pad is output.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>QSPIC_CLK_MD</name>
	<description>Mode of the generated QSPI_SCK clock
0: Use Mode 0 for the QSPI_CLK. The QSPI_SCK is low when QSPI_CS is high.
1: Use Mode 3 for the QSPI_CLK. The QSPI_SCK is high when QSPI_CS is high.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>QSPIC_AUTO_MD</name>
	<description>Mode of operation
0: The Manual Mode is selected.
1: The Auto Mode is selected.
During an erasing the QSPIC_AUTO_MD goes in read only mode (see QSPIC_ERASE_EN)</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_CTR_CTRL_REG</name>
	<description>Control register for the decryption engine of the QSPIC</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>QSPIC_CTR_EN</name>
	<description>Controls the AES-CTR decryption feature of the QSPIC, which enables the decryption (on-the-fly) of the data that are retrieved from the flash memory device.
0: The AES-CTR decryption is disabled.
1: The controller will decrypt the content of the flash memory device that is placed in the address space that is defined by the QSPIC_CTR_SADDR_REG and QSPIC_CTR_EADDR_REG registers. The data that are placed outside the previous space are not decrypted by the QSPIC. The decryption is performed by using the AES-CTR algorithm. The AES key is defined by the QSPIC_CTR_KEY_x_y_REG registers and the nonce value by the QSPIC_CTR_NONCE_x_y_REG registers.
This configuration bit has meaning only while the controller is in Auto mode. The on-the-fly decryption is not provided in Manual mode.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_CTR_EADDR_REG</name>
	<description>End address of the encrypted content in the QSPI flash</description>
	<addressOffset>0x00000088</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000003ff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_CTR_EADDR</name>
	<description>Defines the bits [31:10] of the end address in the flash memory, where an encrypted image is placed. The bits [9:0] are considered always as 0x3ff. This has meaning only when the decryption is active. See also the register QSPIC_CTR_CTRL_REG[QSPIC_CTR_EN].</description>
	<access>read-write</access>
	<bitRange>[31:10]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_CTR_KEY_0_3_REG</name>
	<description>Key bytes 0 to 3 for the AES-CTR algorithm</description>
	<addressOffset>0x00000094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_CTR_KEY_0_3</name>
	<description>Defines the key that is used by the AES-CTR algorithm, when the on-the-fly decryption is enabled ( QSPIC_CTR_CTRL_REG[QSPIC_CTR_EN] = 1 ). The size of the decryption key is 256bits or 32 bytes :

K0 K1 K2 K3...K30 K31.

The mapping of the bytes to the corresponding QSPIC_CTR_KEY_X_Y_REG regisers is the following :

{K0, K1, K2, K3} = QSPIC_CTR_KEY_0_3_REG[31:0]
{K4, K5, K6, K7} = QSPIC_CTR_KEY_4_7_REG[31:0]
{K8, K9, K10, K11} = QSPIC_CTR_KEY_8_11_REG[31:0]
{K12, K13, K14, K15} = QSPIC_CTR_KEY_12_15_REG[31:0]
{K16, K17, K18, K19} = QSPIC_CTR_KEY_16_19_REG[31:0]
{K20, K21, K22, K23} = QSPIC_CTR_KEY_20_23_REG[31:0]
{K24, K25, K26, K27} = QSPIC_CTR_KEY_24_27_REG[31:0]
{K28, K29, K30, K31} = QSPIC_CTR_KEY_28_31_REG[31:0]

All these registers make sense only when QSPIC_CTR_CTRL_REG[QSPIC_CTR_EN] = 1. Do not perform access to an encrypted address range while the updating process of the decryption key is in progress.</description>
	<access>write-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_CTR_KEY_12_15_REG</name>
	<description>Key bytes 12 to 15 for the AES-CTR algorithm</description>
	<addressOffset>0x000000a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_CTR_KEY_12_15</name>
	<description>See the description in the QSPIC_CTR_KEY_0_3.</description>
	<access>write-only</access>
	<bitRange>[31:0]</bitRange>
	
