irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>QSPIC_CTR_KEY_16_19_REG</name>
	<description>Key bytes 16 to 19 for the AES-CTR algorithm</description>
	<addressOffset>0x000000a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_CTR_KEY_16_19</name>
	<description>See the description in the QSPIC_CTR_KEY_0_3.</description>
	<access>write-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_CTR_KEY_20_23_REG</name>
	<description>Key bytes 20 to 23 for the AES-CTR algorithm</description>
	<addressOffset>0x000000a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_CTR_KEY_20_23</name>
	<description>See the description in the QSPIC_CTR_KEY_0_3.</description>
	<access>write-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_CTR_KEY_24_27_REG</name>
	<description>Key bytes 24 to 27 for the AES-CTR algorithm</description>
	<addressOffset>0x000000ac</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_CTR_KEY_24_27</name>
	<description>See the description in the QSPIC_CTR_KEY_0_3.</description>
	<access>write-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_CTR_KEY_28_31_REG</name>
	<description>Key bytes 28 to 31 for the AES-CTR algorithm</description>
	<addressOffset>0x000000b0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_CTR_KEY_28_31</name>
	<description>See the description in the QSPIC_CTR_KEY_0_3.</description>
	<access>write-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_CTR_KEY_4_7_REG</name>
	<description>Key bytes 4 to 7 for the AES-CTR algorithm</description>
	<addressOffset>0x00000098</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_CTR_KEY_4_7</name>
	<description>See the description in the QSPIC_CTR_KEY_0_3.</description>
	<access>write-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_CTR_KEY_8_11_REG</name>
	<description>Key bytes 8 to 11 for the AES-CTR algorithm</description>
	<addressOffset>0x0000009c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_CTR_KEY_8_11</name>
	<description>See the description in the QSPIC_CTR_KEY_0_3.</description>
	<access>write-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_CTR_NONCE_0_3_REG</name>
	<description>Nonce bytes 0 to 3 for the AES-CTR algorithm</description>
	<addressOffset>0x0000008c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_CTR_NONCE_0_3</name>
	<description>Defines the 8 bytes of the nonce value (N0 - N7) that is used by the AES-CTR algorithm in order to be constructed the counter block (CTRB). The total size of the counter block is 128 bits or 16 bytes :

CTRB0 CTRB1 CTRB2 CTRB3...CTRB14 CTRB15.

The first 8 bytes (CTRB0 - CTRB7) of the counter block consisted by the nonce value.
The next 8 bytes of the counter block (CTRB8-CTRB15), are produced automatically by the hardware based on the address offset inside the encrypted image, from where are retrieved the requested data.
The mapping of the nonce bytes to the corresponding QSPIC_NONCE_X_Y_REG registers is the following :

{CTRB0, CTRB1, CTRB2, CTRB3} = {N0, N1, N2, N3} = QSPIC_NONCE_0_3_REG[31:0]
{CTRB4, CTRB5, CTRB6, CTRB7} = {N4, N5, N6, N7} = QSPIC_NONCE_4_7_REG[31:0]

All these registers make sense only when QSPIC_CTR_CTRL_REG[QSPIC_CTR_EN] = 1.Do not perform access to an encrypted address range while the updating process of the nonce value is in progress.</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_CTR_NONCE_4_7_REG</name>
	<description>Nonce bytes 4 to 7 for the AES-CTR algorithm</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_CTR_NONCE_4_7</name>
	<description>See the description in the QSPIC_NONCE_0_3.</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_CTR_SADDR_REG</name>
	<description>Start address of the encrypted content in the QSPI flash</description>
	<addressOffset>0x00000084</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_CTR_SADDR</name>
	<description>Defines the bits [31:10] of the start address in the flash memory, where an encrypted image is placed. The bits [9:0] are considered always as zero. This has meaning only when the decryption is active. See also the register QSPIC_CTR_CTRL_REG[QSPIC_CTR_EN].</description>
	<access>read-write</access>
	<bitRange>[31:10]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_DUMMYDATA_REG</name>
	<description>Send dummy clocks to SPI Bus for the Manual mode</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_DUMMYDATA</name>
	<description>Writing to this register generates a number of clock pulses to the SPI bus. During the last clock of this activity in the SPI bus, the QSPI_IOx data pads are in hi-z state. The data size of the access to this register can be 32-bits / 16-bits/ 8-bits. The number of generated pulses is equal to: (size of AHB bus access) / (size of SPI bus). The size of SPI bus is equal to 1, 2 or 4 for Single, Dual or Quad SPI mode respectively.
This register has meaning only when the controller is in Manual mode.</description>
	<access>write-only</access>
	<bitRange>[31:0]</bitRange>
	
