irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>QSPIC_ERASECMDA_REG</name>
	<description>The way of erasing in Auto mode (command register A)</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_RES_INST</name>
	<description>The code value of the erase resume instruction</description>
	<access>read-write</access>
	<bitRange>[31:24]</bitRange>
	
</field><field>
	<name>QSPIC_SUS_INST</name>
	<description>The code value of the erase suspend instruction.</description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	
</field><field>
	<name>QSPIC_WEN_INST</name>
	<description>The code value of the write enable instruction.</description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>QSPIC_ERS_INST</name>
	<description>The code value of the erase instruction.</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_ERASECMDB_REG</name>
	<description>The way of erasing in Auto mode (command register B)</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_RESSUS_DLY</name>
	<description>Defines a timer that counts the minimum allowed delay between an erase suspend command and the previous erase resume command (or the initial erase command).
0: Dont wait. The controller starts immediately to suspend the erase procedure.
1..63: The controller waits for at least this number of 222kHz clock cycles before the suspension of erasing. Time starts counting after the end of the previous erase resume command (or the initial erase command)</description>
	<access>read-write</access>
	<bitRange>[29:24]</bitRange>
	
</field><field>
	<name>QSPIC_ERSRES_HLD</name>
	<description>The controller must stay without flash memory reading requests for this number of AMBA hclk clock cycles, before to perform the command of erase or erase resume
15 - 0</description>
	<access>read-write</access>
	<bitRange>[19:16]</bitRange>
	
</field><field>
	<name>QSPIC_ERS_CS_HI</name>
	<description>After the execution of instructions: write enable, erase, erase suspend and erase resume, the QSPI_CS remains high for at least this number of qspi bus clock cycles.</description>
	<access>read-write</access>
	<bitRange>[14:10]</bitRange>
	
</field><field>
	<name>QSPIC_EAD_TX_MD</name>
	<description>The mode of the QSPI Bus during the address phase of the erase instruction
0x0: Single
0x1: Dual
0x2: Quad
0x3: Reserved</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>QSPIC_RES_TX_MD</name>
	<description>The mode of the QSPI Bus during the transmission of the resume instruction
0x0: Single
0x1: Dual
0x2: Quad
0x3: Reserved</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>QSPIC_SUS_TX_MD</name>
	<description>The mode of the QSPI Bus during the transmission of the suspend instruction.
0x0: Single
0x1: Dual
0x2: Quad
0x3: Reserved</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>QSPIC_WEN_TX_MD</name>
	<description>The mode of the QSPI Bus during the transmission of the write enable instruction.
0x0: Single
0x1: Dual
0x2: Quad
0x3: Reserved</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>QSPIC_ERS_TX_MD</name>
	<description>The mode of the QSPI Bus during the instruction phase of the erase instruction
0x0: Single
0x1: Dual
0x2: Quad
0x3: Reserved</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_ERASECTRL_REG</name>
	<description>QSPI Erase control register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_ERS_STATE</name>
	<description>It shows the progress of sector/block erasing (read only).
0x0: No Erase.
0x1: Pending erase request
0x2: Erase procedure is running
0x3: Suspended Erase procedure
0x4: Finishing the Erase procedure
0x5..0x7: Reserved</description>
	<access>read-only</access>
	<bitRange>[27:25]</bitRange>
	
</field><field>
	<name>QSPIC_ERASE_EN</name>
	<description>During Manual mode (QSPIC_AUTO_MD = 0). This bit is in read only mode.
During Auto mode (QSPIC_AUTO_MD = 1). To request the erasing of the block/sector (QSPIC_ERS_ADDR, 12'b0) write 1 to this bit. This bit is cleared automatically with the end of the erasing. Until the end of erasing the QSPIC_ERASE_EN remains in read only mode. During the same period of time the controller remains in Auto Mode (QSPIC_AUTO_MD goes in read only mode).</description>
	<access>read-write</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>QSPIC_ERS_ADDR</name>
	<description>Defines the address of the block/sector that is requested to be erased.
If QSPIC_USE_32BA = 0 (24 bits addressing), bits QSPIC_ERASECTRL_REG[23-12] determine the block/ sector address bits [23-12].
QSPIC_ERASECTRL_REG[11-4] are ignored by the controller.
If QSPIC_USE_32BA = 1 (32 bits addressing) bits QSPIC_ERASECTRL_REG[23-4] determine the block / sectors address bits [31:12]</description>
	<access>read-write</access>
	<bitRange>[23:4]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_GP_REG</name>
	<description>QSPI General Purpose control register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>QSPIC_PADS_SLEW</name>
	<description>QSPI pads slew rate control. Indicative values under certain conditions:
0: Rise=1.7 V/ns, Fall=1.9 V/ns (weak)
1: Rise=2.0 V/ns, Fall=2.3 V/ns
2: Rise=2.3 V/ns, Fall=2.6 V/ns
3: Rise=2.4 V/ns, Fall=2.7 V/ns (strong)
Conditions: FLASH pin capacitance 6 pF, Vcc=1.8V, T=25C and Idrive=16mA.</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>QSPIC_PADS_DRV</name>
	<description>QSPI pads drive current
0: 4 mA
1: 8 mA
2: 12 mA
3: 16 mA</description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	
