irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>QSPIC_READDATA_REG</name>
	<description>Read data from SPI Bus for the Manual mode</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_READDATA</name>
	<description>A read access at this register generates a data transfer from the external memory device to the QSPIC controller. The data is transferred using the selected mode of the SPI bus (SPI, Dual SPI, Quad SPI). The data size of the access to this register can be 32-bits / 16-bits / 8-bits and is equal to the number of the transferred bits.
This register has meaning only when the controller is in Manual mode.</description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_RECVDATA_REG</name>
	<description>Received data for the Manual mode</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_RECVDATA</name>
	<description>This register contains the received data when the QSPIC_READDATA_REG register is used in Manual mode, in order to be retrieved data from the external memory device and QSPIC_HRDY_MD=1 &amp;&amp; QSPIC_BUSY=0.</description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_STATUSCMD_REG</name>
	<description>The way of reading the status of external device in Auto mode</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_STSDLY_SEL</name>
	<description>Defines the timer which is used to count the delay that it has to wait before to read the FLASH Status Register, after an erase or an erase resume command.
0: The delay is controlled by the QSPIC_RESSTS_DLY which counts on the qspi clock.
1: The delay is controlled by the QSPIC_RESSUS_DLY which counts on the 222 kHz clock.</description>
	<access>read-write</access>
	<bitRange>[22:22]</bitRange>
	
</field><field>
	<name>QSPIC_RESSTS_DLY</name>
	<description>Defines a timer that counts the minimum required delay between the reading of the status register and of the previous erase or erase resume instruction.
0: Dont wait. The controller starts to reading the Flash memory status register immediately.
1..63: The controller waits for at least this number of QSPI_CLK cycles and afterwards it starts to reading the Flash memory status register. The timer starts to count after the end of the previous erase or erase resume command.

The actual timer that will be used by the controller before the reading of the Flash memory status register is defined by the QSPIC_STSDLY_SEL.</description>
	<access>read-write</access>
	<bitRange>[21:16]</bitRange>
	
</field><field>
	<name>QSPIC_BUSY_VAL</name>
	<description>Defines the value of the Busy bit which means that the flash is busy.
0: The flash is busy when the Busy bit is equal to 0.
1: The flash is busy when the Busy bit is equal to 1.</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>QSPIC_BUSY_POS</name>
	<description>It describes who from the bits of status represents the Busy bit (7 - 0).</description>
	<access>read-write</access>
	<bitRange>[14:12]</bitRange>
	
</field><field>
	<name>QSPIC_RSTAT_RX_MD</name>
	<description>The mode of the QSPI Bus during the receive status phase of the read status instruction
0x0: Single
0x1: Dual
0x2: Quad
0x3: Reserved</description>
	<access>read-write</access>
	<bitRange>[11:10]</bitRange>
	
</field><field>
	<name>QSPIC_RSTAT_TX_MD</name>
	<description>The mode of the QSPI Bus during the instruction phase of the read status instruction.
0x0: Single
0x1: Dual
0x2: Quad
0x3: Reserved</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>QSPIC_RSTAT_INST</name>
	<description>The code value of the read status instruction.
It is transmitted during the instruction phase of the read status instruction.</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_STATUS_REG</name>
	<description>The status register of the QSPI controller</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_BUSY</name>
	<description>The status of the SPI Bus.

0: The SPI Bus is idle
1: The SPI Bus is active. Read data, write data or dummy data activity is in progress.

Has meaning only in Manual mode and only when QSPIC_HRDY_MD = 1.</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_UCODE_START</name>
	<description>QSPIC uCode memory</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_UCODE_X</name>
	<description>The controller has a dedicated memory cell of 16 words x 32 bits that is used for the storing of the microcode that describes the initialization process of the external flash device. The first word (word 0) of this memory can be accessed by accessing the QSPIC_UCODE_START register. The next words can be accessed by accessing the QSPIC_UCODE_START + 4*X (X=1 .. 15).</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC_WRITEDATA_REG</name>
	<description>Write data to SPI Bus for the Manual mode</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_WRITEDATA</name>
	<description>Writing to this register is generating a data transfer from the controller to the external memory device. The data written in this register, is then transferred to the memory using the selected mode of the SPI bus (SPI, Dual SPI, Quad SPI). The data size of the access to this register can be 32-bits / 16-bits/ 8-bits and is equal to the number of the transferred bits.
This register has meaning only when the controller is in Manual mode.</description>
	<access>write-only</access>
	<bitRange>[31:0]</bitRange>
	
