irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>QSPIC2_BURSTCMDB_REG</name>
	<description>The way of reading in Auto mode (command register B)</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_DMY_FORCE</name>
	<description>By setting this bit, the number of dummy bytes is forced to be equal to 3. In this case the QSPIC_DMY_NUM field is overruled and has no function.
0: The number of dummy bytes is controlled by the QSPIC_DMY_NUM field
1: Three dummy bytes are used. The QSPIC_DMY_NUM is overruled.
</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>QSPIC_CS_HIGH_MIN</name>
	<description>Between the transmission of two different instructions to the flash memory, the qspi bus stays in idle state (QSPI_CS high) for at least this number of QSPI_SCK clock cycles. See the QSPIC_ERS_CS_HI and the QSPIC_WR_CS_HIGH_MIN registers for some exceptions.</description>
	<access>read-write</access>
	<bitRange>[14:12]</bitRange>
	
</field><field>
	<name>QSPIC_WRAP_SIZE</name>
	<description>It describes the selected data size of a wrapping burst (QSPIC_WRAP_MD).
0x0: Byte access (8-bits)
0x1: Half word access (16 bits)
0x2: Word access (32-bits)
0x3: Reserved</description>
	<access>read-write</access>
	<bitRange>[11:10]</bitRange>
	
</field><field>
	<name>QSPIC_WRAP_LEN</name>
	<description>It describes the selected length of a wrapping burst (QSPIC_WRAP_MD).
0x0: 4 beat wrapping burst
0x1: 8 beat wrapping burst
0x2: 16 beat wrapping burst
0x3: Reserved</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>QSPIC_WRAP_MD</name>
	<description>Wrap mode
0: The QSPIC_INST is the selected instruction at any access.
1: The QSPIC_INST_WB is the selected instruction at any wrapping burst access of length and size described by the registers QSPIC_WRAP_LEN and QSPIC_WRAP_SIZE respectively. In all other cases the QSPIC_INST is the selected instruction. Use this feature only when the serial FLASH memory supports a special instruction for wrapping burst access.</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>QSPIC_INST_MD</name>
	<description>Instruction mode
0: Transmit instruction at any burst access.
1: Transmit instruction only in the first access after the selection of Auto Mode.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>QSPIC_DMY_NUM</name>
	<description>Number of Dummy Bytes

0x0: Zero Dummy Bytes (Don't Send Dummy Bytes)
0x1: Send 1 Dummy Byte
0x2: Send 2 Dummy Bytes
0x3: Send 4 Dummy Bytes

When QSPIC_DMY_FORCE is enabled, the QSPIC_DMY_NUM is overruled. In this case the number of dummy bytes is defined by the QSPIC_DMY_FORCE and is equal to 3, independent of the value of the QSPIC_DMY_NUM.
</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>QSPIC_EXT_HF_DS</name>
	<description>Extra Half Disable Output
0: if QSPIC_EXT_BYTE_EN=1 then transmit the complete QSPIC_EXT_BYTE
1: if QSPIC_EXT_BYTE_EN=1 then disable (hi-z) output during the transmission of bits [3:0] of QSPIC_EXT_BYTE</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>QSPIC_EXT_BYTE_EN</name>
	<description>Extra Byte Enable
0: Don't Send QSPIC_EXT_BYTE
1: Send QSPIC_EXT_BYTE</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>QSPIC_DAT_RX_MD</name>
	<description>It describes the mode of the SPI bus during the data phase.
0x0: Single SPI
0x1: Dual
0x2: Quad
0x3: Reserved</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC2_CHCKERASE_REG</name>
	<description>Check erase progress in Auto mode</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_CHCKERASE</name>
	<description>Writing any value to this register during erasing, forces the controller to read the flash memory status register. Depending on the value of the Busy bit, it updates the QSPIC_ERASE_EN.
This register has meaning only when the controller is in Auto mode and there is an erase in progress (QSPIC_ERASE_EN =1). It has no meaning when the external device is a serial SRAM.</description>
	<access>write-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC2_CTRLBUS_REG</name>
	<description>SPI Bus control register for the Manual mode</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_DIS_CS</name>
	<description>Write 1 to disable the chip select (active low) when the controller is in Manual mode.</description>
	<access>write-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>QSPIC_EN_CS</name>
	<description>Write 1 to enable the chip select (active low) when the controller is in Manual mode. </description>
	<access>write-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>QSPIC_SET_QUAD</name>
	<description>Write 1 to set the bus mode in Quad mode when the controller is in Manual mode.</description>
	<access>write-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>QSPIC_SET_DUAL</name>
	<description>Write 1 to set the bus mode in Dual mode when the controller is in Manual mode.</description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>QSPIC_SET_SINGLE</name>
	<description>Write 1 to set the bus mode in Single SPI mode when the controller is in Manual mode.</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
