irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>QSPIC2_GP_REG</name>
	<description>General purpose QSPIC2 register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>QSPIC_PADS_SLEW</name>
	<description>QSPI pads slew rate control. Indicative values under certain conditions:
0x0 : Rise=1.7 V/ns, Fall=1.9 V/ns (weak)
0x1 : Rise=2.0 V/ns, Fall=2.3 V/ns
0x2 : Rise=2.3 V/ns, Fall=2.6 V/ns
0x3 : Rise=2.4 V/ns, Fall=2.7 V/ns (strong)
Conditions: FLASH pin capacitance 6pF, Vcc=1.8V, T=25C and Idrive=16mA</description>
	<access>read-write</access>
	<bitRange>[4:3]</bitRange>
	
</field><field>
	<name>QSPIC_PADS_DRV</name>
	<description>QSPI pads drive current
0x0 : 4 mA
0x1 : 8 mA
0x2 : 12 mA
0x3 : 16 mA</description>
	<access>read-write</access>
	<bitRange>[2:1]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC2_MEMBLEN_REG</name>
	<description>External memory burst length configuration</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_T_CEM_CC</name>
	<description>Defines the maximum allowed time tCEM for which the QSPIC_CS can stay active (QSPI_CS=0). It has meaning only when QSPIC_T_CEM_EN is equal to 1. See also the description of the QSPI_T_CEM_EN for more details.

The tCEM is expressed in number of qspi clock cycles and can be calculated as follows :

tCEM / (qspi_clock_period)

If the result of the above equation is higher than 0x3FF, use the value 0x3FF.</description>
	<access>read-write</access>
	<bitRange>[13:4]</bitRange>
	
</field><field>
	<name>QSPIC_T_CEM_EN</name>
	<description>This bit enables the controlling of the maximum time tCEM for which the QSPI_CS remains active. It has meaning only when the Auto mode is active (QSPIC_AUTO_MD=1) and the external device is a serial SRAM (QSPIC_SRAM_EN=1). In the case where the external device is a serial Flash (QSPIC_SRAM_EN=0) or the controller is in Manual mode (QSPIC_AUTO_MD=0), this field has no any effect.

This feature is usefull in the case where the external serial device is a dynamic RAM that requires refresh. If the refresh is applied only when the device is in the idle state (QSPI_CS = 1), the time for which the device remains in the active state (QSPI_CS = 0) should be limited by a maximum threshold.

0:There is no any constraint regarding the maximum allowed time for which the QSPI_CS can stay active. This is the case also when QSPIC_SRAM_EN=0 or QSPIC_AUTO_MD=0.
1:There is a maximum allowed time interval tCEM for which the QSPI_CS can stay active during a burst access (for reading or writting of data). For the controller this is considered as equal to QSPIC_T_CEM_CC x qspi_clock_period. In the case where the data transfer requires the QSPI_CS to stays active for more than QSPIC_T_CEM_CC qspi clock cycles, the QSPI controller splits the access on the SPI bus in more than one bursts, by inserting inactive periods (QSPI_CS = 0) between them. This will cost extra clock cycles for the realization of the original acceess, due to the additional commands that are required in the SPI bus.

The value in the QSPIC_T_CEM_CC should be updated every time where the frequency of the qspi clock is modified. The qspi clock frequency should not be decreased more than a lowest frequency. This is the lowest frequency that enables the be performed a 32-bit word read and write access, without violating the tCEM timing requirement (the QSPI controller allows to be performed at least the transferring of one beat of the requested burst, independent of the QSPIC_T_CEM_CC limit).</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>QSPIC_MEMBLEN</name>
	<description>In this register is defined the expected behavior of the external memory device regarding the length of a burst operation :

0x0: The external memory device is capable to implement incremental burst of unspecified length.
0x1: The external memory device implements a wrapping burst of length 4 bytes.
0x2: The external memory device implements a wrapping burst of length 8 bytes.
0x3: The external memory device implements a wrapping burst of length 16 bytes.
0x4: The external memory device implements a wrapping burst of length 32 bytes.
0x5: The external memory device implements a wrapping burst of length 64 bytes.
0x6 - 0x7 : Reserved

This setting is used by the QSPI controller when the Auto mode is enabled (QSPIC_AUTO_MD=1), in order to handle the various burst requests of the AHB bus, in respect of the requirements of the external memory device.
The external memory device may need to be configured by applying special instruction, in order to be defined the kind of the burst operation. This can be implemented by applying this special instruction with the QSPI controller in Manual mode (QSPIC_AUTO_MD=1). Refer to the datasheet of the external device for more information.</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>QSPIC2_READDATA_REG</name>
	<description>Read data from SPI Bus for the Manual mode</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_READDATA</name>
	<description>A read access at this register generates a data transfer from the external memory device to the QSPIC controller. The data is transferred using the selected mode of the SPI bus (SPI, Dual SPI, Quad SPI). The data size of the access to this register can be 32-bits / 16-bits / 8-bits and is equal to the number of the transferred bits.
This register has meaning only when the controller is in Manual mode.</description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
