irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RF_ADCQ_DC_OFFSET_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00020100</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>ADC_OFFN_Q_RD</name>
	<description>DC offset compensation in the Q path (inverting input) in sign-magnitude notarion (i.e. -31 : 1 : 31 mV) </description>
	<access>read-only</access>
	<bitRange>[17:9]</bitRange>
	
</field><field>
	<name>ADC_OFFP_Q_RD</name>
	<description>DC offset compensation in the Q path (non-inverting input) in sign-magnitude notarion (i.e. -31 : 1 : 31 mV) </description>
	<access>read-only</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ADC_CTRL1_REG</name>
	<description>ADC control register</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00006001</resetMask>
	<fields>
	<field>
	<name>ADC_SIGN</name>
	<description>Change polarity of ADC input. </description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>ADC_MUTE</name>
	<description>0: Normal operation
1: Short the inputs of the ADC (used for DC offset cal) </description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>ADC_DC_OFFSET_SEL</name>
	<description>0: Normal operation (i.e. Use automatically calibrated value)
1: Use ADC_OFFx_y_WR to set the DC offset compensation values in the ADC (x = N or P, y = I or Q </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ADC_CTRL2_REG</name>
	<description>ADC control register</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>ADC_OFFN_I_WR</name>
	<description>External value for the DC offset compensation in the I path negative side. With common mode input voltage at Vpwrp/2, this value is 512-ADC_OFFP_Q_WR. </description>
	<access>read-write</access>
	<bitRange>[17:9]</bitRange>
	
</field><field>
	<name>ADC_OFFP_I_WR</name>
	<description>External value for the DC offset compensation in the I path positive side. </description>
	<access>read-write</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ADC_CTRL3_REG</name>
	<description>ADC control register</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>ADC_OFFN_Q_WR</name>
	<description>External value for the DC offset compensation in the Q path negative side. With common mode input voltage at Vpwrp/2, this value is 512-ADC_OFFP_Q_WR. </description>
	<access>read-write</access>
	<bitRange>[17:9]</bitRange>
	
</field><field>
	<name>ADC_OFFP_Q_WR</name>
	<description>External value for the DC offset compensation in the Q path positive side. </description>
	<access>read-write</access>
	<bitRange>[8:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ADPLLDIG_CTRL_REG</name>
	<description>Adplldig specific settings register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>OPENLOOP_RDY_WR</name>
	<description>Overrule value for the openloop_rdy.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>OPENLOOP_RDY_SEL</name>
	<description>Overrule the openloop_rdy from adplldig.
0: Normal function (default)
1: Overrule the openloop_rdy by OPENLOOP_RDY_WR</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ADPLLDIG_RFMON_CTRL_REG</name>
	<description>Settings for the ADPLLDIG RFMON block</description>
	<addressOffset>0x000000a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>ADPLLDIG_RFMON_MUX_SEL</name>
	<description>Mux select for the RFMON data
'b00x: dem_rfmon_data[31:0]
'b010: {dem_rfmon_data[31:16], adplldig_rfmon_data[15:0]}
'b011: {dem_rfmon_data[31:16], adplldig_rfmon_data[31:16]}
'b100: {adplldig_rfmon_data[31:16], dem_rfmon_data[15:0]}
'b101: {adplldig_rfmon_data[15:0], dem_rfmon_data[15:0]}
'b110: adplldig_rfmon_data
'b111: {adplldig_rfmon_data[15:0], adplldig_rfmon_data[31:16]}</description>
	<access>read-write</access>
	<bitRange>[3:1]</bitRange>
	
</field><field>
	<name>ADPLLDIG_SYNC_CLK_INV</name>
	<description>Invert the clock capturing adplldig_rfmon data
0: Do not invert (default)
1: Invert</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_AGC_EXT_LUT_REG</name>
	<description>AGC_LUT register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>AGC_EXT_LUT</name>
	<description>LUT for the AGC value, to be selected by dem_agc from the demodulator.
Gain settings 10, 11, 12 (so the last 3) use the value of gain setting 9</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ATTR_REG</name>
	<description>Radio attributes register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0f168820</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PA_POWER_SETTING</name>
	<description>Dynamic setting to control the PA power by enabling units
1 : minimum power

15: maximum power
</description>
	<access>read-write</access>
	<bitRange>[27:24]</bitRange>
	
</field><field>
	<name>IFF_BIAS</name>
	<description>Tuning of the IFF bias current.</description>
	<access>read-write</access>
	<bitRange>[20:16]</bitRange>
	
</field><field>
	<name>TIA_BIAS</name>
	<description>Tuning of the TIA bias current.</description>
	<access>read-write</access>
	<bitRange>[15:12]</bitRange>
	
</field><field>
	<name>MIX_BIAS</name>
	<description>Tuning of the Mixer bias current.</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>LNA_PWR_MODE</name>
	<description>LNA power mode
0: Low power (default)
1: High performance</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>IFF_POLARITY</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>IFF_IF_MODE</name>
	<description>IFF IF mode
0: 1 Mbps (default)
1: 2 Mbps</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>TIA_IF_MODE</name>
	<description>TIA IF mode
0: 1 Mbps (default)
1: 2 Mbps</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
