irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RF_CALSTATE_REG</name>
	<description>cal_state read-out register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CALSTATE</name>
	<description>Value of the calstate state machine </description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CAL_CTRL_REG</name>
	<description>Calibration FSM control</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>DC_OFFSET_CAL_DIS</name>
	<description>Do not calibrate the VGA2 Offset during Cal cycle </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>IFF_CAL_DIS</name>
	<description>Do not calibrate the IFF center frequency during Cal cycle </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>EO_CAL</name>
	<description>End of calibration trigger.
Reading returns the eo_cal status signal which can be cleared by writing to RF_IRQ_CTRL_REG.EO_CAL_CLEAR </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SO_CAL</name>
	<description>Start of calibration trigger.Writing a 1 starts calibration.1Reading returns the calibration status (1 = busy calibrating). </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_IFF_CAL_CAP_STAT_REG</name>
	<description>Current CAL_CAP value applied to the IF</description>
	<addressOffset>0x00000098</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000008</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>IF_CAL_CAP_RD</name>
	<description>Reset value is equal to the reset value of RF_IFF_RESULT_REG[IF_CAL_CAP_RD]</description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_IFF_CC_SET_REG</name>
	<description>Must be retained</description>
	<addressOffset>0x00000094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x08080808</resetValue>
	<resetMask>0x0f0f0f0f</resetMask>
	<fields>
	<field>
	<name>IF_CAL_CAP_2M_SET2</name>
	<description>Retained WRITE value.
The result of the IF_CAL_CAP calibration should be copied from RF_IFF_RESULT_REG to this register
</description>
	<access>read-write</access>
	<bitRange>[27:24]</bitRange>
	
</field><field>
	<name>IF_CAL_CAP_2M_SET1</name>
	<description>Retained WRITE value.
The result of the IF_CAL_CAP calibration should be copied from RF_IFF_RESULT_REG to this register
</description>
	<access>read-write</access>
	<bitRange>[19:16]</bitRange>
	
</field><field>
	<name>IF_CAL_CAP_1M_SET2</name>
	<description>Retained WRITE value.
The result of the IF_CAL_CAP calibration should be copied from RF_IFF_RESULT_REG to this register
</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>IF_CAL_CAP_1M_SET1</name>
	<description>Retained WRITE value.
The result of the IF_CAL_CAP calibration should be copied from RF_IFF_RESULT_REG to this register
</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_IFF_CTRL_REG</name>
	<description>IFF control register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00004788</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>IFF_DCOC_DAC_REFCUR_CTRL</name>
	
	<access>read-write</access>
	<bitRange>[14:13]</bitRange>
	
</field><field>
	<name>IFF_COMPLEX_DIS</name>
	<description>Put IF-filter in lowpass configuration </description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>IF_SELECT_FSM</name>
	<description>'0': use one of the IFF_CC_1M/2M_SET1/2, depending on IFF_IF_MODE and IF_SELSET_GT
'1': use the value from the calibration FSM</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>IF_SEL_SET2_GT</name>
	<description>Setting to control when IF_CAL_CAP_1M/2M_SET2 is used.
If AGC &gt; IF_SEL_SET2_GT, SET2 is used.Else, SET1 is used.</description>
	<access>read-write</access>
	<bitRange>[10:7]</bitRange>
	
</field><field>
	<name>RO_TO_PINS</name>
	<description>'0': normal operation;
'1': Enable reference oscillator. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>IFF_DCOC_DAC_DIS</name>
	<description>Disable the DC offset current DAC </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>IF_MUTE</name>
	<description>'0': normal operation;
'1': Mute IFF by short circuit of VGA1 input.
Note: set TGATE_MIXER_IF to '0' for isolation from the IRM </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>IF_CAL_CAP</name>
	<description>Current value applied to IF_CAL_CAP</description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_IFF_RESULT_REG</name>
	<description>Not retained</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000008</resetValue>
	<resetMask>0x0000fc0f</resetMask>
	<fields>
	<field>
	<name>IF_CAL_CAP_RD</name>
	<description>IF calibration result capacitance.</description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_IO_CTRL_REG</name>
	<description>IO control register</description>
	<addressOffset>0x00000074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00003707</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RFIO_TX_TUNE_CAP_TRIM_TX</name>
	<description>Trims the TX tuning cap for TX mode.
Step = 320fF.
0: Minimum cap (all caps off)

7: Maximum cap (all caps on)</description>
	<access>read-write</access>
	<bitRange>[14:12]</bitRange>
	
</field><field>
	<name>RFIO_RX_TUNE_CAP_TRIM_TX</name>
	<description>Trims the RX tuning cap for TX mode.
Step = 20fF.
0: Minimum cap (all caps off)

