irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
15: Maximum cap (all caps on)</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>RFIO_TX_TUNE_CAP_TRIM_RX</name>
	<description>Trims the TX tuning cap for RX mode.
Step = 320fF.
0: Minimum cap (all caps off)

7: Maximum cap (all caps on)</description>
	<access>read-write</access>
	<bitRange>[6:4]</bitRange>
	
</field><field>
	<name>RFIO_RX_TUNE_CAP_TRIM_RX</name>
	<description>Trims the RX tuning cap for RX mode.
Step = 20fF.
0: Minimum cap (all caps off)

15: Maximum cap (all caps on)</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_IRQ_CTRL_REG</name>
	<description>IRQ clear register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>EO_CAL_CLEAR</name>
	<description>Writing any value to this bit clears eo_cal interrupt. </description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_LDO_STATUS_REG</name>
	<description>Read out value of LDO enables</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>ADPLLDIG_LDO_ZERO_EN_RD</name>
	<description>ADPLLDIG LDO zero enable bit.</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>ADPLLDIG_LDO_EN_RD</name>
	<description>ADPLLDIG LDO enable bit.</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RADIO_LDO_ZERO_EN_RD</name>
	<description>Radio LDO zero enable bit.</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RADIO_LDO_EN_RD</name>
	<description>Radio LDO enable bit.</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_LDO_VREF_SEL_REG</name>
	<description>Vref sel control register</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000004</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields>
	<field>
	<name>RF_LDO_ADPLLDIG_VREF_SEL</name>
	
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>RF_LDO_DCO_VREF_SEL</name>
	
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>RF_LDO_DTC_VREF_SEL</name>
	
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>RF_LDO_TDC_VREF_SEL</name>
	
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>RF_LDO_IFADC_VREF_SEL</name>
	
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>RF_LDO_IFF_VREF_SEL</name>
	
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>RF_LDO_MIX_VREF_SEL</name>
	
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>RF_LDO_LNA_VREF_SEL</name>
	
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RF_LDO_PA_VREF_SEL</name>
	
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RF_LDO_RFIO_VREF_SEL</name>
	
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RF_LDO_RADIO_VREF_SEL</name>
	
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_LNA_CTRL1_REG</name>
	<description>LNA control register</description>
	<addressOffset>0x00000078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x01084210</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields>
	<field>
	<name>LNA_TRIM_GAIN4_HP</name>
	<description>High performance LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 1 and lna_gain_sel &gt; 3)</description>
	<access>read-write</access>
	<bitRange>[24:20]</bitRange>
	
</field><field>
	<name>LNA_TRIM_GAIN3_HP</name>
	<description>High performance LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 1 and lna_gain_sel = 3)</description>
	<access>read-write</access>
	<bitRange>[19:15]</bitRange>
	
</field><field>
	<name>LNA_TRIM_GAIN2_HP</name>
	<description>High performance LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 1 and lna_gain_sel = 2)</description>
	<access>read-write</access>
	<bitRange>[14:10]</bitRange>
	
</field><field>
	<name>LNA_TRIM_GAIN1_HP</name>
	<description>High performance LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 1 and lna_gain_sel = 1)</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>LNA_TRIM_GAIN0_HP</name>
	<description>High performance LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 1 and lna_gain_sel = 0)</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_LNA_CTRL2_REG</name>
	<description>LNA control register</description>
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00d6b5ad</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields>
	<field>
	<name>LNA_TRIM_GAIN4_LP</name>
	<description>Low power LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel &gt; 3)</description>
	<access>read-write</access>
	<bitRange>[24:20]</bitRange>
	
</field><field>
	<name>LNA_TRIM_GAIN3_LP</name>
	<description>Low power LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 3)</description>
	<access>read-write</access>
	<bitRange>[19:15]</bitRange>
	
</field><field>
	<name>LNA_TRIM_GAIN2_LP</name>
	<description>Low power LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 2)</description>
	<access>read-write</access>
	<bitRange>[14:10]</bitRange>
	
</field><field>
	<name>LNA_TRIM_GAIN1_LP</name>
	<description>Low power LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 1)</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>LNA_TRIM_GAIN0_LP</name>
	<description>Low power LNA gm trim bias settings for CN
00: Lowest gm trim
10: Nominal gm trim
1F: Highest gm trim
(Used as gm trim bias value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 0)</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
