irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RF_LNA_CTRL3_REG</name>
	<description>LNA control register</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00111114</resetValue>
	<resetMask>0x0333333f</resetMask>
	<fields>
	<field>
	<name>LNA_SPARE</name>
	<description>Spare bits for LNA.</description>
	<access>read-write</access>
	<bitRange>[25:24]</bitRange>
	
</field><field>
	<name>LNA_MODE_GAIN4_LP</name>
	<description>Low power LNA mode setting
(Used as lna_mode value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel &gt; 3)</description>
	<access>read-write</access>
	<bitRange>[21:20]</bitRange>
	
</field><field>
	<name>LNA_MODE_GAIN3_LP</name>
	<description>Low power LNA mode setting
(Used as lna_mode value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 3)</description>
	<access>read-write</access>
	<bitRange>[17:16]</bitRange>
	
</field><field>
	<name>LNA_MODE_GAIN2_LP</name>
	<description>Low power LNA mode setting
(Used as lna_mode value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 2)</description>
	<access>read-write</access>
	<bitRange>[13:12]</bitRange>
	
</field><field>
	<name>LNA_MODE_GAIN1_LP</name>
	<description>Low power LNA mode setting
(Used as lna_mode value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 1)</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>LNA_MODE_GAIN0_LP</name>
	<description>Low power LNA mode setting
(Used as lna_mode value if RF_ATTR_REG[LNA_PWR_MODE] = 0 and lna_gain_sel = 0)</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>LNA_TRIM_CASC</name>
	<description>Trims the cascode voltages.
0: lower voltage

7: higher voltage</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MIXER_CTRL1_REG</name>
	<description>Mixer control register</description>
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x20202020</resetValue>
	<resetMask>0x7f3f3f3f</resetMask>
	<fields>
	<field>
	<name>MIXER_IP2_DAC_EXTEND</name>
	<description>Controls the slope of the IP2 DACs for the 3 LSBs
0: DAC slope normal
1: DAC slope doubled</description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	
</field><field>
	<name>MIXER_IP2_DAC_IP_TRIM</name>
	<description>Trims the IP DAC.
Step = 3.9mV (LSB) for MIXER_IP2_DAC_EXTEND = 0
Step = 2* 3.9mV (LSB) for MIXER_IP2_DAC_EXTEND = 1
0: Lowest voltage

63: Highest voltage</description>
	<access>read-write</access>
	<bitRange>[29:24]</bitRange>
	
</field><field>
	<name>MIXER_IP2_DAC_IN_TRIM</name>
	<description>Trims the IN DAC.
Step = 3.9mV (LSB) for MIXER_IP2_DAC_EXTEND = 0
Step = 2* 3.9mV (LSB) for MIXER_IP2_DAC_EXTEND = 1
0: Lowest voltage

63: Highest voltage</description>
	<access>read-write</access>
	<bitRange>[21:16]</bitRange>
	
</field><field>
	<name>MIXER_IP2_DAC_QP_TRIM</name>
	<description>Trims the QP DAC.
Step = 3.9mV (LSB) for MIXER_IP2_DAC_EXTEND = 0
Step = 2* 3.9mV (LSB) for MIXER_IP2_DAC_EXTEND = 1
0: Lowest voltage

63: Highest voltage </description>
	<access>read-write</access>
	<bitRange>[13:8]</bitRange>
	
</field><field>
	<name>MIXER_IP2_DAC_QN_TRIM</name>
	<description>Trims the QN DAC.
Step = 3.9mV (LSB) for MIXER_IP2_DAC_EXTEND = 0
Step = 2* 3.9mV (LSB) for MIXER_IP2_DAC_EXTEND = 1
0: Lowest voltage

63: Highest voltage</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MIXER_CTRL2_REG</name>
	<description>Mixer control register</description>
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0f010f0f</resetMask>
	<fields>
	<field>
	<name>MIX_SPARE</name>
	<description>Spare for the Mixer.</description>
	<access>read-write</access>
	<bitRange>[27:24]</bitRange>
	
</field><field>
	<name>MIX_CAL_SELECT</name>
	<description>0: use IF_CAL_CAP_1M/2M_SET1, depending on mode. MIX_CAL_CAP_WR is added as offset.
1: use MIX_CAL_CAP_WR directly</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>MIX_CAL_CAP_WR_2M</name>
	<description>External value for calibration of mixer pole capacitance for 2M mode.</description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	
</field><field>
	<name>MIX_CAL_CAP_WR_1M</name>
	<description>External value for calibration of mixer pole capacitance for 1M mode.</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_MIX_CAL_CAP_STAT_REG</name>
	<description>Current CAL_CAP value applied to the Mixer</description>
	<addressOffset>0x0000009c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000008</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>MIX_CAL_CAP_RD</name>
	<description>The reset value should be equal to the reset value of RF_IFF_CC_SET_REG[RF_IFF_CC_1M_SET1].</description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_OVERRULE_REG</name>
	<description>Overrule register</description>
	<addressOffset>0x000000ac</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>RX_EN_OVR</name>
	<description>Overrule RX_EN
'b01: disabled.
'b1x: enabled.
'b00: normal function</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>TX_EN_OVR</name>
	<description>Overrule TX_EN
'b01: disabled.
'b1x: enabled.
'b00: normal function</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PA_CTRL_REG</name>
	<description>PA control register</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000300</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>PA_RAMP_STEP_SPEED</name>
	<description>00 no ramping
01 ramp step 125 ns
10 ramp step 250 ns
11 ramp step 500 ns
</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>TRIM_DUTY_NEG</name>
	<description>Trims the duty-cycle (current starving) resistor at the nmos side
0: lowest resistance (shorted, fastest falling edge)

7: max resistance (slowest falling edge)</description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	
</field><field>
	<name>TRIM_DUTY_POS</name>
	<description>Trims the duty-cycle (current starving) resistor at the pmos side
0: lowest resistance (shorted, fastest rising edge)

7: max resistance (slowest rising edge)</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
