irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RF_RADIO_INIT_REG</name>
	<description>Radio initialization register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x010303ff</resetMask>
	<fields>
	<field>
	<name>RADIO_INIT_AUTOCLEAR</name>
	<description>LDO mode
0: Clear ADPLLDIG_LDO_EN from FW.
1: Auto-clear ADPLLDIG_LDO_EN on radio_busy negedge if there is no package in IFS.</description>
	<access>read-write</access>
	<bitRange>[24:24]</bitRange>
	
</field><field>
	<name>ADPLLDIG_HCLK_DIS</name>
	<description>Disable adplldig hclk.
0: Do nothing
1: Disable
(It is auto-cleared when ADPLLDIG_HCLK_EN is set to 1)
Remark: Since ADPLLDIG_HCLK_EN has higher priority over ADPLLDIG_HCLK_DIS, ADPLLDIG_HCLK_DIS bit-field cannot be set to 1 with "SetBits()" commands, which access the two bit-fields at the same time. To be able to ADPLLDIG_HCLK_DIS bit-field to 1, "SetByte()" command should be used.</description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>RADIO_REGS_RDY</name>
	<description>ADPLLDIG regs loading status bit
(Auto-clear to 0 at phy_busy pos-edge or when ADPLLDIG LDO is off)
0: Loading preferred values is not finished.
1: Loading preferred values is finished.</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>ADPLLDIG_HCLK_EN</name>
	<description>Enable adplldig hclk.
0: Disable
1: Enable
(It is auto-cleared when ADPLLDIG_HCLK_DIS is set to 1)</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>ADPLLDIG_HRESET_N</name>
	<description>Reset Adplldig register file
0: Reset state.
1: Reset is released.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>ADPLLDIG_LDO_EN_WR</name>
	<description>ADPLLDIG LDO EN overrule value.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>ADPLLDIG_LDO_EN_SEL</name>
	<description>Select ADPLLDIG_LDO_EN_WR.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>ADPLLDIG_LDO_EN</name>
	<description>ADPLLDIG LDO enable bit.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RADIO_LDO_EN_WR</name>
	<description>Radio LDO EN overrule value.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RADIO_LDO_EN_SEL</name>
	<description>Select RADIO_LDO_EN_WR.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RADIO_LDO_EN</name>
	<description>Radio LDO enable bit.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_RDP_CTRL_REG</name>
	<description>Exposed radio mode control register</description>
	<addressOffset>0x000000a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>RDP_MOD_RATE</name>
	<description>0: The input selected with RDP_MOD_SEL2 is sampled with 32 MHz
1: The input selected with RDP_MOD_SEL2 is sampled with 16 MHz
2: The input selected with RDP_MOD_SEL2 is sampled with 8 MHz
3: Reserved
</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>RDP_MOD_SEL2</name>
	<description>0: Normal mode - Do not use the RDP_DATA_IN[31:0] signals
1: Exposed radio mode - Use the RDP_DATA[15:0] as modulated input
2: Exposed radio mode - Use the RDP_DATA[31:16] as modulated input
3: Reserved</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>RDP_MOD_SEL1</name>
	<description>Provide TX data via GPIOs for exposed radio mode
0: Normal operation - TX data from CMAC
1: Exposed radio mode - TX data from RDP_TX_DATA and RDP_TX_DATA_VALID</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RDP_RFCU_SEL</name>
	<description>Provide rx_en/tx_en via GPIOs for exposed radio mode
0: Normal operation - tx_en/rx_en from CMAC
1: Exposed radio mode - tx_en/rx_en from RDP_RX_EN and RDP_TX_EN</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_REF_OSC_REG</name>
	
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000302c</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CNT_CLK</name>
	<description>number of clock pulses corresponding to the value of CNT_RO </description>
	<access>read-write</access>
	<bitRange>[14:6]</bitRange>
	
</field><field>
	<name>CNT_RO</name>
	<description>number of reference oscillator periods that need to be counted </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_RFCU_CTRL_REG</name>
	<description>RFCU control register</description>
	<addressOffset>0x000000a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>RF_RFCU_CLK_DIV</name>
	<description>Divide the RFCU clock by 2.
0: 16 MHz
1: 8 MHz (default)</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_SCAN_FEEDBACK_REG</name>
	<description>scan feedback register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	</fields>
</register><register>
	<name>RF_SPARE_REG</name>
	<description>Spare register for radio</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RF_SPARE_IN_EN</name>
	<description>Enable reading of the spare inputs from radio.</description>
	<access>read-write</access>
	<bitRange>[28:28]</bitRange>
	
</field><field>
	<name>RF_SPARE_IN</name>
	<description>Spare inputs from radio.</description>
	<access>read-only</access>
	<bitRange>[27:24]</bitRange>
	
</field><field>
	<name>RF_SPARE_BITS_HV</name>
	<description>Spare bits for High voltage.</description>
	<access>read-write</access>
	<bitRange>[23:16]</bitRange>
	
</field><field>
	<name>RF_SPARE_BITS</name>
	<description>Spare bits.</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
