irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_10_REG</name>
	
	<addressOffset>0x00000124</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000c16</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_11_REG</name>
	
	<addressOffset>0x00000128</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000081a</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_tx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_tx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_12_REG</name>
	
	<addressOffset>0x0000012c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000e1a</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_13_REG</name>
	
	<addressOffset>0x00000130</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000220</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_14_REG</name>
	
	<addressOffset>0x00000134</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000a20</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_15_REG</name>
	
	<addressOffset>0x00000138</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000426</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_16_REG</name>
	
	<addressOffset>0x0000013c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000430</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_17_REG</name>
	
	<addressOffset>0x00000140</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000837</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_18_REG</name>
	
	<addressOffset>0x00000144</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000846</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_19_REG</name>
	
	<addressOffset>0x00000148</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000850</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_1_REG</name>
	
	<addressOffset>0x00000100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000400</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/so_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
