irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_20_REG</name>
	
	<addressOffset>0x0000014c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000125a</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_21_REG</name>
	
	<addressOffset>0x00000150</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_22_REG</name>
	
	<addressOffset>0x00000154</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_23_REG</name>
	
	<addressOffset>0x00000158</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_24_REG</name>
	
	<addressOffset>0x0000015c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_25_REG</name>
	
	<addressOffset>0x00000160</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_26_REG</name>
	
	<addressOffset>0x00000164</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_27_REG</name>
	
	<addressOffset>0x00000168</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_28_REG</name>
	
	<addressOffset>0x0000016c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_29_REG</name>
	
	<addressOffset>0x00000170</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_2_REG</name>
	
	<addressOffset>0x00000104</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000c00</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/so_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
