irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_30_REG</name>
	
	<addressOffset>0x00000174</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_31_REG</name>
	
	<addressOffset>0x00000178</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_3_REG</name>
	
	<addressOffset>0x00000108</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000408</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/so_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_4_REG</name>
	
	<addressOffset>0x0000010c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000c08</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_5_REG</name>
	
	<addressOffset>0x00000110</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000212</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_6_REG</name>
	
	<addressOffset>0x00000114</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000a12</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_7_REG</name>
	
	<addressOffset>0x00000118</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000414</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_tx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_tx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_8_REG</name>
	
	<addressOffset>0x0000011c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000c14</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_9_REG</name>
	
	<addressOffset>0x00000120</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000416</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>RESET_OFFSET</name>
	<description>Offset w.r.t. end switch instant eo_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	
</field><field>
	<name>SET_OFFSET</name>
	<description>Offset w.r.t. start switch instant so_rx/eo_tx. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG0_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000083</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>RFIO_LDO_EN_DCF_TX</name>
	<description>DCF timer for rfio_ldo_en in tx mode.</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>RFIO_LDO_EN_DCF_RX</name>
	<description>DCF timer for rfio_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG10_REG</name>
	
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>LNA_LDO_ZERO_DCF_TX</name>
	<description>DCF timer for lna_ldo_zero in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>LNA_LDO_ZERO_DCF_RX</name>
	<description>DCF timer for lna_ldo_zero in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
