irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG11_REG</name>
	
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000c5</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ADPLLDIG_LDO_ACTIVERDY_DCF_TX</name>
	<description>DCF timer for adplldig_ldo_activerdy in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>ADPLLDIG_LDO_ACTIVERDY_DCF_RX</name>
	<description>DCF timer for adplldig_ldo_activerdy in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG12_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000018b</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ADPLLDIG_LDO_LP_DCF_TX</name>
	<description>DCF timer for adplldig_ldo_lp in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>ADPLLDIG_LDO_LP_DCF_RX</name>
	<description>DCF timer for adplldig_ldo_lp in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG13_REG</name>
	
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>RFIO_RX_EN_DCF_TX</name>
	<description>DCF timer for rfio_rx_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>RFIO_RX_EN_DCF_RX</name>
	<description>DCF timer for rfio_rx_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG14_REG</name>
	
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000001c0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>RFIO_TX_EN_DCF_TX</name>
	<description>DCF timer for rfio_tx_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>RFIO_TX_EN_DCF_RX</name>
	<description>DCF timer for rfio_tx_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG15_REG</name>
	
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000001c0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>RFIO_TX_HARM_EN_DCF_TX</name>
	<description>DCF timer for rfio_tx_harm_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>RFIO_TX_HARM_EN_DCF_RX</name>
	<description>DCF timer for rfio_tx_harm_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG16_REG</name>
	
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000008f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>RFIO_BIAS_EN_DCF_TX</name>
	<description>DCF timer for rfio_bias_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>RFIO_BIAS_EN_DCF_RX</name>
	<description>DCF timer for rfio_bias_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG17_REG</name>
	
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000210</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>RFIO_BIAS_SH_OPEN_DCF_TX</name>
	<description>DCF timer for rfio_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>RFIO_BIAS_SH_OPEN_DCF_RX</name>
	<description>DCF timer for rfio_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG18_REG</name>
	
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000001a0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>PA_RAMP_EN_DCF_TX</name>
	<description>DCF timer for pa_ramp_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>PA_RAMP_EN_DCF_RX</name>
	<description>DCF timer for pa_ramp_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG19_REG</name>
	
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000001c0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>PA_EN_DCF_TX</name>
	<description>DCF timer for pa_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>PA_EN_DCF_RX</name>
	<description>DCF timer for pa_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG1_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000083</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>PA_LDO_EN_DCF_TX</name>
	<description>DCF timer for pa_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>PA_LDO_EN_DCF_RX</name>
	<description>DCF timer for pa_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG20_REG</name>
	
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>LNA_CORE_EN_DCF_TX</name>
	<description>DCF timer for lna_core_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>LNA_CORE_EN_DCF_RX</name>
	<description>DCF timer for lna_core_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
