irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG21_REG</name>
	
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>LNA_CGM_EN_DCF_TX</name>
	<description>DCF timer for lna_cgm_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>LNA_CGM_EN_DCF_RX</name>
	<description>DCF timer for lna_cgm_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG22_REG</name>
	
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>MIX_EN_DCF_TX</name>
	<description>DCF timer for mix_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>MIX_EN_DCF_RX</name>
	<description>DCF timer for mix_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG23_REG</name>
	
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>MIX_BIAS_SH_OPEN_DCF_TX</name>
	<description>DCF timer for mix_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>MIX_BIAS_SH_OPEN_DCF_RX</name>
	<description>DCF timer for mix_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG24_REG</name>
	
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>IFF_EN_DCF_TX</name>
	<description>DCF timer for iff_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>IFF_EN_DCF_RX</name>
	<description>DCF timer for iff_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG25_REG</name>
	
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>IFF_BIAS_SH_OPEN_DCF_TX</name>
	<description>DCF timer for iff_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>IFF_BIAS_SH_OPEN_DCF_RX</name>
	<description>DCF timer for iff_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG26_REG</name>
	
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ADC_CLK_EN_DCF_TX</name>
	<description>DCF timer for adc_clk_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>ADC_CLK_EN_DCF_RX</name>
	<description>DCF timer for adc_clk_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG27_REG</name>
	
	<addressOffset>0x0000006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ADC_EN_DCF_TX</name>
	<description>DCF timer for adc_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>ADC_EN_DCF_RX</name>
	<description>DCF timer for adc_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG28_REG</name>
	
	<addressOffset>0x00000070</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000041</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ADPLL_DCO_EN_DCF_TX</name>
	<description>DCF timer for adpll_dco_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>ADPLL_DCO_EN_DCF_RX</name>
	<description>DCF timer for adpll_dco_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG29_REG</name>
	
	<addressOffset>0x00000074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000041</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ADPLL_CLK_EN_DCF_TX</name>
	<description>DCF timer for adpll_clk_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>ADPLL_CLK_EN_DCF_RX</name>
	<description>DCF timer for adpll_clk_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG2_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>LNA_LDO_EN_DCF_TX</name>
	<description>DCF timer for lna_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>LNA_LDO_EN_DCF_RX</name>
	<description>DCF timer for lna_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG30_REG</name>
	
	<addressOffset>0x00000078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000107</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ADPLLDIG_RST_DCF_TX</name>
	<description>DCF timer for adplldig_rst in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>ADPLLDIG_RST_DCF_RX</name>
	<description>DCF timer for adplldig_rst in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
