irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG31_REG</name>
	
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000149</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ADPLLDIG_EN_DCF_TX</name>
	<description>DCF timer for adplldig_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>ADPLLDIG_EN_DCF_RX</name>
	<description>DCF timer for adplldig_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG32_REG</name>
	
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ADPLLDIG_RX_EN_DCF_TX</name>
	<description>DCF timer for adplldig_rx_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>ADPLLDIG_RX_EN_DCF_RX</name>
	<description>DCF timer for adplldig_rx_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG33_REG</name>
	
	<addressOffset>0x00000084</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000001e0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ADPLLDIG_PAIN_EN_DCF_TX</name>
	<description>DCF timer for adplldig_pain_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>ADPLLDIG_PAIN_EN_DCF_RX</name>
	<description>DCF timer for adplldig_pain_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG34_REG</name>
	
	<addressOffset>0x00000088</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000001c0</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ADPLL_LOBUF_PA_EN_DCF_TX</name>
	<description>DCF timer for adpll_lobuf_pa_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>ADPLL_LOBUF_PA_EN_DCF_RX</name>
	<description>DCF timer for adpll_lobuf_pa_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG35_REG</name>
	
	<addressOffset>0x0000008c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000294</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>CAL_EN_DCF_TX</name>
	<description>DCF timer for cal_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>CAL_EN_DCF_RX</name>
	<description>DCF timer for cal_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG36_REG</name>
	
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000011</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>DEM_EN_DCF_TX</name>
	<description>DCF timer for dem_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>DEM_EN_DCF_RX</name>
	<description>DCF timer for dem_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG37_REG</name>
	
	<addressOffset>0x00000094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>SPARE_DEM_DC_PARCAL_DCF_TX</name>
	<description>Spare DCF timer in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>DEM_DC_PARCAL_EN_DCF_RX</name>
	<description>DCF timer for DC partial Calibration enable in rx mode. It is OR'd with the relevant register bit that enables the partial calibration.</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG38_REG</name>
	
	<addressOffset>0x00000098</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000011</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>SPARE_DEM_AGC_UNFREEZE_EN_DCF_TX</name>
	<description>Spare DCF timer in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>DEM_AGC_UNFREEZE_EN_DCF_RX</name>
	<description>DCF timer for unfreezing the AGC in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG39_REG</name>
	
	<addressOffset>0x0000009c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000013</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>SPARE_DEM_SIGDETECT_EN_DCF_TX</name>
	<description>Spare DCF timer in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>DEM_SIGDETECT_EN_DCF_RX</name>
	<description>DCF timer for enabling the signal_detect in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG3_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>MIX_LDO_EN_DCF_TX</name>
	<description>DCF timer for mix_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>MIX_LDO_EN_DCF_RX</name>
	<description>DCF timer for mix_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
