irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG8_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000083</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>ADPLL_DCO_LDO_EN_DCF_TX</name>
	<description>DCF timer for adpll_dco_ldo_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>ADPLL_DCO_LDO_EN_DCF_RX</name>
	<description>DCF timer for adpll_dco_ldo_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG9_REG</name>
	
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000041</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>LDO_ZERO_EN_DCF_TX</name>
	<description>DCF timer for ldo_zero_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	
</field><field>
	<name>LDO_ZERO_EN_DCF_RX</name>
	<description>DCF timer for ldo_zero_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PORT_EN_REG</name>
	
	<addressOffset>0x00000188</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>RF_PORT4_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_31_REG</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>RF_PORT4_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_31_REG</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>RF_PORT3_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_30_REG</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>RF_PORT3_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_30_REG</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>RF_PORT2_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_29_REG</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>RF_PORT2_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_29_REG</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>RF_PORT1_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_28_REG</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RF_PORT1_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_28_REG</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RF_PORT0_TX</name>
	<description>Enable port by TX, timing according RF_CNTRL_TIMER_27_REG</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RF_PORT0_RX</name>
	<description>Enable port by RX, timing according RF_CNTRL_TIMER_27_REG</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>RF_PORT_POL_REG</name>
	
	<addressOffset>0x0000018c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>RF_PORT4_POL</name>
	<description>Inverts polarity of RF_PORT</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>RF_PORT3_POL</name>
	<description>Inverts polarity of RF_PORT</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>RF_PORT2_POL</name>
	<description>Inverts polarity of RF_PORT</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>RF_PORT1_POL</name>
	<description>Inverts polarity of RF_PORT</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>RF_PORT0_POL</name>
	<description>Inverts polarity of RF_PORT</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>RFMON</name>
	<version>1.0</version>
	<description>RFMON registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50040600</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>24</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>RFMON_ADDR_REG</name>
	<description>AHB master start address</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RFMON_ADDR</name>
	<description>It is the bits [31:2] of base address that is used by the AHB master interface of the controller. Defines the AHB address from where the controller will start to stores data. The bits [1:0] of the address are considered always 0.</description>
	<access>read-write</access>
	<bitRange>[31:2]</bitRange>
	
</field></fields>
</register><register>
	<name>RFMON_CRV_ADDR_REG</name>
	<description>AHB master current address</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RFMON_CRV_ADDR</name>
	<description>It is the bits [31:2] of AHB address that will be used by the controller in the next memory access. The bits [1:0] are always 0.</description>
	<access>read-only</access>
	<bitRange>[31:2]</bitRange>
	
</field></fields>
</register><register>
	<name>RFMON_CRV_LEN_REG</name>
	<description>The remaining data to be transferred</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>RFMON_CRV_LEN</name>
	<description>Indicates the number of words (minus 1) that remain to be transfered.</description>
	<access>read-only</access>
	<bitRange>[16:0]</bitRange>
	
