irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SDADC</name>
	<version>1.0</version>
	<description>SDADC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50020800</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>28</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>SDADC_CLEAR_INT_REG</name>
	<description>Sigma Delta ADC Clear Interrupt Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SDADC_CLR_INT</name>
	<description>Writing any value to this register will clear the ADC_INT interrupt. Reading returns 0. </description>
	<access>write-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SDADC_CTRL_REG</name>
	<description>Sigma Delta ADC Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields>
	<field>
	<name>SDADC_DMA_EN</name>
	<description>0: DMA functionality disabled
1: DMA functionality enabled</description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>SDADC_MINT</name>
	<description>0: Disable (mask) SDADC_ADC_INT.
1: Enable SDADC_ADC_INT to ICU.</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>SDADC_INT</name>
	<description>1: AD conversion ready and has generated an interrupt. Must be cleared by writing any value to SDADC_CLEAR_INT_REG.</description>
	<access>read-only</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>SDADC_LDO_OK</name>
	<description>1: Internal LDO is ready for use</description>
	<access>read-only</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>SDADC_VREF_SEL</name>
	<description>0: Internal bandgap reference.
1: External reference.</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>SDADC_CONT</name>
	<description>0: Manual ADC mode, a single result will be generated after setting the SDADC_START bit.
1: Continuous ADC mode, new ADC results will be constantly stored in SDADC_RESULT_REG. Still SDADC_START has to be set to start the execution. Wait for SDADC_START to become zero after clearing the SDADC_CONT bit to stop the continuous mode.</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>SDADC_OSR</name>
	<description>Oversample Rate
0: 128x
1: 256x
2: 512x
3: 1024x</description>
	<access>read-write</access>
	<bitRange>[11:10]</bitRange>
	
</field><field>
	<name>SDADC_SE</name>
	<description>0: Differential mode
1: Single ended mode (Input selection negative side is ignored)</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>SDADC_INN_SEL</name>
	<description>Input selection of negative side.
0: ADC0 / P1[09]
1: ADC1 / P0[25]
2: ADC2 / P0[08]
3: ADC3 / P0[09]
4: ADC4 / P1[14]
5: ADC5 / P1[20]
6: ADC6 / P1[21]
7: ADC7 / P1[22]</description>
	<access>read-write</access>
	<bitRange>[8:6]</bitRange>
	
</field><field>
	<name>SDADC_INP_SEL</name>
	<description>Input selection of positive side.
0: ADC0 / P1[09]
1: ADC1 / P0[25]
2: ADC2 / P0[08]
3: ADC3 / P0[09]
4: ADC4 / P1[14]
5: ADC5 / P1[20]
6: ADC6 / P1[21]
7: ADC7 / P1[22]
8: VBAT (via 4x attenuator, INN connected to ground)</description>
	<access>read-write</access>
	<bitRange>[5:2]</bitRange>
	
</field><field>
	<name>SDADC_START</name>
	<description>0: ADC conversion ready.
1: If a 1 is written, the ADC starts a conversion. After the conversion this bit will be set to 0 and the SDADC_INT bit will be set. It is not allowed to write this bit while it is not (yet) zero.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SDADC_EN</name>
	<description>0: LDO is off and ADC is disabled.
1: LDO, bias currents and modulator are enabled.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SDADC_GAIN_CORR_REG</name>
	<description>Sigma Delta ADC Gain Correction Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>SDADC_GAIN_CORR</name>
	<description>Gain adjust</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SDADC_OFFS_CORR_REG</name>
	<description>Sigma Delta ADC Offset Correction Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>SDADC_OFFS_CORR</name>
	<description>Offset adjust</description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SDADC_RESULT_REG</name>
	<description>Sigma Delta ADC Result Register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SDADC_VAL</name>
	<description>Returns up to 16 bits linear value of the last AD conversion. The effective resolution depends on the OSR used.</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SDADC_TEST_REG</name>
	<description>Sigma Delta ADC Test Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00007980</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SDADC_GAIN_SEL_INIT</name>
	<description>ADC 'attenuator' in analogue, digital filter default 4/5 (not adjustable).
5x'1': 5/5
4x'1': 4/5 (default)
3x'1': 3/5
2x'1': 2/5
1x'1': 1/5
Order of '0' and '1' don't care, they are being rotated using DEM.</description>
	<access>read-write</access>
	<bitRange>[15:11]</bitRange>
	
</field><field>
	<name>SDADC_CORR_ORDER</name>
	<description>Gain/offset correction order:
0: First gain, second offset
1: First offset, second gain</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>SDADC_OTA_BIAS</name>
	<description>OTA bias current:
0: 2x
1: 1x (default)
2: 0.5x
3: 0.25x</description>
	<access>read-write</access>
	<bitRange>[9:8]</bitRange>
	
</field><field>
	<name>SDADC_CLK_FREQ</name>
	<description>0: 250 kHz
1: 500 kHz
2: 1 MHz (default)
3: 2 MHz</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>SDADC_LDO_TEST</name>
	<description>1: Connects LDO output to testbus.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>SDADC_LDO_SMPL_DIS</name>
	<description>1: Disables automatic LDO sample and hold.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>SDADC_OPMODE</name>
	<description>0: IADC (default)
1: DS ADC (continuous bitstream output, one initial reset at start, dig filter disabled)</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>SDADC_DEM_DIS</name>
	<description>1: Disables Dynamic Element Matching in the input circuit.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SDADC_CHOP_DIS</name>
	<description>1: Disables chopper stabilisation.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
