irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SMOTOR</name>
	<version>1.0</version>
	<description>SMOTOR registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50030e00</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>132</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>CMD_TABLE_BASE</name>
	<description>Base address of the command table</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>CMD_TABLE_BASE_X</name>
	<description>Dummy field for register test generation.</description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PG0_CTRL_REG</name>
	<description>Pattern generator 0 control register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000fe4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>GENEND_IRQ_EN</name>
	<description>Determines if the corresponding pattern generator will contribute to the generation of the IRQ when it is done generating a pattern. It is only valid if SMOTOR_GENEND_IRQ_EN is enabled:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>GENSTART_IRQ_EN</name>
	<description>Determines if the corresponding pattern generator will contribute to the generation of the IRQ when it starts generating a pattern. It is only valid if SMOTOR_GENSTART_IRQ_EN is enabled:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>PG_START_MODE</name>
	<description>0 = Auto start mode: pattern generator will start whenever all enabled signals have received a command
1 = Manual start mode: pattern generator will only start if it has been given a PG_START, and all enabled signals have received a command</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>PG_MODE</name>
	<description>0 = Flex mode
1 = Pair mode</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>SIG3_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>SIG2_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>SIG1_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>SIG0_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>OUT3_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>OUT2_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>OUT1_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>OUT0_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>PG1_CTRL_REG</name>
	<description>Pattern generator 1 control register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000fe4</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>GENEND_IRQ_EN</name>
	<description>Determines if the corresponding pattern generator will contribute to the generation of the IRQ when it is done generating a pattern. It is only valid if SMOTOR_GENEND_IRQ_EN is enabled:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<access>read-write</access>
	<bitRange>[15:15]</bitRange>
	
</field><field>
	<name>GENSTART_IRQ_EN</name>
	<description>Determines if the corresponding pattern generator will contribute to the generation of the IRQ when it starts generating a pattern. It is only valid if SMOTOR_GENSTART_IRQ_EN is enabled:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>PG_START_MODE</name>
	<description>0 = Auto start mode: pattern generator will start whenever all enabled signals have received a command
1 = Manual start mode: pattern generator will only start if it has been given a PG_START, and all enabled signals have received a command</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>PG_MODE</name>
	<description>0 = Flex mode
1 = Pair mode</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>SIG3_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>SIG2_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>SIG1_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>SIG0_EN</name>
	<description>0 = Signal disabled
1 = Signal enabled</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>OUT3_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>OUT2_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	
</field><field>
	<name>OUT1_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>OUT0_SIG</name>
	<description>Selects which signal is routed to the output.</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
