irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>SMOTOR_CMD_FIFO_REG</name>
	<description>Motor control command FIFO register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SMOTOR_CMD_FIFO</name>
	<description>Writing to this address will push a command into the command FIFO.</description>
	<access>write-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SMOTOR_CMD_READ_PTR_REG</name>
	<description>Command read pointer register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>SMOTOR_CMD_READ_PTR</name>
	<description>Pointer to the next command to be popped from the FIFO. The command at SMOTOR_CMD_READ_PTR-1 is the last command that has been popped from the FIFO into its corresponding PG.</description>
	<access>read-only</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SMOTOR_CMD_WRITE_PTR_REG</name>
	<description>Command write pointer register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>SMOTOR_CMD_WRITE_PTR</name>
	<description>Pointer to the location in the FIFO where the next command will be pushed at. The last command pushed to the FIFO is at SMOTOR_CMD_WRITE_PTR - 1</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SMOTOR_CTRL_REG</name>
	<description>Motor control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x1fffffff</resetMask>
	<fields>
	<field>
	<name>TRIG_RTC_EVENT_EN</name>
	<description>0 = RTC event does not trigger command pop
1 = RTC even triggers command pop</description>
	<access>read-write</access>
	<bitRange>[28:28]</bitRange>
	
</field><field>
	<name>MC_LP_CLK_TRIG_EN</name>
	<description>0 = Divided sleep clock does not trigger command pop
1 = Divided sleep clock triggers command pop</description>
	<access>read-write</access>
	<bitRange>[27:27]</bitRange>
	
</field><field>
	<name>SMOTOR_THRESHOLD_IRQ_EN</name>
	<description>IRQ in the event of the FIFO level (write pointer - read pointer) reaching, or is below the threshold determined by SMOTOR_THRESHOLD.
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<access>read-write</access>
	<bitRange>[26:26]</bitRange>
	
</field><field>
	<name>SMOTOR_THRESHOLD</name>
	<description>Determines the FIFO level (write pointer - read pointer) at or below which and IRQ can be triggered using SMOTOR_THRESHOLD_IRQ_EN.</description>
	<access>read-write</access>
	<bitRange>[25:21]</bitRange>
	
</field><field>
	<name>SMOTOR_FIFO_UNR_IRQ_EN</name>
	<description>IRQ in the event of FIFO underrun:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<access>read-write</access>
	<bitRange>[20:20]</bitRange>
	
</field><field>
	<name>SMOTOR_FIFO_OVF_IRQ_EN</name>
	<description>IRQ in the event of FIFO overflow:
0 = IRQ is disabled
1 = IRQ is enabled</description>
	<access>read-write</access>
	<bitRange>[19:19]</bitRange>
	
</field><field>
	<name>SMOTOR_GENEND_IRQ_EN</name>
	<description>IRQ in the event a pattern generator (configured to do so through its corresponding GENEND_IRQ_EN bit) has ended generating a pattern:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<access>read-write</access>
	<bitRange>[18:18]</bitRange>
	
</field><field>
	<name>SMOTOR_GENSTART_IRQ_EN</name>
	<description>IRQ in the event a pattern generator (configured to do so through its corresponding GENSTART_IRQ_EN bit) has just started generating a pattern:
0 = Interrupt requests disabled
1 = Interrupt requests enabled</description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>SMOTOR_MOI</name>
	<description>Idle time of a PG after generating a waveform. A PG will remain busy for the last signal's MOI to finish.</description>
	<access>read-write</access>
	<bitRange>[16:7]</bitRange>
	
</field><field>
	<name>CYCLIC_SIZE</name>
	<description>Depth of the cyclic buffer, only valid if CYCLIC_MODE is 1</description>
	<access>read-write</access>
	<bitRange>[6:1]</bitRange>
	
</field><field>
	<name>CYCLIC_MODE</name>
	<description>Determines operation mode of command FIFO:
0 = Normal FIFO mode
1 = Cyclic buffer mode, CYCLIC_SIZE determines buffer depth</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SMOTOR_IRQ_CLEAR_REG</name>
	<description>Motor control IRQ clear register</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>THRESHOLD_IRQ_CLEAR</name>
	<description>Clears the THRESHOLD_IRQ_STATUS bit.</description>
	<access>write-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>FIFO_UNR_IRQ_CLEAR</name>
	<description>Clears the FIFO_UNR_IRQ_STATUS bit.</description>
	<access>write-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>FIFO_OVF_IRQ_CLEAR</name>
	<description>Clears the FIFO_OVF_IRQ_STATUS bit.</description>
	<access>write-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>GENEND_IRQ_CLEAR</name>
	<description>Clears the GENEND_IRQ_CLEAR bit.</description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>GENSTART_IRQ_CLEAR</name>
	<description>Clears the GENSTART_IRQ_CLEAR bit.</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
