irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>SMOTOR_STATUS_REG</name>
	<description>Motor controller status register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>PG4_BUSY</name>
	<description>Tells whether the PG is busy/generating a waveform.</description>
	<access>read-only</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>PG3_BUSY</name>
	<description>Tells whether the PG is busy/generating a waveform.</description>
	<access>read-only</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>PG2_BUSY</name>
	<description>Tells whether the PG is busy/generating a waveform.</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>PG1_BUSY</name>
	<description>Tells whether the PG is busy/generating a waveform.</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>PG0_BUSY</name>
	<description>Tells whether the PG is busy/generating a waveform.</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>THRESHOLD_IRQ_STATUS</name>
	<description>Tells whether the THRESHOLD_IRQ fired. Can be cleared with corresponding _CLEAR bit.</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>FIFO_UNR_IRQ_STATUS</name>
	<description>Tells whether the FIFO_UNR_IRQ fired. Can be cleared with corresponding _CLEAR bit.</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>FIFO_OVF_IRQ_STATUS</name>
	<description>Tells whether the FIFO_OVF_IRQ fired. Can be cleared with corresponding _CLEAR bit.</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>GENEND_IRQ_STATUS</name>
	<description>Tells whether the GENEND_IRQ fired. Can be cleared with corresponding _CLEAR bit.</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>GENSTART_IRQ_STATUS</name>
	<description>Tells whether the GENSTART_IRQ fired. Can be cleared with corresponding _CLEAR bit.</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>SMOTOR_TRIGGER_REG</name>
	<description>Motor controller trigger register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields>
	<field>
	<name>PG4_START</name>
	<description>Writing 1 to this bit will start PG4 in manual mode.</description>
	<access>write-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>PG3_START</name>
	<description>Writing 1 to this bit will start PG3 in manual mode.</description>
	<access>write-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>PG2_START</name>
	<description>Writing 1 to this bit will start PG2 in manual mode.</description>
	<access>write-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>PG1_START</name>
	<description>Writing 1 to this bit will start PG1 in manual mode.</description>
	<access>write-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>PG0_START</name>
	<description>Writing 1 to this bit will start PG0 in manual mode.</description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>POP_CMD</name>
	<description>Writing 1 will pop one or more commands from the command buffer into its corresponding pattern generator</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WAVETABLE_BASE</name>
	<description>Base address of the wavetable</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x1f1f1f1f</resetMask>
	<fields>
	<field>
	<name>WAVETABLE_BASE_X_B3</name>
	<description>Dummy bitfield for register test generation.</description>
	<access>read-write</access>
	<bitRange>[28:24]</bitRange>
	
</field><field>
	<name>WAVETABLE_BASE_X_B2</name>
	<description>Dummy bitfield for register test generation.</description>
	<access>read-write</access>
	<bitRange>[20:16]</bitRange>
	
</field><field>
	<name>WAVETABLE_BASE_X_B1</name>
	<description>Dummy bitfield for register test generation.</description>
	<access>read-write</access>
	<bitRange>[12:8]</bitRange>
	
</field><field>
	<name>WAVETABLE_BASE_X_B0</name>
	<description>Dummy bitfield for register test generation.</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SNC</name>
	<version>1.0</version>
	<description>SNC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50020c00</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>32</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>SNC_CTRL_REG</name>
	<description>Sensor Node Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SNC_IRQ_ACK</name>
	<description>When set, the specific bit-field auto-clears the SNC_IRQ_EN field, if the latter is already set. By this way, the IRQ line towards either the CM33 and/or the PDC is cleared. Hence, the CM33 should set this bit-field as soon as it captures the interrupt from the Sensor Node.
Note: Any SW writes to this bit-field will be discarded if the SNC_IRQ_EN bit-field is not set. It is finally noted that the SNC_IRQ_ACK bit-field is also auto-clear and it is de-asserted together with SNC_IRQ_EN.</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>SNC_IRQ_CONFIG</name>
	<description>The specific bit-field determines if the IRQ line of the Sensor Node will be routed towards either the host processor (CM33) or the Power Domains Controller (PDC), or to both of them, according to the following configuration:
0x0 = Neither the CM33 nor the PDC are triggered, both IRQ lines are low regardless of the value of SNC_IRQ_EN bit-field.
0x1 = CM33 should be triggered, provided that SNC_IRQ_EN is set
0x2 = PDC should be triggered, provided that SNC_IRQ_EN is set
0x3 = Both CM33 and PDC should be triggered, provided that SNC_IRQ_EN is set
Note: It must be noted that the specific bit-field is locked after set the SNC_IRQ_EN field of the same register. Hence, the SNC IRQ configuration cannot be changed after the IRQ bit-field is set and before the IRQ is acknowledged (by CM33). It is also noted that after having set SNC_IRQ_EN via SW, the specific bit-field can be de-asserted only by setting the SNC_IRQ_ACK bit-field (see also the description of this bit-field, also residing in SNC_CTRL_REG).</description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	
</field><field>
	<name>SNC_IRQ_EN</name>
	<description>When set, the specific bit-field may generate a (level-sensitive) IRQ to trigger either the host processor (CM33) or the Power Domains Controller (PDC) or both, depending on the configuration set in the SNC_IRQ_CONFIG bit-field of SNC_CTRL_REG. As soon as the SNC_IRQ_EN is set, it can be cleared only by setting the SNC_IRQ_ACK bit-field.</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>SNC_BRANCH_LOOP_INIT</name>
	<description>When set, it clears the value of the counter used in the Sensor Node's branch command (COBR), when performing an iterative branch of up to 128 times. This bit-field is auto-cleared with the next SNC clock.</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>SNC_RESET</name>
	<description>This is the Sensor Node Controller's synchronous clear bit-field. When set, it resets the state of the Sensor Node Controller and sets back its program counter (SNC_PC_REG) to the programmed base address, as determined by SNC_BASE_REG register (located in memory controller). This bit-field is auto-cleared with the next SNC clock.
Note: Setting this bit-field may interrupt the Sensor Node's regular execution and any command currently being exeucuted may be abnormally terminated.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>BUS_ERROR_DETECT_EN</name>
	<description>When set, it enables the detection of system bus errors that may occur in case a non-mapped address is used by the Sensor Node controller, when performing a register access.
Note: In case of a bus error detection, the Sensor Node will set to '1' the BUS_ERROR_STATUS bit-field of SNC_STATUS_REG and will continue normally to the next command.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>SNC_SW_CTRL</name>
	<description>When set, this bit-field bypasses the enable of Sensor Node that comes from the PDC. In this mode, the Sensor Node can be started and stopped via the SNC_EN bit-field of SNC_CTRL_REG.
Note: This mode is suggested to be used for debugging purposes. &#196;lso, the base address of the Sensor Node should have been programmed to the target value, before this bit-field is set.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>SNC_EN</name>
	<description>Sensor Node Controller's enable bit-field. When set, it may activate the Sensor Node, provided that the SNC_SW_CTRL bit-field is also set. If not, then the specific bit-field is not effective and Sensor Node's actual enable is controller by the Power Domains Controller (PDC).
Note: When SNC_SW_CTRL bit-field is set, the Sensor Node is controlled by the user. Thus, in that mode, it can be started and stopped by setting and resetting the SNC_EN field. When SNC_EN is reset, the Sensor Node will first complete the last on-going command before being halted.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
