irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>SPI2_RX_TX_REG</name>
	<description>SPI RX/TX register0</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SPI_DATA</name>
	<description>Write: SPI_TX_REG output register 0 (TX-FIFO)
Read: SPI_RX_REG input register 0 (RX-FIFO)
In 8 or 9 bits mode bits 31 to 8 are not used, they contain old data.
In 16 bits mode bits 31 to 16 are not used, they contain old data. </description>
	<access>write-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SYS_WDOG</name>
	<version>1.0</version>
	<description>SYS_WDOG registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000700</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>8</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>WATCHDOG_CTRL_REG</name>
	<description>Watchdog control register.</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000006</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>WRITE_BUSY</name>
	<description>0 = A new WATCHDOG_REG[WDOG_VAL] can be written.
1 = No new WATCHDOG_REG[WDOG_VAL] can be written.
Note: It takes some time before the programmed WDOG_VAL is updated in the (independent) Watchdog timer. During this time it is not possible to write a new value to WATCHDOG_REG[WDOG_VAL].</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>WDOG_FREEZE_EN</name>
	<description>0 = Watchdog timer can not be frozen when NMI_RST=0.
1 = Watchdog timer can be frozen/resumed using
SET_FREEZE_REG[FRZ_WDOG]/
RESET_FREEZE_REG[FRZ_WDOG] when NMI_RST=0.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>NMI_RST</name>
	<description>0 = Watchdog timer generates NMI at value 0, and WDOG (SYS) reset at &lt;= -16. Timer can be frozen/resumed using
SET_FREEZE_REG[FRZ_WDOG]/
RESET_FREEZE_REG[FRZ_WDOG].
1 = Watchdog timer generates a WDOG (SYS) reset at value 0 and can not be frozen by Software.
Note that this bit can only be set to 1 by SW and only be reset with a WDOG (SYS) reset or SW reset.
The watchdog is always frozen when the Cortex-M33 is halted in DEBUG State. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WATCHDOG_REG</name>
	<description>Watchdog timer register.</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00001fff</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>WDOG_WEN</name>
	<description>Bit [31:14] = 0 = Write enable for Watchdog timer
else Write disable. This filter prevents unintentional presetting the watchdog with a SW run-away. </description>
	<access>write-only</access>
	<bitRange>[31:14]</bitRange>
	
</field><field>
	<name>WDOG_VAL_NEG</name>
	<description>0 = Watchdog timer value is positive.
1 = Watchdog timer value is negative. </description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>WDOG_VAL</name>
	<description>Write: Watchdog timer reload value. Note that all bits [31-14] must be 0 to reload this register.
Read: Actual Watchdog timer value. Decremented by 1 every ~10 msec (RC32K) or ~29 msec(RCX).
Bit 13 indicates a negative counter value. 2, 1, 0, 3FFF16, 3FFE16 etc. An NMI or WDOG (SYS) reset is generated under the following conditions:
If WATCHDOG_CTRL_REG[NMI_RST] = 0 then
  If WDOG_VAL = 0 -&gt; NMI (Non Maskable Interrupt)
  if WDOG_VAL =3FF016 -&gt; WDOG reset -&gt; reload 1FFF16
If WATCHDOG_CTRL_REG[NMI_RST] = 1 then
  if WDOG_VAL &lt;= 0 -&gt; WDOG reset -&gt; reload 1FFF16
Note 1: The programmed value WDOG_VAL is updated in the (independent) Watchdog timer at the 2nd next RC32K or RCX clock tick.
Note 2: Select RC32K or RCX with CLK_RCX_REG[RCX_ENABLE]. The RC32K is selected by default.</description>
	<access>read-write</access>
	<bitRange>[12:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>TIMER</name>
	<version>1.0</version>
	<description>TIMER registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50010200</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>76</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>TIMER_CAPTURE_GPIO1_REG</name>
	<description>Timer value for event on GPIO1</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_CAPTURE_GPIO1</name>
	<description>Gives the Capture time for event on GPIO1</description>
	<access>read-only</access>
	<bitRange>[23:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_CAPTURE_GPIO2_REG</name>
	<description>Timer value for event on GPIO2</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_CAPTURE_GPIO2</name>
	<description>Gives the Capture time for event on GPIO2</description>
	<access>read-only</access>
	<bitRange>[23:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_CAPTURE_GPIO3_REG</name>
	<description>Timer value for event on GPIO1</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_CAPTURE_GPIO3</name>
	<description>Gives the Capture time for event on GPIO3</description>
	<access>read-only</access>
	<bitRange>[23:0]</bitRange>
	
