irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>TIMER_CAPTURE_GPIO4_REG</name>
	<description>Timer value for event on GPIO1</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_CAPTURE_GPIO4</name>
	<description>Gives the Capture time for event on GPIO4</description>
	<access>read-only</access>
	<bitRange>[23:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_CLEAR_GPIO_EVENT_REG</name>
	<description>Timer clear gpio event register</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>TIM_CLEAR_GPIO4_EVENT</name>
	<description>1 = Clear GPIO4 event. Return always 0</description>
	<access>write-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>TIM_CLEAR_GPIO3_EVENT</name>
	<description>1 = Clear GPIO3 event. Return always 0</description>
	<access>write-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>TIM_CLEAR_GPIO2_EVENT</name>
	<description>1 = Clear GPIO2 event. Return always 0</description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>TIM_CLEAR_GPIO1_EVENT</name>
	<description>1 = Clear GPIO1 event. Return always 0</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_CLEAR_IRQ_REG</name>
	<description>Timer clear interrupt</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TIM_CLEAR_IRQ</name>
	<description>Write any value clear interrupt</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_CTRL_REG</name>
	<description>Timer control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_CAP_GPIO4_IRQ_EN</name>
	<description>0 = Event on GPIO4 does not create a CAPTIM interrrupt
1 = Event on GPIO4 creates a CAPTIM interrrupt</description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	
</field><field>
	<name>TIM_CAP_GPIO3_IRQ_EN</name>
	<description>0 = Event on GPIO3 does not create a CAPTIM interrrupt
1 = Event on GPIO3 creates a CAPTIM interrrupt</description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	
</field><field>
	<name>TIM_CAP_GPIO2_IRQ_EN</name>
	<description>0 = Event on GPIO2 does not create a CAPTIM interrrupt
1 = Event on GPIO2 creates a CAPTIM interrrupt</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	
</field><field>
	<name>TIM_CAP_GPIO1_IRQ_EN</name>
	<description>0 = Event on GPIO1 does not create a CAPTIM interrrupt
1 = Event on GPIO1 creates a CAPTIM interrrupt</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>TIM_IN4_EVENT_FALL_EN</name>
	<description>Event input 4 edge type
1 = falling edge
0 = rising edge</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>TIM_IN3_EVENT_FALL_EN</name>
	<description>Event input 3 edge type
1 = falling edge
0 = rising edge</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>TIM_CLK_EN</name>
	<description>Timer clock enable
1 = clock enabled
0 = clock disabled</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>TIM_SYS_CLK_EN</name>
	<description>Select clock
1 = Timer uses the DIVN clock
0 = Timer uses the lp clock</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>TIM_FREE_RUN_MODE_EN</name>
	<description>Valid when timer counts up, if it is '1' timer does not zero when reaches to reload value. it becomes zero only when it reaches the max value.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>TIM_IRQ_EN</name>
	<description>Interrupt mask
1 = timer IRQ is unmasked
0 = timer IRQ is masked</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>TIM_IN2_EVENT_FALL_EN</name>
	<description>Event input 2 edge type
1 = falling edge
0 = rising edge</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>TIM_IN1_EVENT_FALL_EN</name>
	<description>Event input 1 edge type
1 = falling edge
0 = rising edge</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>TIM_COUNT_DOWN_EN</name>
	<description>Timer count direction
1 = down
0 = up</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>TIM_ONESHOT_MODE_EN</name>
	<description>Timer mode
1 = One shot enabled
0 = Counter enabled</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>TIM_EN</name>
	<description>Timer enable
1 = On
0 = Off</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_GPIO1_CONF_REG</name>
	<description>Timer gpio1 selection</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_GPIO1_CONF</name>
	<description>Select one of the 32 GPIOs as IN1, Valid value 0-32. 1 for the first gpio, 32 for the last gpio. 0 Disable input</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_GPIO2_CONF_REG</name>
	<description>Timer gpio2 selection</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_GPIO2_CONF</name>
	<description>Select one of the 32 GPIOs as IN2, Valid value 0-32. 1 for the first gpio, 32 for the last gpio. 0 Disable input</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
