irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>TIMER_GPIO3_CONF_REG</name>
	<description>Timer gpio3 selection</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_GPIO3_CONF</name>
	<description>Select one of the 32 GPIOs as IN3, Valid value 0-32. 1 for the first gpio, 32 for the last gpio. 0 Disable input</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_GPIO4_CONF_REG</name>
	<description>Timer gpio4 selection</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_GPIO4_CONF</name>
	<description>Select one of the 32 GPIOs as IN4, Valid value 0-32. 1 for the first gpio, 32 for the last gpio. 0 Disable input</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_PRESCALER_REG</name>
	<description>Timer prescaler value</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_PRESCALER</name>
	<description>Defines the timer count frequency. CLOCK frequency / (TIM_PRESCALER+1)</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_PRESCALER_VAL_REG</name>
	<description>Timer prescaler counter valuew</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_PRESCALER_VAL</name>
	<description>Gives the current prescaler counter value</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_PWM_DC_REG</name>
	<description>Timer pwm dc register</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_PWM_DC</name>
	<description>Defines the PWM duty cycle. TIM_PWM_DC / ( TIM_PWM_FREQ+1)</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_PWM_FREQ_REG</name>
	<description>Timer pwm frequency register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_PWM_FREQ</name>
	<description>Defines the PWM frequency. Timer clock frequency / (TIM_PWM_FREQ+1)
Timer clock is clock after prescaler</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_RELOAD_REG</name>
	<description>Timer reload value and Delay in shot mode</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_RELOAD</name>
	<description>Reload or max value in timer mode, Delay phase duration in oneshot mode. Actual delay is the register value plus synchronization time (3 clock cycles)</description>
	<access>read-write</access>
	<bitRange>[23:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_SHOTWIDTH_REG</name>
	<description>Timer Shot duration in shot mode</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_SHOTWIDTH</name>
	<description>Shot phase duration in oneshot mode</description>
	<access>read-write</access>
	<bitRange>[23:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_STATUS_REG</name>
	<description>Timer status register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_GPIO4_EVENT_PENDING</name>
	<description>When 1, GPIO4 event is pending.</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>TIM_GPIO3_EVENT_PENDING</name>
	<description>When 1, GPIO3 event is pending.</description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>TIM_GPIO2_EVENT_PENDING</name>
	<description>When 1, GPIO2 event is pending.</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>TIM_GPIO1_EVENT_PENDING</name>
	<description>When 1, GPIO1 event is pending. </description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>TIM_ONESHOT_PHASE</name>
	<description>OneShot phase
0 = Wait for event
1 = Delay phase
2 = Start Shot
3 = Shot phase</description>
	<access>read-only</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>TIM_IN2_STATE</name>
	<description>Gives the logic level of the IN1</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>TIM_IN1_STATE</name>
	<description>Gives the logic level of the IN2</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER_TIMER_VAL_REG</name>
	<description>Timer counter value</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_TIMER_VALUE</name>
	<description>Gives the current timer value</description>
	<access>read-only</access>
	<bitRange>[23:0]</bitRange>
	
