irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>TIMER2_PWM_FREQ_REG</name>
	<description>Timer pwm frequency register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_PWM_FREQ</name>
	<description>Defines the PWM frequency. Timer clock frequency / (TIM_PWM_FREQ+1)
Timer clock is clock after prescaler</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER2_RELOAD_REG</name>
	<description>Timer reload value and Delay in shot mode</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_RELOAD</name>
	<description>Reload or max value in timer mode, Delay phase duration in oneshot mode. Actual delay is the register value plus synchronization time (3 clock cycles)</description>
	<access>read-write</access>
	<bitRange>[23:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER2_SHOTWIDTH_REG</name>
	<description>Timer Shot duration in shot mode</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_SHOTWIDTH</name>
	<description>Shot phase duration in oneshot mode</description>
	<access>read-write</access>
	<bitRange>[23:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER2_STATUS_REG</name>
	<description>Timer status register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_ONESHOT_PHASE</name>
	<description>OneShot phase
0 = Wait for event
1 = Delay phase
2 = Start Shot
3 = Shot phase</description>
	<access>read-only</access>
	<bitRange>[3:2]</bitRange>
	
</field><field>
	<name>TIM_IN2_STATE</name>
	<description>Gives the logic level of the IN1</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>TIM_IN1_STATE</name>
	<description>Gives the logic level of the IN2</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER2_TIMER_VAL_REG</name>
	<description>Timer counter value</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_TIMER_VALUE</name>
	<description>Gives the current timer value</description>
	<access>read-only</access>
	<bitRange>[23:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>TIMER3</name>
	<version>1.0</version>
	<description>TIMER3 registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50040a00</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>56</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>TIMER3_CAPTURE_GPIO1_REG</name>
	<description>Timer value for event on GPIO1</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_CAPTURE_GPIO1</name>
	<description>Gives the Capture time for event on GPIO1</description>
	<access>read-only</access>
	<bitRange>[23:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER3_CAPTURE_GPIO2_REG</name>
	<description>Timer value for event on GPIO2</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_CAPTURE_GPIO2</name>
	<description>Gives the Capture time for event on GPIO2</description>
	<access>read-only</access>
	<bitRange>[23:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER3_CLEAR_IRQ_REG</name>
	<description>Timer clear interrupt</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TIM_CLEAR_IRQ</name>
	<description>Write any value clear interrupt</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TIMER3_CTRL_REG</name>
	<description>Timer control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_CLK_EN</name>
	<description>Timer clock enable
1 = clock enabled
0 = clock disabled</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>TIM_SYS_CLK_EN</name>
	<description>Select clock
1 = Timer uses the DIVN clock
0 = Timer uses the lp clock</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>TIM_FREE_RUN_MODE_EN</name>
	<description>Valid when timer counts up, if it is '1' timer does not zero when reaches to reload value. it becomes zero only when it reaches the max value.</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>TIM_IRQ_EN</name>
	<description>Interrupt mask
1 = timer IRQ is unmasked
0 = timer IRQ is masked</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>TIM_IN2_EVENT_FALL_EN</name>
	<description>Event input 2 edge type
1 = falling edge
0 = rising edge</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>TIM_IN1_EVENT_FALL_EN</name>
	<description>Event input 1 edge type
1 = falling edge
0 = rising edge</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>TIM_COUNT_DOWN_EN</name>
	<description>Timer count direction
1 = down
0 = up</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>TIM_EN</name>
	<description>Timer enable
1 = On
0 = Off</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
