irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>TIMER4_TIMER_VAL_REG</name>
	<description>Timer counter value</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIM_TIMER_VALUE</name>
	<description>Gives the current timer value</description>
	<access>read-only</access>
	<bitRange>[23:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>TRNG</name>
	<version>1.0</version>
	<description>TRNG registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50040c00</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>12</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>TRNG_CTRL_REG</name>
	<description>TRNG control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TRNG_ENABLE</name>
	<description>0: Disable the TRNG
1: Enable the TRNG this signal is ignored when the FIFO is full</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TRNG_FIFOLVL_REG</name>
	<description>TRNG FIFO level register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TRNG_FIFOFULL</name>
	<description>1:FIFO full indication. This bit is cleared if the FIFO is read.</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>TRNG_FIFOLVL</name>
	<description>Number of 32 bit words of random data in the FIFO (max 31) until the FIFO is full. When it is 0 and TRNG_FIFOFULL is 1, it means the FIFO is full.</description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>TRNG_VER_REG</name>
	<description>TRNG Version register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000103</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TRNG_MAJ</name>
	<description>Major version number </description>
	<access>read-only</access>
	<bitRange>[31:24]</bitRange>
	
</field><field>
	<name>TRNG_MIN</name>
	<description>Minor version number </description>
	<access>read-only</access>
	<bitRange>[23:16]</bitRange>
	
</field><field>
	<name>TRNG_SVN</name>
	<description>SVN revision number </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>UART</name>
	<version>1.0</version>
	<description>UART registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50020000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>256</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>UART_CTR_REG</name>
	<description>Component Type Register</description>
	<addressOffset>0x000000fc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x44570110</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>UART_CTR</name>
	<description>Component Type Register </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART_DLF_REG</name>
	<description>Divisor Latch Fraction Register</description>
	<addressOffset>0x000000c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>UART_DLF</name>
	<description>The fractional value is added to integer value set by DLH, DLL. Fractional value is equal UART_DLF/16</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART_DMASA_REG</name>
	<description>DMA Software Acknowledge</description>
	<addressOffset>0x000000a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>UART_DMASA</name>
	<description>This register is use to perform DMA software acknowledge if a transfer needs to be terminated due to an error condition. For example, if the DMA disables the channel, then the DW_apb_uart should clear its request. This will cause the TX request, TX single, RX request and RX single signals to de-assert. Note that this bit is 'self-clearing' and it is not necessary to clear this bit.</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART_HTX_REG</name>
	<description>Halt TX</description>
	<addressOffset>0x000000a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>UART_HALT_TX</name>
	<description>This register is use to halt transmissions, so that the transmit FIFO can be filled by the master when FIFOs are implemented and enabled.
0 = Halt TX disabled
1 = Halt TX enabled
Note, if FIFOs are not enabled, the setting of the halt TX register has no effect on operation. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART_IER_DLH_REG</name>
	<description>Interrupt Enable Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>PTIME_DLH7</name>
	<description>Interrupt Enable Register: PTIME, Programmable THRE Interrupt Mode Enable. This is used to enable/disable the generation of THRE Interrupt. 0 = disabled 1 = enabled
Divisor Latch (High): Bit[7] of the 8 bit DLH register. </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>DLH6_5</name>
	<description>Divisor Latch (High): Bit[6:5] of the 8 bit DLH register</description>
	<access>read-write</access>
	<bitRange>[6:5]</bitRange>
	
</field><field>
	<name>ELCOLR_DLH4</name>
	<description>Interrupt Enable Register: (read only) ELCOLR, this bit controls the method for clearing the status in the LSR register. This is applicable only for Overrun Error, Parity Error, Framing Error, and Break Interrupt status bits.
Always 0 = LSR status bits are cleared either on reading Rx FIFO (RBR Read) or On reading LSR register.
Divisor Latch (High): Bit[4] of the 8 bit DLH register</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>EDSSI_DLH3</name>
	<description>Interrupt Enable Register: reserved
Divisor Latch (High): Bit[3] of the 8 bit DLH register </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>ELSI_DLH2</name>
	<description>Interrupt Enable Register: ELSI, Enable Receiver Line Status Interrupt. This is used to enable/disable the generation of Receiver Line Status Interrupt. This is the highest priority interrupt. 0 = disabled 1 = enabled
Divisor Latch (High): Bit[2] of the 8 bit DLH register. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>ETBEI_DLH1</name>
	<description>Interrupt Enable Register: ETBEI, Enable Transmit Holding Register Empty Interrupt. This is used to enable/disable the generation of Transmitter Holding Register Empty Interrupt. This is the third highest priority interrupt. 0 = disabled 1 = enabled 
Divisor Latch (High): Bit[1] of the 8 bit DLH register. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>ERBFI_DLH0</name>
	<description>Interrupt Enable Register: ERBFI, Enable Received Data Available Interrupt. This is used to enable/disable the generation of Received Data Available Interrupt and the Character Timeout Interrupt (if in FIFO mode and FIFO's enabled). These are the second highest priority interrupts. 0 = disabled 1 = enabled
Divisor Latch (High): Bit[0] of the 8 bit DLH register. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
