irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>UART3</name>
	<version>1.0</version>
	<description>UART3 registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50020200</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>256</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>UART3_CONFIG_REG</name>
	<description>ISO7816 Config Register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>ISO7816_SCRATCH_PAD</name>
	<description>This register is for programmers to use as a temporary storage space. It has no defined purpose in the UART Ctrl. </description>
	<access>read-write</access>
	<bitRange>[7:3]</bitRange>
	
</field><field>
	<name>ISO7816_ENABLE</name>
	<description>0 : Normal Uart
1 : ISO7816 Enabled</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>ISO7816_ERR_SIG_EN</name>
	<description>0 : Error Signal feature disabled
1 : Error Signal feature enabled
</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>ISO7816_CONVENTION</name>
	<description>0 : Direct convention
1 : Inverse convention
</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART3_CTRL_REG</name>
	<description>ISO7816 Control Register</description>
	<addressOffset>0x000000e0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>ISO7816_AUTO_GT</name>
	<description>0 : uart sends when tx data is available
1 : uart sends new character after guard time
</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	
</field><field>
	<name>ISO7816_ERR_TX_VALUE_IRQMASK</name>
	<description>0 : ERR_TX_VALUE IRQ is masked
1 : ERR_TX_VALUE IRQ is enabled
</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	
</field><field>
	<name>ISO7816_ERR_TX_TIME_IRQMASK</name>
	<description>0 : ERR_TX_TIME IRQ is masked
1 : ERR_TX_TIME IRQ is enabled
</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	
</field><field>
	<name>ISO7816_TIM_EXPIRED_IRQMASK</name>
	<description>0 : timer expired IRQ is masked
1 : timer expired IRQ is enabled
</description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	
</field><field>
	<name>ISO7816_CLK_STATUS</name>
	<description>0 : iso7816 clock is stopped
1 : iso7816 clock is running
</description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>ISO7816_CLK_LEVEL</name>
	<description>0 : iso7816 clock level low when stopped
1 : iso7816 clock level high when stopped
</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>ISO7816_CLK_EN</name>
	<description>0 : iso7816 clock disabled
1 : iso7816 clock enabled
</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>ISO7816_CLK_DIV</name>
	<description>ISO7816 clk freq = sclk/(2*(ISO7816_CLK_DIV+1)</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART3_CTR_REG</name>
	<description>Component Type Register</description>
	<addressOffset>0x000000fc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x44570110</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>UART_CTR</name>
	<description>Component Type Register </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART3_DLF_REG</name>
	<description>Divisor Latch Fraction Register</description>
	<addressOffset>0x000000c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>UART_DLF</name>
	<description>The fractional value is added to integer value set by DLH, DLL. Fractional value is equal UART_DLF/16</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART3_DMASA_REG</name>
	<description>DMA Software Acknowledge</description>
	<addressOffset>0x000000a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>UART_DMASA</name>
	<description>This register is use to perform DMA software acknowledge if a transfer needs to be terminated due to an error condition. For example, if the DMA disables the channel, then the DW_apb_uart should clear its request. This will cause the TX request, TX single, RX request and RX single signals to de-assert. Note that this bit is 'self-clearing' and it is not necessary to clear this bit.</description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART3_ERR_CTRL_REG</name>
	<description>ISO7816 Error Signal Control Register</description>
	<addressOffset>0x000000e8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000010e</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>ISO7816_ERR_PULSE_WIDTH</name>
	<description>When Error Signal feature is enable and receive mode, it gives the width of the error signal in 1/16etu</description>
	<access>read-write</access>
	<bitRange>[8:4]</bitRange>
	
</field><field>
	<name>ISO7816_ERR_PULSE_OFFSET</name>
	<description>When Error Signal feature is enable and receive mode, it gives the offset of the error signal in 1/16etu from the 9.6etu</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART3_HTX_REG</name>
	<description>Halt TX</description>
	<addressOffset>0x000000a4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>UART_HALT_TX</name>
	<description>This register is use to halt transmissions, so that the transmit FIFO can be filled by the master when FIFOs are implemented and enabled.
0 = Halt TX disabled
1 = Halt TX enabled
Note, if FIFOs are not enabled, the setting of the halt TX register has no effect on operation. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
