irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>UART3_SRTS_REG</name>
	<description>Shadow Request to Send</description>
	<addressOffset>0x0000008c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>UART_SHADOW_REQUEST_TO_SEND</name>
	<description>Shadow Request to Send.
This is a shadow register for the RTS bit (MCR[1]), this can be used to remove the burden of having to
performing a read-modify-write on the MCR. This is used to directly control the Request to Send (rts_n) output. The Request To Send (rts_n) output is used to inform the modem or data set that the UART Ctrl is ready to exchange data.
When Auto RTS Flow Control is not enabled (MCR[5] = 0), the rts_n signal is set low by programming MCR[1] (RTS) to a high.
In Auto Flow Control, (active MCR[5] = 1) and FIFOs enable (FCR[0] = 1), the rts_n output is controlled in the same way, but is also gated with the receiver FIFO threshold trigger (rts_n is inactive high when above the threshold).
Note that in Loopback mode (MCR[4] = 1), the rts_n output is held inactive-high while the value of this location is internally looped back to an input. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART3_SRT_REG</name>
	<description>Shadow RCVR Trigger</description>
	<addressOffset>0x0000009c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>UART_SHADOW_RCVR_TRIGGER</name>
	<description>Shadow RCVR Trigger.
This is a shadow register for the RCVR trigger bits (FCR[7:6]). This can be used to remove the burden of having to store the previously written value to the FCR in memory and having to mask this value so that only the RCVR trigger bit gets updated.
This is used to select the trigger level in the receiver FIFO at which the Received Data Available Interrupt is generated. It also determines when the dma_rx_req_n signal is asserted when DMA Mode (FCR[3]) = 1. The following trigger levels are supported:
00 = 1 character in the FIFO
01 = FIFO &#188; full
10 = FIFO &#189; full
11 = FIFO 2 less than full </description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART3_STET_REG</name>
	<description>Shadow TX Empty Trigger</description>
	<addressOffset>0x000000a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>UART_SHADOW_TX_EMPTY_TRIGGER</name>
	<description>Shadow TX Empty Trigger.
This is a shadow register for the TX empty trigger bits (FCR[5:4]). This can be used to remove the burden of having to store the previously written value to the FCR in memory and having to mask this value so that only the TX empty trigger bit gets updated.
This is used to select the empty threshold level at which the THRE Interrupts are generated when the mode is active. The following trigger levels are supported:
00 = FIFO empty
01 = 2 characters in the FIFO
10 = FIFO &#188; full
11 = FIFO &#189; full </description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART3_TAR_REG</name>
	<description>Transmit Address Register</description>
	<addressOffset>0x000000c8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>UART_TAR</name>
	<description>This is an address matching register during transmit mode. If DLS_E (LCR_EXT[0]) bit is enabled, then uart will send the 9-bit character with 9-th bit set to 1 and remaining 8-bit address will be sent from this register provided 'SEND_ADDR' (LCR_EXT[2]) bit is set to 1.
Note:
- This register is used only to send the address. The normal data should be sent by programming THR register.
- Once the address is started to send on the DW_apb_uart serial lane, then 'SEND_ADDR' bit will be auto-cleared by the hardware.</description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART3_TFL_REG</name>
	<description>Transmit FIFO Level</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>UART_TRANSMIT_FIFO_LEVEL</name>
	<description>Transmit FIFO Level.
This is indicates the number of data entries in the transmit FIFO. </description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART3_TIMER_REG</name>
	<description>ISO7816 Timer Register</description>
	<addressOffset>0x000000e4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>ISO7816_TIM_MODE</name>
	<description>0 : Timer will count up to max value then stops. Timer has to be disabled and enabled again to restart. Timer is clocked with the ISO7816 clock
1 : Timer will count guard time. ISO7816_TIM_MAX has to be 16*GuardTime-1
</description>
	<access>read-write</access>
	<bitRange>[17:17]</bitRange>
	
</field><field>
	<name>ISO7816_TIM_EN</name>
	<description>0 : Timer is disabled
1 : Timer is enabled
</description>
	<access>read-write</access>
	<bitRange>[16:16]</bitRange>
	
</field><field>
	<name>ISO7816_TIM_MAX</name>
	<description>On write : timer will count from 0 to ISO7816_TIM_MAX
On read : gives the current timer value
</description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>UART3_UCV_REG</name>
	<description>Component Version</description>
	<addressOffset>0x000000f8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x3430312a</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>UART_UCV</name>
	<description>Component Version </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
