irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>USB_CHARGER_CTRL_REG</name>
	<description>USB Charger Control Register</description>
	<addressOffset>0x000001a8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>IDM_SINK_ON</name>
	<description>0 = Disable
1 = Enable the Idm_sink to USBm</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>IDP_SINK_ON</name>
	<description>0 = Disable
1 = Enable the Idp_sink to USBp</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>VDM_SRC_ON</name>
	<description>0 = Disable
1 = Enable Vdm_src to USBm and USB_DCP_DET status bit.</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>VDP_SRC_ON</name>
	<description>0 = Disable
1 = Enable the Vdp_src to USB_CHG_DET status bit.</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>IDP_SRC_ON</name>
	<description>0 = Disable
1 = Enable the Idp_src and Rdm_dwn.</description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>USB_CHARGE_ON</name>
	<description>0 = Disable USB charger detect circuit.
1 = Enable USB charger detect circuit.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>USB_CHARGER_STAT_REG</name>
	<description>USB Charger Status Register</description>
	<addressOffset>0x000001ac</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>USB_DM_VAL2</name>
	<description>0 = USBm &lt;2.3V
1 = USBm &gt;2.5V</description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>USB_DP_VAL2</name>
	<description>0: USBp &lt; 2.3V
1: USBp &gt; 2.5V</description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>USB_DM_VAL</name>
	<description>0 = USBm &lt; 0.8V
1 = USBm &gt; 1.5V (PS2 or Proprietary Charger)</description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>USB_DP_VAL</name>
	<description>0 = USBp &lt; 0.8V
1 = USBp &gt; 1.5V</description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>USB_CHG_DET</name>
	<description>0 = Standard downstream or nothing connected.
1 = Charging Downstream Port (CDP) or Dedicated Charging.</description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>USB_DCP_DET</name>
	<description>0 = Charging downstream port is detected.
1 = Dedicated charger is detected.
Control bit VDM_SRC_ON must be set to validate this status bit.
Note: This register shows the actual status.</description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>USB_DMA_CTRL_REG</name>
	<description>USB DMA control register</description>
	<addressOffset>0x000001a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>USB_DMA_EN</name>
	<description>0 = USB DMA control off. (Normal operation)
1 = USB_DMA on. DMA channels 0 and 1 are connected by
USB Endpoint according bits USB_DMA_TX and USB_DMA_RX</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>USB_DMA_TX</name>
	<description>000 = DMA channels 1 is connected Tx USB Endpoint 1
001 = DMA channels 1 is connected Tx USB Endpoint 3
010 = DMA channels 1 is connected Tx USB Endpoint 5
100, 1xx = Reserved</description>
	<access>read-write</access>
	<bitRange>[5:3]</bitRange>
	
</field><field>
	<name>USB_DMA_RX</name>
	<description>000 = DMA channels 0 is connected Rx USB Endpoint 2
001 = DMA channels 0 is connected Rx USB Endpoint 4
010 = DMA channels 0 is connected Rx USB Endpoint 6
100, 1xx = Reserved</description>
	<access>read-write</access>
	<bitRange>[2:0]</bitRange>
	
</field></fields>
</register><register>
	<name>USB_EP0_NAK_REG</name>
	<description>EP0 INNAK and OUTNAK Register</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>USB_EP0_OUTNAK</name>
	<description>End point 0 OUT NAK
This bit n is set to 1 when a NAK handshake is generated for an enabled address/endpoint combination (AD_EN in the FAR register is set to 1) in response to an OUT token. This bit is not set if NAK is generated as result of an overrun condition. It is cleared when the register is read. </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	
</field><field>
	<name>USB_EP0_INNAK</name>
	<description>End point 0 IN NAK
This bit is set to 1 when a NAK handshake is generated for an enabled address/endpoint combination (AD_EN in the FAR register is set to 1) in response to an IN token. This bit is cleared when the register is read. </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	
</field></fields>
</register><register>
	<name>USB_EPC0_REG</name>
	<description>Endpoint Control 0 Register</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>USB_STALL</name>
	<description>Stall
Setting this bit to 1 causes the chip to generate STALL handshakes under the following conditions:
- The transmit FIFO is enabled and an IN token is received.
- The receive FIFO is enabled and an OUT token is received.
Note: A SETUP token does not cause a STALL handshake to be generated when this bit is set.
Upon transmitting the STALL handshake, the RX_LAST and the TX_DONE bits in the respective Receive/Transmit Status registers are set to 1. </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>USB_DEF</name>
	<description>Default Address
When set to 1, the device responds to the default address regardless of the contents of FAR6-0/EP03-0 fields. When an IN packet is transmitted for the endpoint, the DEF bit is automatically cleared to 0.
This bit aids in the transition from default address to assigned address. The transition from the default address 00000000000b to an address assigned during bus enumeration may not occur in the middle of the SET_ADDRESS control sequence. This is necessary to complete the control sequence. However, the address must change immediately after this sequence finishes in order to avoid errors when another control sequence immediately follows the SET_ADDRESS command.
On USB reset, the firmware has 10 ms for set-up, and should write 8016 to the FAR register and 0016 to the EPC0 register. On receipt of a SET_ADDRESS command, the firmware must write 4016 to the EPC0 register and (8016 or &lt;assigned_function_address&gt;) to the FAR register. It must then queue a zero length IN packet to complete the status phase of the SET_ADDRESS control sequence. </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>USB_EP</name>
	<description>Endpoint Address
This field holds the 4-bit Endpoint address. For Endpoint 0, these bits are hardwired to 0000b. Writing a 1 to any of the EP bits is ignored. </description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
