irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>USB_RXS2_REG</name>
	<description>Receive Status Register 2</description>
	<addressOffset>0x000000d8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>USB_RXCOUNT</name>
	<description>it contains the number of bytes presently in the endpoint receive FIFO (range 0..64)</description>
	<access>read-only</access>
	<bitRange>[14:8]</bitRange>
	
</field><field>
	<name>USB_RX_ERR</name>
	<description>Receive Error
When set to 1, this bit indicates a media error, such as bit-stuffing or CRC. If this bit is set to 1, the firmware must flush the respective FIFO. </description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>USB_SETUP</name>
	<description>Setup
This bit indicates that the setup packet has been received. It is cleared when this register is read. </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>USB_TOGGLE_RX</name>
	<description>Toggle
The function of this bit differs depending on whether ISO (ISO in the EPCn register is set) or non-ISO operation (ISO is reset) is used.
For non-ISO operation, a value of 0 indicates that the last successfully received packet had a DATA0 PID, while a value of 1 indicates that this packet had a DATA1 PID.
For ISO operation, this bit reflects the LSB of the frame number (FNL0) after a packet was successfully received for this endpoint.
This bit is reset to 0 by reading the RXSn register. </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>USB_RX_LAST</name>
	<description>Receive Last
This bit indicates that an ACK was sent upon completion of a successful receive operation. This bit is cleared to 0 when this register is read. </description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>USB_RCOUNT</name>
	<description>Receive Counter
This 4-bit field contains the number of bytes presently in the endpoint receive FIFO. If this number is greater than 15, a value of 15 is actually reported. </description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>USB_RXS3_REG</name>
	<description>Receive Status Register 3</description>
	<addressOffset>0x000000f8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>USB_RXCOUNT</name>
	<description>it contains the number of bytes presently in the endpoint receive FIFO (range 0..64)</description>
	<access>read-only</access>
	<bitRange>[14:8]</bitRange>
	
</field><field>
	<name>USB_RX_ERR</name>
	<description>Receive Error
When set to 1, this bit indicates a media error, such as bit-stuffing or CRC. If this bit is set to 1, the firmware must flush the respective FIFO. </description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>USB_SETUP</name>
	<description>Setup
This bit indicates that the setup packet has been received. It is cleared when this register is read. </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>USB_TOGGLE_RX</name>
	<description>Toggle
The function of this bit differs depending on whether ISO (ISO in the EPCn register is set) or non-ISO operation (ISO is reset) is used.
For non-ISO operation, a value of 0 indicates that the last successfully received packet had a DATA0 PID, while a value of 1 indicates that this packet had a DATA1 PID.
For ISO operation, this bit reflects the LSB of the frame number (FNL0) after a packet was successfully received for this endpoint.
This bit is reset to 0 by reading the RXSn register. </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>USB_RX_LAST</name>
	<description>Receive Last
This bit indicates that an ACK was sent upon completion of a successful receive operation. This bit is cleared to 0 when this register is read. </description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>USB_RCOUNT</name>
	<description>Receive Counter
This 4-bit field contains the number of bytes presently in the endpoint receive FIFO. If this number is greater than 15, a value of 15 is actually reported. </description>
	<access>read-only</access>
	<bitRange>[3:0]</bitRange>
	
</field></fields>
</register><register>
	<name>USB_TCR_REG</name>
	<description>Transceiver configuration Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000090</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>USB_VADJ</name>
	<description>Reference Voltage/ Threshold voltage AdjustControls the single-ended receiver threshold.
Shall not be modified unless instructed by Dialog Semiconductor
Only enabled if USB_UTR_REG[7] = 1 </description>
	<access>read-write</access>
	<bitRange>[7:5]</bitRange>
	
</field><field>
	<name>USB_CADJ</name>
	<description>Transmitter Current Adjust
Controls the driver edge rate control current.
Shall not be modified unless instructed by Dialog Semiconductor
Only enabled if USB_UTR_REG[7] = 1 </description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>USB_TXC0_REG</name>
	<description>Transmit command 0 Register</description>
	<addressOffset>0x0000008c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>USB_IGN_IN</name>
	<description>Ignore IN Tokens
When this bit is set to 1, the endpoint will ignore any IN tokens directed to its configured address. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	
</field><field>
	<name>USB_FLUSH</name>
	<description>Flush FIFO
Writing a 1 to this bit flushes all data from the control endpoint FIFOs, resets the endpoint to Idle state, clears the FIFO read and write pointer, and then clears itself. If the endpoint is currently using the FIFO0 to transfer data on USB, flushing is delayed until after the transfer is done. It is equivalent to the FLUSH bit in the RXC0 register. </description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	
</field><field>
	<name>USB_TOGGLE_TX0</name>
	<description>Toggle
This bit specifies the PID used when transmitting the packet. A value of 0 causes a DATA0 PID to be generated, while a value of 1 causes a DATA1 PID to be generated. This bit is not altered by the hardware. </description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	
</field><field>
	<name>USB_TX_EN</name>
	<description>Transmission Enable
This bit enables data transmission from the FIFO. It is cleared to 0 by hardware after transmitting a single packet, or a STALL handshake, in response to an IN token. It must be set to 1 by firmware to start packet transmission. The RX_EN bit in the Receive Command 0 (RXC0) register takes precedence over this bit; i.e. if RX_EN is set, TX_EN bit is ignored until RX_EN is reset.
Zero length packets are indicated by setting this bit without writing any data to the FIFO. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	
