irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>USB_TXS2_REG</name>
	<description>Transmit Status Register 2</description>
	<addressOffset>0x000000c8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000001f</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>USB_TX_URUN</name>
	<description>Transmit FIFO Underrun
This bit is set to 1, if the transmit FIFO becomes empty during a transmission, and no new data is written to the FIFO. If so, the Media Access Controller (MAC) forces a bit stuff error followed by an EOP. This bit is cleared to 0, when this register is read. </description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>USB_ACK_STAT</name>
	<description>Acknowledge Status
This bit is interpreted when TX_DONE is set. It's function differs depending on whether ISO (ISO in the EPCx register is set) or non-ISO operation (ISO is reset) is used.
For non-ISO operation, this bit indicates the acknowledge status (from the host) about the ACK for the previously sent packet. This bit itself is set to 1, when an ACK is received; otherwise, it is cleared to 0.
For ISO operation, this bit is set if a frame number LSB match (see IGN_ISOMSK bit in the USB_TXCx_REG) occurs, and data was sent in response to an IN token. Otherwise, this bit is cleared to 0, the FIFO is flushed and TX_DONE is set.
This bit is also cleared to 0, when this register is read. </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>USB_TX_DONE</name>
	<description>Transmission Done
When set to 1, this bit indicates that the endpoint responded to a USB packet. Three conditions can cause this bit to be set:
A data packet completed transmission in response to an IN token with non-ISO operation.
The endpoint sent a STALL handshake in response to an IN token
A scheduled ISO frame was transmitted or discarded.
This bit is cleared to 0 when this register is read. </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>USB_TCOUNT</name>
	<description>Transmission Count
This 5-bit field holds the number of empty bytes available in the FIFO. If this number is greater than 31, a value of 31 is actually reported. </description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>USB_TXS3_REG</name>
	<description>Transmit Status Register 3</description>
	<addressOffset>0x000000e8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000001f</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>USB_TX_URUN</name>
	<description>Transmit FIFO Underrun
This bit is set to 1, if the transmit FIFO becomes empty during a transmission, and no new data is written to the FIFO. If so, the Media Access Controller (MAC) forces a bit stuff error followed by an EOP. This bit is cleared to 0, when this register is read. </description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>USB_ACK_STAT</name>
	<description>Acknowledge Status
This bit is interpreted when TX_DONE is set. It's function differs depending on whether ISO (ISO in the EPCx register is set) or non-ISO operation (ISO is reset) is used.
For non-ISO operation, this bit indicates the acknowledge status (from the host) about the ACK for the previously sent packet. This bit itself is set to 1, when an ACK is received; otherwise, it is cleared to 0.
For ISO operation, this bit is set if a frame number LSB match (see IGN_ISOMSK bit in the USB_TXCx_REG) occurs, and data was sent in response to an IN token. Otherwise, this bit is cleared to 0, the FIFO is flushed and TX_DONE is set.
This bit is also cleared to 0, when this register is read. </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>USB_TX_DONE</name>
	<description>Transmission Done
When set to 1, this bit indicates that the endpoint responded to a USB packet. Three conditions can cause this bit to be set:
A data packet completed transmission in response to an IN token with non-ISO operation.
The endpoint sent a STALL handshake in response to an IN token
A scheduled ISO frame was transmitted or discarded.
This bit is cleared to 0 when this register is read. </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>USB_TCOUNT</name>
	<description>Transmission Count
This 5-bit field holds the number of empty bytes available in the FIFO. If this number is greater than 31, a value of 31 is actually reported. </description>
	<access>read-only</access>
	<bitRange>[4:0]</bitRange>
	
</field></fields>
</register><register>
	<name>USB_UTR_REG</name>
	<description>USB test Register (for test purpose only)</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>USB_DIAG</name>
	<description>Diagnostic enable
'0': Normal operational.
'1': Access to the USB_XCVDIAG_REG and USB_TCR_REG enabled. For diagnostic purposes only </description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	
</field><field>
	<name>USB_NCRC</name>
	<description>No CRC16
When this bit is set to 1, all packets transmitted by the Full/Low Speed USB node are sent without a trailing CRC16. Receive operations are unaffected. This mode is used to check that CRC errors can be detected by other nodes. For diagnostic purposes only </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	
</field><field>
	<name>USB_SF</name>
	<description>Short Frame
Enables the Frame timer to lock and track, short, non-compliant USB frame sizes. The Short Frame bit should not be set during normal operation. For test purposes only </description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	
</field><field>
	<name>USB_UTR_RES</name>
	<description>Reserved. Must be kept to '0' </description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	
