irshad-js/FreeRTOS-experimentations/FreeRTOS_SEGGER_Template/DA14690/D2522.svd
</field></fields>
</register><register>
	<name>WKUP_POL_P0_REG</name>
	<description>select the sesitivity polarity for each P0 input</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>WKUP_POL_P0</name>
	<description>0: enabled input P0_xx will give an event if that input goes high
1: enabled input P0_xx will give an event if that input goes low</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_POL_P1_REG</name>
	<description>select the sesitivity polarity for each P1 input</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields>
	<field>
	<name>WKUP_POL_P1</name>
	<description>0: enabled input P1_xx will give an event if that input goes high
1: enabled input P1_xx will give an event if that input goes low</description>
	<access>read-write</access>
	<bitRange>[22:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_RESET_IRQ_REG</name>
	<description>Reset wakeup interrupt</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>WKUP_IRQ_RST</name>
	<description>writing any value to this register will reset the interrupt. reading always returns 0. </description>
	<access>write-only</access>
	<bitRange>[15:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_SELECT_P0_REG</name>
	<description>select which inputs from P0 port can trigger wkup counter</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>WKUP_SELECT_P0</name>
	<description>0: input P0_xx is not enabled for wakeup event
1: input P0_xx is enabled for wakeup event</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_SELECT_P1_REG</name>
	<description>select which inputs from P1 port can trigger wkup counter</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields>
	<field>
	<name>WKUP_SELECT_P1</name>
	<description>0: input P1_xx is not enabled for wakeup event
1: input P1_xx is enabled for wakeup event </description>
	<access>read-write</access>
	<bitRange>[22:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_SEL_GPIO_P0_REG</name>
	<description>select which inputs from P0 port can trigger interrupt</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>WKUP_SEL_GPIO_P0</name>
	<description>0: input P0_xx is not enabled for GPIO interrupt
1: input P0_xx is enabled for GPIO interrupt</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_SEL_GPIO_P1_REG</name>
	<description>select which inputs from P1 port can trigger interrupt</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields>
	<field>
	<name>WKUP_SEL_GPIO_P1</name>
	<description>0: input P1_xx is not enabled for GPIO interrupt
1: input P1_xx is enabled for GPIO interrupt</description>
	<access>read-write</access>
	<bitRange>[22:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_STATUS_P0_REG</name>
	<description>Event status register for P0 and P1</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>WKUP_STAT_P0</name>
	<description>Contains the latched value of any toggle of the GPIOs Port P0. WKUP_STAT_P0[0] -&gt; P0_00.</description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	
</field></fields>
</register><register>
	<name>WKUP_STATUS_P1_REG</name>
	<description>Event status register for P2</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields>
	<field>
	<name>WKUP_STAT_P1</name>
	<description>Contains the latched value of any toggle of the GPIOs Port P1 WKUP_STATUS_1[0] -&gt; P1_00.</description>
	<access>read-only</access>
	<bitRange>[22:0]</bitRange>
	
</field></fields>
</register></registers>
</peripheral></peripherals>
</device>

